Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: This response isolates the browsing context to the same origin%(report_only)s.
es: Esta respuesta aísla el contexto de navegación al mismo origen%(report_only)s.
fr: Cette réponse isole le contexte de navigation à la même origine%(report_only)s.
ja: このレスポンスは、ブラウジングコンテキストを同一オリジンに限定します%(report_only)s。
zh: 此响应将浏览上下文限制在同源%(report_only)s。

source: The `same-origin` [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) isolates the browsing context, preventing it from sharing a window object with cross-origin documents in supporting browsers.%(report_only_text)s
es: La política `same-origin` [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) aísla el contexto de navegación, impidiendo que comparta un objeto de ventana con documentos de origen cruzado en navegadores compatibles.%(report_only_text)s
fr: La [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) `same-origin` isole le contexte de navigation, l'empêchant de partager un objet window avec des documents inter-origines dans les navigateurs qui la prennent en charge.%(report_only_text)s
ja: `same-origin` [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) はブラウジングコンテキストを分離し、対応ブラウザではクロスオリジンのドキュメントとウィンドウオブジェクトを共有できないようにします。%(report_only_text)s
zh: `same-origin` [跨源打开策略](https://html.spec.whatwg.org/multipage/origin.html#coop) 会隔离浏览上下文，阻止其在支持的浏览器中与跨源文档共享窗口对象。%(report_only_text)s

source: This response isolates the browsing context but allows popups%(report_only)s.
es: Esta respuesta aísla el contexto de navegación pero permite ventanas emergentes%(report_only)s.
fr: Cette réponse isole le contexte de navigation mais autorise les fenêtres contextuelles%(report_only)s.
ja: このレスポンスは、ブラウジングコンテキストを分離しますが、ポップアップを許可します%(report_only)s。
zh: 此响应隔离了浏览上下文，但允许弹出窗口%(report_only)s。

source: The `same-origin-allow-popups` [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) isolates the browsing context but maintains a relationship with popups that it opens, or that opened it, in supporting browsers.%(report_only_text)s
es: La política `same-origin-allow-popups` [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) aísla el contexto de navegación pero mantiene una relación con las ventanas emergentes que abre, o que la abrieron, en navegadores compatibles.%(report_only_text)s
fr: Le `same-origin-allow-popups` [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) isole le contexte de navigation mais maintient une relation avec les pop-ups qu'il ouvre, ou qui l'ont ouvert, dans les navigateurs compatibles.%(report_only_text)s
ja: `same-origin-allow-popups` [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) は、ブラウジングコンテキストを分離しますが、サポートしているブラウザで開くポップアップ、または自分を開いたポップアップとの関係を維持します。%(report_only_text)s
zh: `same-origin-allow-popups` [跨源打开者策略](https://html.spec.whatwg.org/multipage/origin.html#coop) 会隔离浏览上下文，但会在支持的浏览器中与它打开的弹出窗口，或打开它的弹出窗口保持关联。%(report_only_text)s

source: This response allows sharing the browsing context with cross-origin documents%(report_only)s.
es: Esta respuesta permite compartir el contexto de navegación con documentos de origen cruzado%(report_only)s.
fr: Cette réponse permet de partager le contexte de navigation avec des documents cross-origin%(report_only)s.
ja: このレスポンスは、クロスオリジン文書とブラウジングコンテキストを共有できます%(report_only)s。
zh: 此响应允许与跨域文档共享浏览上下文%(report_only)s。

source: The `unsafe-none` [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) is the default behavior in supporting browsers. It allows the document to share a browsing context group with other documents unless they enforce isolation.%(report_only_text)s
es: El `unsafe-none` de la [Política de Apertura de Origen Cruzado](https://html.spec.whatwg.org/multipage/origin.html#coop) es el comportamiento predeterminado en los navegadores compatibles. Permite que el documento comparta un grupo de contexto de navegación con otros documentos a menos que apliquen aislamiento.%(report_only_text)s
fr: Le `unsafe-none` [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) est le comportement par défaut dans les navigateurs pris en charge. Il permet au document de partager un groupe de contexte de navigation avec d'autres documents, à moins qu'ils n'appliquent l'isolation.%(report_only_text)s
ja: `unsafe-none` [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) は、対応ブラウザにおけるデフォルトの動作です。これにより、ドキュメントは、他のドキュメントが分離を強制しない限り、ブラウジングコンテキストグループを共有できます。%(report_only_text)s
zh: `unsafe-none` [跨源打开策略](https://html.spec.whatwg.org/multipage/origin.html#coop) 是支持浏览器的默认行为。它允许文档与其他强制隔离的文档共享浏览上下文组。%(report_only_text)s

source: The `%(field_name)s` header must be one of `same-origin`, `same-origin-allow-popups`, or `unsafe-none`.
es: La cabecera `%(field_name)s` debe ser `same-origin`, `same-origin-allow-popups` o `unsafe-none`.
fr: L'en-tête `%(field_name)s` doit être l'un des suivants : `same-origin`, `same-origin-allow-popups` ou `unsafe-none`.
ja: `%(field_name)s` ヘッダーは、`same-origin`、`same-origin-allow-popups`、または `unsafe-none` のいずれかである必要があります。
zh: `%(field_name)s` 标头必须是 `same-origin`、`same-origin-allow-popups` 或 `unsafe-none` 之一。

source: The `report-to` parameter in the [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) header specifies a reporting endpoint, but no matching endpoint refers to it in the `Reporting-Endpoints` header.
es: El parámetro `report-to` en el encabezado [Cross-Origin Opener Policy](https://html.spec.whatwg.org/multipage/origin.html#coop) especifica un punto final de informe, pero ningún punto final coincidente hace referencia a él en el encabezado `Reporting-Endpoints`.
fr: Le paramètre `report-to` dans l'en-tête [Politique d'ouverture inter-origines](https://html.spec.whatwg.org/multipage/origin.html#coop) spécifie un point de terminaison de signalement, mais aucun point de terminaison correspondant ne fait référence à celui-ci dans l'en-tête `Reporting-Endpoints`.

source: This response has both enforcing and report-only COOP headers.
es: Esta respuesta tiene cabeceras COOP de imposición y solo de reporte.
fr: Cette réponse a à la fois des en-têtes COOP d'application et de rapport d'erreurs.
ja: このレスポンスには、enforce および report-only の COOP ヘッダーの両方が含まれています。
zh: 此响应同时包含强制和仅报告的 COOP 标头。

source: A response should not have both `Cross-Origin-Opener-Policy` and `Cross-Origin-Opener-Policy-Report-Only` headers. The report-only header will be ignored.
es: Una respuesta no debería tener las cabeceras `Cross-Origin-Opener-Policy` y `Cross-Origin-Opener-Policy-Report-Only` al mismo tiempo. La cabecera report-only será ignorada.
fr: Une réponse ne doit pas avoir à la fois les en-têtes `Cross-Origin-Opener-Policy` et `Cross-Origin-Opener-Policy-Report-Only`. L'en-tête en mode rapport sera ignoré.
ja: `Cross-Origin-Opener-Policy` ヘッダーと `Cross-Origin-Opener-Policy-Report-Only` ヘッダーの両方をレスポンスに含めることはできません。レポート専用ヘッダーは無視されます。
zh: 响应不应同时包含 `Cross-Origin-Opener-Policy` 和 `Cross-Origin-Opener-Policy-Report-Only` 标头。report-only 标头将被忽略。

source: This response is only available for reading to requests from the same origin.
es: Esta respuesta solo está disponible para lectura en solicitudes del mismo origen.
fr: Cette réponse n'est disponible en lecture que pour les requêtes de la même origine.
ja: このレスポンスは、同一オリジンからのリクエストに対してのみ読み取り専用で利用可能です。
zh: 此响应仅对来自同一来源的请求可用。

source: The `same-origin` [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) prevents the resource from being read by any cross-origin document in supporting browsers.%(report_only_text)s
es: La política de recursos de origen cruzado `same-origin` [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) evita que el recurso sea leído por cualquier documento de origen cruzado en navegadores compatibles.%(report_only_text)s
fr: La politique `same-origin` [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) empêche la ressource d'être lue par tout document inter-origine dans les navigateurs compatibles.%(report_only_text)s
ja: `same-origin` [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) は、サポートしているブラウザにおいて、クロスオリジン文書からのリソースの読み取りを防止します。%(report_only_text)s
zh: `same-origin` [跨源资源策略](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) 可防止支持的浏览器中的任何跨源文档读取该资源。%(report_only_text)s

source: This response is available for reading to requests from the same site.
es: Esta respuesta está disponible para ser leída por solicitudes del mismo sitio.
fr: Cette réponse est consultable pour les requêtes provenant du même site.
ja: このレスポンスは、同一サイトからのリクエストでのみ読み取り可能です。
zh: 此响应可供同一来源的请求读取。

source: The `same-site` [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) allows the resource to be read by documents from the same site, but prevents it from being read by cross-site documents in supporting browsers.%(report_only_text)s
es: La política `same-site` de [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) permite que el recurso sea leído por documentos del mismo sitio, pero evita que sea leído por documentos de sitios cruzados en navegadores compatibles.%(report_only_text)s
fr: La politique `same-site` [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) permet à la ressource d'être lue par des documents du même site, mais l'empêche d'être lue par des documents inter-sites dans les navigateurs compatibles.%(report_only_text)s
ja: `same-site` [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) により、リソースは同一サイトのドキュメントから読み取ることができますが、対応ブラウザではクロスサイトのドキュメントからの読み取りを防ぎます。%(report_only_text)s
zh: `same-site` [跨源资源策略](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) 允许来自同一站点的文档读取资源，但在支持的浏览器中会阻止跨站文档读取该资源。%(report_only_text)s

source: This response is available for reading to requests from all origins.
es: Esta respuesta está disponible para su lectura por solicitudes de todos los orígenes.
fr: Cette réponse est disponible pour être lue par les requêtes provenant de toutes les origines.
ja: このレスポンスは、すべてのオリジンからのリクエストで読み取り可能です。
zh: 此响应可供所有来源的请求进行读取。

source: The `cross-origin` [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) allows the resource to be read by any document in supporting browsers, regardless of its origin.%(report_only_text)s
es: La directiva `cross-origin` [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) permite que el recurso sea leído por cualquier documento en navegadores compatibles, independientemente de su origen.%(report_only_text)s
fr: La politique `cross-origin` [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) permet à la ressource d'être lue par tout document dans les navigateurs compatibles, quelle que soit son origine.%(report_only_text)s
ja: `cross-origin` [Cross-Origin Resource Policy](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) により、リソースは、そのオリジンに関係なく、サポートしているブラウザの任意のドキュメントから読み取ることができます。%(report_only_text)s
zh: `cross-origin` [同源资源策略](https://fetch.spec.whatwg.org/#cross-origin-resource-policy-header) 允许支持浏览器的任何文档读取该资源，无论其来源如何。%(report_only_text)s

source: Cross-Origin-Resource-Policy has an invalid value.
es: Cross-Origin-Resource-Policy tiene un valor no válido.
fr: Cross-Origin-Resource-Policy a une valeur non valide.
ja: Cross-Origin-Resource-Policy に無効な値が指定されています。
zh: Cross-Origin-Resource-Policy 的值无效。

source: `%(value)s` is not a valid in the `Cross-Origin-Resource-Policy` header; it must be one of `same-origin`, `same-site`, or `cross-origin`.
es: El `%(value)s` no es válido en el encabezado `Cross-Origin-Resource-Policy`; debe ser `same-origin`, `same-site` o `cross-origin`.
fr: « %(value)s » n'est pas une valeur valide pour l'en-tête « Cross-Origin-Resource-Policy » ; il doit être « same-origin », « same-site » ou « cross-origin ».

source: The server's clock is correct.
es: El reloj del servidor es correcto.
fr: L'horloge du serveur est correcte.
ja: サーバーの時計は正しいです。
zh: 服务器的时钟是正确的。

source: HTTP's caching model assumes reasonable synchronisation between clocks on the server and client; compared to the local clock, the server's clock appears to be well-synchronised.
es: El modelo de caché de HTTP asume una sincronización razonable entre los relojes del servidor y el cliente; en comparación con el reloj local, el reloj del servidor parece estar bien sincronizado.
fr: Le modèle de mise en cache de HTTP suppose une synchronisation raisonnable entre les horloges du serveur et du client ; par rapport à l'horloge locale, l'horloge du serveur semble bien synchronisée.
ja: HTTPのキャッシュモデルは、サーバーとクライアントの時計の合理的な同期を前提としています。ローカル時計と比較して、サーバーの時計は適切に同期されているように見えます。
zh: HTTP 的缓存模型假定服务器和客户端的时钟在合理范围内同步； 与本地时钟相比，服务器的时钟似乎同步得很好。

source: The server's clock is %(clock_skew_string)s.
es: El reloj del servidor está %(clock_skew_string)s.
fr: L'horloge du serveur est %(clock_skew_string)s.
ja: サーバーの時計は %(clock_skew_string)s です。
zh: 服务器时钟为 %(clock_skew_string)s。

source: Compared to the local clock, the server's clock does not appear to be well-synchronised. HTTP's caching model assumes reasonable synchronisation between clocks on the server and client; clock skew can cause responses that should be cacheable to be considered uncacheable (especially if their freshness lifetime is short). Ask your server administrator to synchronise the clock, e.g., using [NTP](http://en.wikipedia.org/wiki/Network_Time_Protocol Network Time Protocol). Apparent clock skew can also be caused by caching the response without adjusting the `Age` header; e.g., in a reverse proxy or Content Delivery network. See [this paper](https://www.usenix.org/legacy/events/usits01/full_papers/cohen/cohen_html/index.html) for more information.
es: Comparado con el reloj local, el reloj del servidor no parece estar bien sincronizado. El modelo de caché de HTTP asume una sincronización razonable entre los relojes del servidor y el cliente; la desviación del reloj puede hacer que las respuestas que deberían ser cacheadas se consideren no cacheadas (especialmente si su vida útil de frescura es corta). Pida a su administrador de servidor que sincronice el reloj, por ejemplo, usando [NTP](http://en.wikipedia.org/wiki/Network_Time_Protocol Protocolo de Tiempo de Red). La desviación aparente del reloj también puede ser causada al cachear la respuesta sin ajustar la cabecera `Age`; por ejemplo, en un proxy inverso o una red de entrega de contenidos. Consulte [este artículo](https://www.usenix.org/legacy/events/usits01/full_papers/cohen/cohen_html/index.html) para más información.
fr: Comparé à l'horloge locale, l'horloge du serveur ne semble pas être bien synchronisée. Le modèle de mise en cache HTTP suppose une synchronisation raisonnable entre les horloges du serveur et du client ; le décalage horaire peut amener des réponses qui devraient être cachables à être considérées comme non cachables (surtout si leur durée de vie de fraîcheur est courte). Demandez à votre administrateur système de synchroniser l'horloge, par exemple, en utilisant [NTP](http://en.wikipedia.org/wiki/Network_Time_Protocol Network Time Protocol). Un décalage horaire apparent peut également être causé par la mise en cache de la réponse sans ajuster l'en-tête `Age` ; par exemple, dans un proxy inverse ou un réseau de diffusion de contenu (CDN). Voir [ce papier](https://www.usenix.org/legacy/events/usits01/full_papers/cohen/cohen_html/index.html) pour plus d'informations.
ja: ローカルクロックと比較して、サーバーのクロックは同期が取れていないようです。 HTTPのキャッシュモデルでは、サーバーとクライアントのクロック間で合理的な同期が取れていることを前提としています。 クロックのずれは、キャッシュ可能であるべきレスポンスがキャッシュ不可能と見なされる原因となり得ます（特に鮮度寿命が短い場合）。 サーバー管理者にクロックの同期を依頼してください。例えば、 [NTP](http://en.wikipedia.org/wiki/Network_Time_Protocol ネットワーク・タイム・プロトコル) を使用して同期してください。 `Age` ヘッダーを調整せずにレスポンスをキャッシュすることによっても、クロックのずれが生じることがあります。 例えば、リバースプロキシやコンテンツデリバリネットワークです。詳細については、[こちらの論文](https://www.usenix.org/legacy/events/usits01/full_papers/cohen/cohen_html/index.html) を参照してください。
zh: 与本地时钟相比，服务器时钟似乎未正确同步。 HTTP 的缓存模型假定服务器和客户端之间的时钟大致同步； 时钟偏差可能导致本应可缓存的响应被视为不可缓存（尤其是在 其新鲜度寿命很短的情况下）。 请让您的服务器管理员同步时钟，例如使用 [NTP](http://en.wikipedia.org/wiki/Network_Time_Protocol 网络时间协议)。 响应未调整 `Age` 标头进行缓存也会导致明显的时钟偏差； 例如，在反向代理或内容分发网络中。有关更多信息，请参阅[此 论文](https://www.usenix.org/legacy/events/usits01/full_papers/cohen/cohen_html/index.html)。

source: It appears that the Date header has been changed by an intermediary.
es: Parece que la cabecera Date ha sido modificada por un intermediario.
fr: Il semble que l'en-tête Date ait été modifié par un intermédiaire.
ja: Date ヘッダーが中間者によって変更されたようです。
zh: 看起来 Date 报头已被中间人修改。

source: It appears that this response has been cached by a reverse proxy or Content Delivery Network, because the `Age` header is present, but the `Date` header is more recent than it indicates. Generally, reverse proxies should either omit the `Age` header (if they have another means of determining how fresh the response is), or leave the `Date` header alone (i.e., act as a normal HTTP cache). See [this paper](https://www.usenix.org/legacy/events/usits01/full_papers/cohen/cohen_html/index.html) for more information.
es: Parece que esta respuesta ha sido almacenada en caché por un proxy inverso o una Red de Entrega de Contenidos, porque el encabezado `Age` está presente, pero el encabezado `Date` es más reciente de lo que indica. Por lo general, los proxies inversos deberían omitir el encabezado `Age` (si tienen otro medio para determinar cuán reciente es la respuesta) o dejar el encabezado `Date` solo (es decir, actuar como una caché HTTP normal). Consulte [este documento](https://www.usenix.org/legacy/events/usits01/full_papers/cohen/cohen_html/index.html) para obtener más información.
fr: Il semble que cette réponse ait été mise en cache par un proxy inverse ou un réseau de diffusion de contenu, car l'en-tête `Age` est présent, mais l'en-tête `Date` est plus récent que ce qu'il indique. En général, les proxies inverses devraient soit omettre l'en-tête `Age` (s'ils disposent d'un autre moyen de déterminer la fraîcheur de la réponse), soit laisser l'en-tête `Date` inchangé (c'est-à-dire se comporter comme un cache HTTP normal). Voir [cet article](https://www.usenix.org/legacy/events/usits01/full_papers/cohen/cohen_html/index.html) pour plus d'informations.
ja: このレスポンスは、`Age`ヘッダーが存在するにもかかわらず、`Date`ヘッダーがそれよりも新しい値を示しているため、リバースプロキシまたはCDNによってキャッシュされているようです。 一般的に、リバースプロキシは、レスポンスの鮮度を判断する他の手段がある場合は`Age`ヘッダーを省略するか、`Date`ヘッダーはそのままにして（つまり、通常のHTTPキャッシュとして動作する）べきです。 詳細については、[こちらの論文](https://www.usenix.org/legacy/events/usits01/full_papers/cohen/cohen_html/index.html) を参照してください。
zh: 看起来此响应已被反向代理或内容分发网络缓存， 因为存在 `Age` 标头，但 `Date` 标头比其指示的更近。 通常，反向代理应省略 `Age` 标头（如果它们有其他方法 确定响应的新鲜度），或者不更改 `Date` 标头（即，表现得像一个普通的 HTTP 缓存）。 有关更多信息，请参阅[这篇论文](https://www.usenix.org/legacy/events/usits01/full_papers/cohen/cohen_html/index.html)。

source: The resource has been deprecated.
es: El recurso ha sido deprecado.
fr: La ressource a été dépréciée.

source: The `Deprecation` header indicates that this resource was deprecated on %(date)s.
es: La cabecera `Deprecation` indica que este recurso fue depreciado el %(date)s.
fr: La `Deprecation` indique que cette ressource a été dépréciée le %(date)s.

source: The resource will be deprecated.
es: El recurso va a ser depreciado.
fr: La ressource sera dépréciée.

source: The `Deprecation` header indicates that this resource will be deprecated on %(date)s.
es: El encabezado `Deprecation` indica que este recurso será obsoleto el %(date)s.
fr: Le en-tête `Deprecation` indique que cette ressource sera dépréciée le %(date)s.

source: The resource is deprecated.
es: El recurso está en desuso.
fr: La ressource est dépréciée.

source: The `Deprecation` header indicates that this resource is deprecated.
es: La `Deprecation` header indica que este recurso está en desuso.
fr: L'en-tête « Deprecation » indique que cette ressource est dépréciée.

source: The Deprecation header has an invalid type.
es: El encabezado de desuso tiene un tipo no válido.

source: The `Deprecation` header value must be a Date or a Boolean True. Found: %(item_type)s.
es: La `Deprecation` header value must be a Date or a Boolean True. Encontrado: %(item_type)s.
fr: La valeur de l'en-tête `Deprecation` doit être une date ou un booléen True. Trouvé : %(item_type)s.

source: The `Expect` header field in a request indicates behaviors (expectations) that need to be fulfilled by the server in order to properly handle the request.
es: El campo de cabecera `Expect` en una solicitud indica comportamientos (expectativas) que deben ser cumplidos por el servidor para manejar correctamente la solicitud.
ja: リクエストの `Expect` ヘッダーフィールドは、リクエストを適切に処理するためにサーバーが満たす必要がある動作（期待）を示します。

source: The '%(expectation)s' expectation is not supported.
es: La expectativa '%(expectation)s' no es compatible.
fr: L'attente '%(expectation)s' n'est pas prise en charge.
ja: 「%(expectation)s」の期待はサポートされていません。
zh: '% (expectation)s' 期望不受支持。

source: HTTP only defines one expectation, `100-continue`. This expectation is not recognized.
es: HTTP solo define una expectativa, `100-continue`. Esta expectativa no es reconocida.
fr: HTTP ne définit qu'une seule attente, `100-continue`. Cette attente n'est pas reconnue.
ja: HTTP では `100-continue` という 1 つの期待のみが定義されています。この期待は認識されません。
zh: HTTP 仅定义了一种 Expectation，即 `100-continue`。此 Expectation 未被识别。

source: The Expect header is not supported in HTTP/1.0.
es: El encabezado Expect no es compatible con HTTP/1.0.
fr: L'en-tête Expect n'est pas pris en charge dans HTTP/1.0.
ja: HTTP/1.0 では Expect ヘッダーはサポートされていません。
zh: Expect 头在 HTTP/1.0 中不受支持。

source: The `Expect` header was added in HTTP/1.1; it has no meaning in HTTP/1.0.
es: La cabecera `Expect` se añadió en HTTP/1.1; no tiene significado en HTTP/1.0.
fr: L'en-tête `Expect` a été ajouté dans HTTP/1.1 ; il n'a aucune signification dans HTTP/1.0.
ja: `Expect` ヘッダーは HTTP/1.1 で追加されました。HTTP/1.0 では意味がありません。
zh: `Expect` 标头是在 HTTP/1.1 中添加的；它在 HTTP/1.0 中没有意义。

source: The `If-Match` header field makes the request method conditional on the recipient origin server having a current representation of the target resource.
es: El campo de encabezado `If-Match` hace que el método de solicitud sea condicional a que el servidor de origen receptor tenga una representación actual del recurso de destino.
ja: `If-Match` ヘッダーフィールドは、リクエストメソッドを、受信側のオリジンサーバーがターゲットリソースの現在の表現を持っているかどうかに条件付けします。

source: The `If-None-Match` header field makes the request method conditional on the absence of a matching entity tag, or if the field-value is "*", the absence of any current representation of the target resource.
es: El campo de encabezado `If-None-Match` hace que el método de solicitud sea condicional a la ausencia de una etiqueta de entidad coincidente, o si el valor del campo es "*", a la ausencia de cualquier representación actual del recurso de destino.
ja: `If-None-Match` ヘッダーフィールドは、一致するエンティティタグがない場合、またはフィールド値が "*" の場合に、ターゲットリソースの現在の表現がない場合にリクエストメソッドを条件付けます。
