Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: The `Alt-Svc` HTTP header field identifies an alternative service that can be arranged to access the resources identifying the origin serving the field.
es: La `Alt-Svc` es un campo de encabezado HTTP que identifica un servicio alternativo que puede ser organizado para acceder a los recursos que identifican el origen que sirve el campo.

source: The Alt-Svc 'clear' token cannot be used with other values.
es: El token 'clear' de Alt-Svc no puede usarse con otros valores.
fr: Le jeton 'clear' d'Alt-Svc ne peut pas être utilisé avec d'autres valeurs.

source: The `Alt-Svc` header field value "clear" is used to invalidate previous alternative services. It cannot be combined with other alternative service advertisements.
es: El valor del campo de encabezado `Alt-Svc` "clear" se utiliza para invalidar los servicios alternativos anteriores. No se puede combinar con otras publicidades de servicios alternativos.
fr: La valeur du champ d'en-tête `Alt-Svc` "clear" est utilisée pour invalider les services alternatifs précédents. Il ne peut pas être combiné avec d'autres annonces de services alternatifs.

source: The `Authentication-Info` header field is used to communicate information after the client's authentication credentials have been accepted.
es: El campo de encabezado `Authentication-Info` se utiliza para comunicar información después de que las credenciales de autenticación del cliente hayan sido aceptadas.
ja: `Authentication-Info` ヘッダーフィールドは、クライアントの認証情報が受け入れられた後に情報を伝達するために使用されます。

source: This request advertises a dictionary for compression, but the client doesn't support it.
es: Este pedido anuncia un diccionario para la compresión, pero el cliente no lo admite.
fr: Cette requête annonce une compression de dictionnaire, mais le client ne la prend pas en charge.

source: The `Available-Dictionary` header is present, but `Accept-Encoding` does not contain 'dcb' or 'dcz'. [RFC 9842 Section 6.1](https://www.rfc-editor.org/rfc/rfc9842.html#section-6.1) requires that if a client sends `Available-Dictionary`, it MUST also advertise support for dictionary-based content encoding (dcb or dcz) in `Accept-Encoding`.
es: La cabecera 'Available-Dictionary' está presente, pero 'Accept-Encoding' no contiene 'dcb' ni 'dcz'. [Sección 6.1 del RFC 9842](https://www.rfc-editor.org/rfc/rfc9842.html#section-6.1) establece que si un cliente envía la cabecera 'Available-Dictionary', debe anunciar su apoyo a la codificación de contenido basada en diccionario (dcb o dcz) en 'Accept-Encoding'.
fr: L'en-tête `Available-Dictionary` est présent, mais `Accept-Encoding` ne contient ni 'dcb' ni 'dcz'. [Section 6.1 de RFC 9842](https://www.rfc-editor.org/rfc/rfc9842.html#section-6.1) exige que si un client envoie `Available-Dictionary`, il doit également annoncer son support pour la compression de contenu basée sur un dictionnaire (dcb ou dcz) dans `Accept-Encoding`.

source: The Available-Dictionary header has an invalid type.
es: El encabezado Available-Dictionary tiene un tipo no válido.
fr: L'en-tête « Available-Dictionary » a un type invalide.

source: The `Available-Dictionary` header value must be a Byte Sequence. Found `%(got)s`.
es: El valor de la cabecera `Available-Dictionary` debe ser una Secuencia de Bytes. Se encontró `%(got)s`.
fr: La valeur de l'en-tête `Available-Dictionary` doit être une séquence de bytes. Trouvé `%(got)s`.

source: The `Cache-Control` header is used to specify required directives to all caches that handle the response. It can also occur in requests, but caches have the option of ignoring it there.
es: La cabecera `Cache-Control` se utiliza para especificar directivas obligatorias para todas las cachés que manejan la respuesta. También puede aparecer en las solicitudes, pero las cachés tienen la opción de ignorarla allí.
ja: `Cache-Control` ヘッダーは、レスポンスを処理するすべてのキャッシュに必須のディレクティブを指定するために使用されます。リクエストにも含めることができますが、キャッシュはそれを無視するオプションがあります。

source: The %(directive)s cache directive does not accept a value.
es: La directiva %(directive)s de caché no acepta ningún valor.
fr: La directive %(directive)s de cache ne prend pas de valeur.

source: The `%(directive)s` cache directive is a flag; it shouldn't have a value.
es: La directiva `%(directive)s` de caché es una bandera; no debería tener ningún valor.
fr: La directive `%(directive)s` cache est un indicateur ; elle ne devrait pas avoir de valeur.

source: The %(directive)s cache directive's value is incorrect.
es: El valor de la directiva %(directive)s de caché es incorrecto.
fr: La valeur de la directive %(directive)s de mise en cache est incorrecte.

source: The `%(directive)s` cache directive type is %(expected_type)s, but `%(value)s` was found.
es: El tipo de directiva de caché '%(directive)s' es %(expected_type)s, pero se encontró '%(value)s'.
fr: Le type de directive de cache `%(directive)s` est %(expected_type)s, mais `%(value)s` a été trouvé.

source: The %(directive)s cache directive is very large.
es: La directiva de caché %(directive)s es muy grande.
fr: La directive de cache %(directive)s est très volumineuse.
ja: %(directive)s キャッシュディレクティブは非常に大きいです。
zh: %(directive)s 缓存指令非常大。

source: The `%(directive)s` cache directive's value is greater than 2^31-1. Some implementations may not be able to handle values this large.
es: El valor de la directiva de caché `%(directive)s` es mayor que 2^31-1. Algunas implementaciones podrían no ser capaces de manejar valores tan grandes.
fr: La valeur de la directive de cache `%(directive)s` est supérieure à 2^31-1. Certaines implémentations pourraient ne pas être en mesure de gérer des valeurs aussi grandes.
ja: `%(directive)s` キャッシュディレクティブの値が 2^31-1 を超えています。一部の実装では、この値が大きすぎると処理できない場合があります。
zh: `%(directive)s` 缓存指令的值大于 2^31-1。某些实现可能无法处理如此大的值。

source: The %(directive)s cache directive has non-lowercase characters.
es: La directiva de caché %(directive)s tiene caracteres que no son en minúsculas.
fr: La directive de cache %(directive)s contient des caractères qui ne sont pas en minuscules.
ja: キャッシュディレクティブ「%(directive)s」に小文字以外の文字が含まれています。
zh: 缓存指令 “%(directive)s” 包含非小写字符。

source: cache directive names are case-insensitive, but some implementations don't recognize directives that aren't all-lowercase. Therefore, it's safest to use `%(directive_lower)s` instead of `%(directive)s`.
es: los nombres de las directivas de caché no distinguen entre mayúsculas y minúsculas, pero algunas implementaciones no reconocen las directivas que no están en minúsculas. Por lo tanto, es más seguro usar `%(directive_lower)s` en lugar de `%(directive)s`.
fr: les noms de directives de cache ne tiennent pas compte de la casse, mais certaines implémentations ne reconnaissent pas les directives qui ne sont pas toutes en minuscules. Par conséquent, il est plus sûr d'utiliser `%(directive_lower)s` au lieu de `%(directive)s`.
ja: キャッシュディレクティブ名はケースインセンシティブですが、一部の実装では すべて小文字でないディレクティブを認識しません。 そのため、`%(directive)s` の代わりに `%(directive_lower)s` を使用するのが安全です。
zh: 缓存指令名称不区分大小写，但某些实现不识别非全小写的指令。 因此，使用 `%(directive_lower)s` 而不是 `%(directive)s` 更安全。

source: The %(directive)s cache directive appears more than once.
es: La directiva de caché %(directive)s aparece más de una vez.
fr: La directive de cache %(directive)s apparaît plus d'une fois.
ja: %(directive)s キャッシュディレクティブが複数回出現しています。
zh: 缓存指令 “%(directive)s” 出现多次。

source: The `%(directive)s` cache directive is only defined to appear once; it is used more than once here, so implementations may use different instances (e.g., the first, or the last), making their behaviour unpredictable.
es: La directiva de caché `%(directive)s` solo está definida para aparecer una vez; se usa más de una vez aquí, por lo que las implementaciones pueden usar instancias diferentes (por ejemplo, la primera o la última), lo que hace que su comportamiento sea impredecible.
fr: La directive de cache `%(directive)s` n'est définie que pour apparaître une seule fois ; elle est utilisée plus d'une fois ici, donc les implémentations peuvent utiliser différentes instances (par exemple, la première ou la dernière), rendant leur comportement imprévisible.
ja: `%(directive)s` キャッシュディレクティブは一度だけ定義されており、ここで複数回使用されているため、実装によって異なるインスタンス (例: 最初または最後) が使用される可能性があり、その動作は予測不能になります。
zh: `%(directive)s` 缓存指令只允许出现一次；它在这里出现了多次，因此实现可能会使用不同的实例（例如，第一个或最后一个），从而使其行为不可预测。

source: The %(directive)s cache directive overrides other directives.
es: La directiva de caché %(directive)s anula otras directivas.
fr: La directive de cache %(directive)s remplace d'autres directives.
ja: %(directive)s キャッシュディレクティブは他のディレクティブを上書きします。
zh: %(directive)s 缓存指令会覆盖其他指令。

source: The `%(directive)s` cache directive overrides or conflicts with these other directives: %(conflicts)s The conflicting directives will be ignored by caches, and can be safely omitted.
es: La directiva de caché `%(directive)s` anula o entra en conflicto con estas otras directivas: %(conflicts)s Las directivas en conflicto serán ignoradas por las cachés y se pueden omitir sin peligro.
fr: La directive de cache `%(directive)s` remplace ou est en conflit avec ces autres directives : %(conflicts)s Les directives conflictuelles seront ignorées par les caches et peuvent être omises sans danger.
ja: `%(directive)s` キャッシュディレクティブは、これらの他のディレクティブを上書きまたは競合しています。 %(conflicts)s 競合するディレクティブはキャッシュによって無視され、安全に省略できます。
zh: 缓存指令 `%(directive)s` 会覆盖或与以下其他指令冲突： %(conflicts)s 冲突的指令将被缓存忽略，并且可以安全地省略。

source: The %(directive)s cache directive has no meaning in a %(message_type)s.
es: La directiva de caché %(directive)s no tiene significado en un %(message_type)s.
fr: La directive de cache %(directive)s n'a aucune signification dans un %(message_type)s.
ja: %(directive)s キャッシュディレクティブは %(message_type)s では意味がありません。
zh: %(directive)s 缓存指令在 %(message_type)s 中没有意义。

source: The `%(directive)s` cache directive is only defined to appear in %(other_message)s messages; is has no defined meaning in a %(message_type)s.
es: La directiva de caché `%(directive)s` solo está definida para aparecer en mensajes %(other_message)s; no tiene un significado definido en un %(message_type)s.
fr: La directive de cache `%(directive)s` est uniquement définie pour apparaître dans les messages %(other_message)s ; elle n'a pas de signification définie dans un %(message_type)s.
ja: `%(directive)s` キャッシュディレクティブは、%(other_message)s メッセージでのみ定義されており、%(message_type)s では定義された意味がありません。
zh: 缓存指令 `%(directive)s` 只被定义用于 %(other_message)s 消息中；它在 %(message_type)s 消息中没有定义含义。

source: Only one of the pre-check and post-check cache directives is present.
es: Solo una de las directivas de caché pre-check y post-check está presente.
fr: Une seule des directives de cache pre-check et post-check est présente.
ja: プリチェックとポストチェックのキャッシュディレクティブのいずれか1つのみが存在します。
zh: 仅存在预检查和后检查缓存指令中的一个。

source: Microsoft Internet Explorer implements two `Cache-Control` extensions, `pre-check` and `post-check`, to give more control over how its cache stores responses. This response uses only one of these directives; as a result, Internet Explorer will ignore the directive, since it requires both to be present.
es: Microsoft Internet Explorer implementa dos extensiones de `Cache-Control`, `pre-check` y `post-check`, para dar más control sobre cómo su caché almacena las respuestas. Esta respuesta utiliza solo una de estas directivas; como resultado, Internet Explorer ignorará la directiva, ya que requiere que ambas estén presentes.
fr: Microsoft Internet Explorer implémente deux extensions `Cache-Control`, `pre-check` et `post-check`, pour donner plus de contrôle sur la manière dont son cache stocke les réponses. Cette réponse utilise seulement une de ces directives ; en conséquence, Internet Explorer ignorera la directive, car il requiert que les deux soient présentes.
ja: Microsoft Internet Explorer は、キャッシュが応答をどのように保存するかをより細かく制御するために、`pre-check` および `post-check` という 2 つの `Cache-Control` 拡張機能を実装しています。 この応答では、これらのディレクティブのうち 1 つのみが使用されています。その結果、Internet Explorer はディレクティブを無視します。なぜなら、両方が存在する必要があるためです。
zh: Microsoft Internet Explorer 实现了两个 `Cache-Control` 扩展，“`pre-check`”和“`post-check`”，以更精细地控制其缓存存储响应的方式。 此响应仅使用了这些指令中的一个；因此，Internet Explorer 将忽略该指令，因为它要求同时存在这两个指令。

source: The pre-check and post-check cache directives are both '0'.
es: Las directivas de caché pre-comprobación y post-comprobación son ambas '0'.
fr: Les directives de cache pre-check et post-check sont toutes deux à '0'.
ja: プリチェックおよびポストチェックのキャッシュディレクティブは両方とも '0' です。
zh: 预检查和后检查缓存指令均为 '0'。

source: Microsoft Internet Explorer implements two `Cache-Control` extensions, `pre-check` and `post-check`, to give more control over how its cache stores responses. This response gives a value of "0" for both; as a result, Internet Explorer will ignore the directive, since it requires both to be present. In other words, setting these to zero has **no effect** (besides wasting bandwidth), and may trigger bugs in some beta versions of IE.
es: Microsoft Internet Explorer implementa dos extensiones de `Cache-Control`, `pre-check` y `post-check`, para tener un mayor control sobre cómo su caché almacena las respuestas. Esta respuesta proporciona un valor de "0" para ambas; como resultado, Internet Explorer ignorará la directiva, ya que requiere que ambas estén presentes. En otras palabras, establecer estos valores a cero **no tiene ningún efecto** (además de desperdiciar ancho de banda), y puede desencadenar errores en algunas versiones beta de IE.
fr: Microsoft Internet Explorer implémente deux extensions `Cache-Control`, `pre-check` et `post-check`, pour un meilleur contrôle de la façon dont son cache stocke les réponses. Cette réponse donne la valeur "0" pour les deux ; en conséquence, Internet Explorer ignorera la directive, car elle nécessite que les deux soient présentes. En d'autres termes, régler ces valeurs à zéro n'a **aucun effet** (à part gaspiller de la bande passante) et peut déclencher des bugs dans certaines versions bêta d'IE.
ja: Microsoft Internet Explorer は、キャッシュが応答をどのように格納するかをより細かく制御するために、`pre-check` および `post-check` という 2 つの `Cache-Control` 拡張機能を実装しています。 この応答では、両方に "0" という値が与えられます。その結果、Internet Explorer は両方が存在することを要求しているため、ディレクティブを無視します。 つまり、これらをゼロに設定しても**効果はありません**（帯域幅の無駄遣い以外）、一部の IE ベータ版ではバグを引き起こす可能性があります。
zh: Microsoft Internet Explorer 实现了两个 `Cache-Control` 扩展：`pre-check` 和 `post-check`，以更精细地控制其缓存如何存储响应。 此响应为两者都提供了“0”的值；因此，Internet Explorer 将忽略该指令，因为它要求两者都存在。 换句话说，将这些设置为零**没有效果**（除了浪费带宽），并且可能会在某些 IE beta 版本中触发 bug。

source: The post-check cache directive's value is larger than pre-check's.
es: El valor de la directiva de caché post-comprobación es mayor que el de pre-comprobación.
fr: La valeur de la directive de cache post-check est supérieure à celle de pre-check.
ja: チェック後のキャッシュディレクティブの値がチェック前の値よりも大きいです。
zh: post-check 缓存指令的值大于 pre-check 的。

source: Microsoft Internet Explorer implements two `Cache-Control` extensions, `pre-check` and `post-check`, to give more control over how its cache stores responses. This response assigns a higher value to `post-check` than to `pre-check`; this means that Internet Explorer will treat `post-check` as if its value is the same as `pre-check`'s.
es: Microsoft Internet Explorer implementa dos extensiones de `Cache-Control`, `pre-check` y `post-check`, para dar más control sobre cómo su caché almacena las respuestas. Esta respuesta asigna un valor más alto a `post-check` que a `pre-check`; esto significa que Internet Explorer tratará `post-check` como si su valor fuera el mismo que el de `pre-check`.
fr: Microsoft Internet Explorer implémente deux extensions `Cache-Control`, `pre-check` et `post-check`, pour permettre un meilleur contrôle de la manière dont son cache stocke les réponses. Cette réponse attribue une valeur plus élevée à `post-check` qu'à `pre-check` ; cela signifie qu'Internet Explorer traitera `post-check` comme si sa valeur était identique à celle de `pre-check`.
ja: Microsoft Internet Explorer は、キャッシュが応答をどのように格納するかについて、より詳細な制御を提供するために、2 つの `Cache-Control` 拡張機能、`pre-check` と `post-check` を実装しています。 この応答では、`post-check` の値が `pre-check` よりも高く割り当てられています。これは、Internet Explorer が `post-check` を、その値が `pre-check` の値と同じであるかのように扱うことを意味します。
zh: Microsoft Internet Explorer 实现两个 `Cache-Control` 扩展，`pre-check` 和 `post-check`，以更好地控制其缓存如何存储响应。 此响应为 `post-check` 分配的值高于 `pre-check`；这意味着 Internet Explorer 将 `post-check` 的处理方式视为与其值相同。

source: The post-check cache directive's value is '0'.
es: El valor de la directiva de caché post-check es '0'.
fr: La valeur de la directive de cache post-check est '0'.
ja: post-check キャッシュディレクティブの値は「0」です。
zh: post-check 缓存指令的值为 '0'。

source: Microsoft Internet Explorer implements two `Cache-Control` extensions, `pre-check` and `post-check`, to give more control over how its cache stores responses. This response assigns a value of "0" to `post-check`, which means that Internet Explorer will reload the content as soon as it enters the browser cache, effectively **doubling the load on the server**.
es: Microsoft Internet Explorer implementa dos extensiones de `Cache-Control`, `pre-check` y `post-check`, para dar más control sobre cómo su caché almacena las respuestas. Esta respuesta asigna un valor de "0" a `post-check`, lo que significa que Internet Explorer recargará el contenido tan pronto como entre en la caché del navegador, **duplicando efectivamente la carga en el servidor**.
fr: Microsoft Internet Explorer implémente deux extensions `Cache-Control`, `pre-check` et `post-check`, pour un meilleur contrôle de la façon dont son cache stocke les réponses. Cette réponse attribue la valeur "0" à `post-check`, ce qui signifie qu'Internet Explorer rechargera le contenu dès qu'il entrera dans le cache du navigateur, **doublant ainsi la charge sur le serveur**.
ja: Microsoft Internet Explorer は、キャッシュが応答をどのように保存するかをより細かく制御するために、`pre-check` と `post-check` という 2 つの `Cache-Control` 拡張機能を実装しています。 この応答では `post-check` に "0" という値を割り当てています。これは、Internet Explorer がコンテンツをブラウザキャッシュに入力するとすぐに再読み込みすることを意味し、事実上 **サーバーへの負荷を倍増させます**。
zh: Microsoft Internet Explorer 实现了两个 `Cache-Control` 扩展，`pre-check` 和 `post-check`，以提供对浏览器缓存存储响应的更多控制。 此响应为 `post-check` 分配了值 "0"，这意味着 Internet Explorer 一旦将内容加载到浏览器缓存中，就会立即重新加载内容，从而**加倍服务器的负载**。

source: This response may be refreshed in the background by Internet Explorer.
es: Es posible que Internet Explorer actualice esta respuesta en segundo plano.
fr: Cette réponse peut être rafraîchie en arrière-plan par Internet Explorer.
ja: このレスポンスは、Internet Explorer によってバックグラウンドでリフレッシュされる可能性があります。
zh: 此响应可能会由 Internet Explorer 在后台刷新。

source: Microsoft Internet Explorer implements two `Cache-Control` extensions, `pre-check` and `post-check`, to give more control over how its cache stores responses. Once it has been cached for more than %(post_check)s seconds, a new request will result in the cached response being served while it is refreshed in the background. However, if it has been cached for more than %(pre_check)s seconds, the browser will download a fresh response before showing it to the user. Note that these directives do not have any effect on other clients or caches.
es: Microsoft Internet Explorer implementa dos extensiones de `Cache-Control`, `pre-check` y `post-check`, para dar más control sobre cómo su caché almacena respuestas. Una vez que se ha almacenado en caché durante más de %(post_check)s segundos, una nueva solicitud resultará en que la respuesta en caché se sirva mientras se actualiza en segundo plano. Sin embargo, si se ha almacenado en caché durante más de %(pre_check)s segundos, el navegador descargará una respuesta nueva antes de mostrarla al usuario. Tenga en cuenta que estas directivas no tienen ningún efecto en otros clientes o cachés.
fr: Microsoft Internet Explorer implémente deux extensions `Cache-Control`, `pre-check` et `post-check`, pour un meilleur contrôle de la mise en cache des réponses. Une fois mis en cache pendant plus de %(post_check)s secondes, une nouvelle requête entraînera la diffusion de la réponse mise en cache pendant qu'elle est actualisée en arrière-plan. Cependant, si elle a été mise en cache pendant plus de %(pre_check)s secondes, le navigateur téléchargera une nouvelle réponse avant de l'afficher à l'utilisateur. Notez que ces directives n'ont aucun effet sur les autres clients ou caches.
ja: Microsoft Internet Explorer は、キャッシュが応答をどのように格納するかについて、より詳細な制御を行うための 2 つの `Cache-Control` 拡張機能、`pre-check` および `post-check` を実装しています。 %(post_check)s 秒を超えてキャッシュされた後、新しいリクエストがあった場合、バックグラウンドでキャッシュが更新されている間、キャッシュされた応答が提供されます。ただし、%(pre_check)s 秒を超えてキャッシュされた場合、ブラウザはユーザーに表示する前に新しい応答をダウンロードします。 これらのディレクティブは、他のクライアントやキャッシュには影響しないことに注意してください。
zh: Microsoft Internet Explorer 实现了两个 `Cache-Control` 扩展，`pre-check` 和 `post-check`，以提供更精细地控制其缓存如何存储响应。 一旦缓存超过 %(post_check)s 秒，新的请求将提供缓存的响应，同时在后台刷新。但是，如果缓存超过 %(pre_check)s 秒，浏览器将在向用户显示之前下载一个全新的响应。 请注意，这些指令对其他客户端或缓存没有任何影响。

source: Cache groups need to be strings.
es: Los grupos de caché necesitan ser cadenas.
fr: Les groupes de cache doivent être des chaînes.

source: The `%(field_name)s` header values must be Strings. Found `%(got)s`.
es: Los valores del encabezado `%(field_name)s` deben ser cadenas. Se encontró `%(got)s`.
fr: Les valeurs du `%(field_name)s` doivent être des chaînes. Trouvé `%(got)s`.

source: The Cache-Group-Invalidation header is ignored for %(method)s requests.
es: La cabecera 'Cache-Group-Invalidation' es ignorada para %(method)s solicitudes.
fr: La tête de cache-invalidation du groupe est ignorée pour les %(method)s.

source: The `Cache-Group-Invalidation` header is only processed for unsafe methods (like POST, PUT, DELETE). It will be ignored for `%(method)s` requests.
es: La cabecera `Cache-Group-Invalidation` solo es procesada para métodos inseguros (como POST, PUT, DELETE). Será ignorada para `%(method)s` solicitudes.
fr: La `Cache-Group-Invalidation` est traitée uniquement pour les méthodes dangereuses (comme POST, PUT, DELETE). Elle sera ignorée pour les `%(method)s` requêtes.

source: Detailed information about caching is available.
es: Hay información detallada sobre el almacenamiento en caché disponible.
fr: Des informations détaillées sur la mise en cache sont disponibles.
ja: キャッシングに関する詳細情報が利用可能です。
zh: 有关缓存的详细信息可供使用。

source: The `Cache-Status` header field indicates how caches have handled the response. %(status)s
es: El campo de encabezado `Cache-Status` indica cómo han gestionado las cachés la respuesta. %(status)s
fr: Le champ d'en-tête `Cache-Status` indique comment les caches ont géré la réponse. %(status)s
ja: `Cache-Status` ヘッダーフィールドは、キャッシュがレスポンスをどのように処理したかを示します。 %(status)s
zh: `Cache-Status` 标头字段指示缓存如何处理了响应。 %(status)s

source: The Cache-Status header has an invalid structure.
es: La cabecera Cache-Status tiene una estructura inválida.
fr: L'en-tête Cache-Status a une structure non valide.
ja: Cache-Status ヘッダーの構造が無効です。
zh: Cache-Status 标头结构无效。

source: The `Cache-Status` header must be a list of members, where each member is a Token or String (identifying the cache) with optional parameters.
es: La cabecera `Cache-Status` debe ser una lista de miembros, donde cada miembro es un Token o String (identificando la caché) con parámetros opcionales.
fr: L'en-tête `Cache-Status` doit être une liste de membres, où chaque membre est un Token ou une chaîne de caractères (identifiant le cache) avec des paramètres optionnels.
ja: `Cache-Status` ヘッダーは、メンバーのリストである必要があります。各メンバーは、オプションのパラメータを持つトークンまたは文字列（キャッシュを識別する）です。
zh: `Cache-Status` 标头必须是成员列表，其中每个成员是字符串（标识缓存）或令牌，并带有可选参数。

source: The Cache-Status header has an unknown parameter '%(param)s'.
es: La cabecera Cache-Status tiene un parámetro desconocido '%(param)s'.
fr: Cette réponse a un en-tête Cache-Status avec un paramètre inconnu "%(param)s".
ja: Cache-Status ヘッダーに不明なパラメータ '%(param)s' があります。
zh: Cache-Status 标头具有未知参数“%(param)s”。
