Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: The max-age directive in the HSTS header is invalid.
es: La directiva max-age en la cabecera HSTS no es válida.
fr: La directive max-age dans l'en-tête HSTS n'est pas valide.
ja: HSTS ヘッダーの max-age ディレクティブが無効です。
zh: HSTS 标头中的 max-age 指令无效。

source: The `max-age` directive in the `Strict-Transport-Security` header must be a non-negative integer. The value "%(max_age)s" is not valid.
es: La directiva `max-age` en la cabecera `Strict-Transport-Security` debe ser un entero no negativo. El valor "%(max_age)s" no es válido.
fr: La directive `max-age` dans l'en-tête `Strict-Transport-Security` doit être un entier non négatif. La valeur "%(max_age)s" n'est pas valide.
ja: `Strict-Transport-Security` ヘッダーの `max-age` ディレクティブは、非負の整数でなければなりません。値 "%(max_age)s" は無効です。
zh: `Strict-Transport-Security` 标头中的 `max-age` 指令必须是一个非负整数。值 "%(max_age)s" 无效。

source: The %(directive)s directive in the HSTS header must not have a value.
es: La directiva %(directive)s en la cabecera HSTS no debe tener valor.
fr: La directive %(directive)s dans l'en-tête HSTS ne doit pas avoir de valeur.
ja: HSTS ヘッダーの %(directive)s ディレクティブには値があってはなりません。
zh: HSTS 标头中的 %(directive)s 指令不得具有值。

source: The `%(directive)s` directive in the `Strict-Transport-Security` header is a valueless directive. It should not have an associated value.
es: La directiva `%(directive)s` en la cabecera `Strict-Transport-Security` es una directiva sin valor. No debería tener un valor asociado.
fr: La directive `%(directive)s` dans l'en-tête `Strict-Transport-Security` est une directive sans valeur. Elle ne devrait pas avoir de valeur associée.
ja: `Strict-Transport-Security` ヘッダーの `%(directive)s` ディレクティブは値を持たないディレクティブです。関連する値を持つべきではありません。
zh: `Strict-Transport-Security` 标头中的 `%(directive)s` 指令是一个无值的指令。它不应有相关的值。

source: The resource has Sunset.
es: El recurso tiene Sunset.
fr: Le ressource a une date de fin.

source: The `Sunset` header indicates that this resource has already passed its sunset date and may become unresponsive.
es: La cabecera `Sunset` indica que este recurso ya ha pasado su fecha de ocaso y puede volverse inaccesible.
fr: La requête a expiré.

source: The `TCN` response header is part of an experimental transparent content negotiation scheme. It is not widely supported in clients.
es: El encabezado de respuesta `TCN` forma parte de un esquema experimental de negociación de contenido transparente. No es ampliamente compatible con los clientes.
ja: `TCN` レスポンスヘッダーは、実験的な透過コンテンツネゴシエーションスキームの一部です。 クライアントでの広範なサポートはありません。

source: The `TE` request header indicates what HTTP/1.1 transfer-codings the client is willing to accept in the response. Additionally, if it contains the special value `trailers` it indicates that the sender is willing to accept trailer fields after the content. The most common transfer-coding, `chunked`, doesn't need to be listed in `TE`. `TE` can only be used with the value `trailers` in HTTP/2 and HTTP/3.
es: La cabecera de solicitud `TE` indica qué transfer-codings de HTTP/1.1 el cliente está dispuesto a aceptar en la respuesta. Adicionalmente, si contiene el valor especial `trailers` indica que el remitente está dispuesto a aceptar campos de tráiler después del contenido. El transfer-coding más común, `chunked`, no necesita ser listado en `TE`. `TE` solo puede ser usado con el valor `trailers` en HTTP/2 y HTTP/3.
ja: `TE` リクエストヘッダーは、クライアントがレスポンスで受け入れ可能な HTTP/1.1 トランスファーコーディングを示します。さらに、特別な値 `trailers` が含まれている場合、送信者がコンテンツの後にトレーラーフィールドを受け入れ可能であることを示します。 最も一般的なトランスファーコーディングである `chunked` は、`TE` にリストする必要はありません。 `TE` は、HTTP/2 および HTTP/3 では `trailers` の値でのみ使用できます。

source: The `Trailer` header indicates that the given set of headers will be present in the trailer of the message, after the content.
es: La cabecera `Trailer` indica que el conjunto de cabeceras dado estará presente en el tráiler del mensaje, después del contenido.
ja: `Trailer` ヘッダーは、指定されたヘッダーセットがメッセージのコンテンツの後、トレーラーに存在することを示します。

source: The `Transfer-Encoding` header indicates what (if any) type of transformation has been applied to the message content. This differs from `Content-Encoding` in that transfer codings are a property of the message, not of the representation; i.e., it will be removed by the next "hop", whereas content codings are end-to-end. The most commonly used transfer coding is `chunked`, which allows HTTP/1.1 persistent connections to be used without knowing the content's length. Transfer codings can only be used in HTTP/1; HTTP/2 and HTTP/3 do not support them.
es: La cabecera `Transfer-Encoding` indica qué tipo de transformación (si la hay) se ha aplicado al contenido del mensaje. Esto difiere de `Content-Encoding` en que las codificaciones de transferencia son una propiedad del mensaje, no de la representación; es decir, serán eliminadas por el siguiente "salto", mientras que las codificaciones de contenido son de extremo a extremo. La codificación de transferencia más utilizada es `chunked`, que permite utilizar conexiones persistentes HTTP/1.1 sin conocer la longitud del contenido. Las codificaciones de transferencia solo se pueden utilizar en HTTP/1; HTTP/2 y HTTP/3 no las admiten.
ja: `Transfer-Encoding` ヘッダーは、メッセージコンテンツにどのような変換が適用されたか（または適用されていないか）を示します。 これは `Content-Encoding` とは異なり、転送コーディングはメッセージのプロパティであり、表現のプロパティではないためです。つまり、次の「ホップ」によって削除されますが、コンテンツコーディングはエンドツーエンドです。 最も一般的に使用される転送コーディングは `chunked` であり、これによりHTTP/1.1永続接続をコンテンツの長さを知らずに使用できます。 転送コーディングはHTTP/1でのみ使用できます。HTTP/2およびHTTP/3はサポートしていません。

source: The identity transfer-coding isn't necessary.
es: La codificación de transferencia de identidad no es necesaria.
fr: Le codage de transfert d'identité n'est pas nécessaire.
ja: ID転送コーディングは不要です。
zh: 身份传输编码不是必需的。

source: HTTP defines _transfer-codings_ as a hop-by-hop encoding of the message's content. The `identity` transfer-coding was defined as the absence of encoding; it doesn't do anything, so it is unnecessary. You can remove this token to save a few bytes.
es: HTTP define _transfer-codings_ como una codificación hop-by-hop del contenido del mensaje. La _transfer-coding_ `identity` se definió como la ausencia de codificación; no hace nada, por lo que es innecesaria. Puede eliminar este token para ahorrar unos pocos bytes.
fr: HTTP définit les _transfer-codings_ comme un encodage hop-à-hop du contenu du message. Le transfert-codage `identity` a été défini comme l'absence d'encodage ; il ne fait rien, il est donc inutile. Vous pouvez supprimer ce jeton pour économiser quelques octets.
ja: HTTPでは、メッセージのコンテンツをホップバイホップでエンコードするものを _transfer-codings_ と定義しています。「identity」 transfer-coding は、エンコードがないことを示すものとして定義されました。何も行わないため、不要です。 このトークンを削除すると、数バイト節約できます。
zh: HTTP 将 _transfer-codings_ 定义为消息内容的逐跳编码。`identity` 传输编码被定义为不编码；它不做任何事，所以是不必要的。 您可以删除此令牌以节省几个字节。

source: This response uses the '%(coding)s' transfer-coding, but it wasn't requested.
es: Este respuesta utiliza el '%(coding)s' transfer-coding, pero no se solicitó.
fr: Cette réponse utilise le transfert-codage « %(coding)s », mais n'a pas été demandé.

source: This response's `Transfer-Encoding` header indicates it has the `%(coding)s` transfer-coding applied, but the client didn't indicate support for it in the request. Normally, clients ask for the encodings they want in the `TE` request header. Using codings that the client doesn't explicitly request can lead to interoperability problems.
es: Esta respuesta indica en el encabezado 'Transfer-Encoding' que se ha aplicado el codificación '%(coding)s', pero el cliente no la ha solicitado en la solicitud. Normalmente, los clientes piden las codificaciones que desean en el encabezado de solicitud 'TE'. El uso de codificaciones que el cliente no ha solicitado explícitamente puede provocar problemas de interoperabilidad.
fr: Cette réponse indique dans son en-tête `Transfer-Encoding` qu'elle utilise le `%(coding)s` de transfert, mais le client n'a pas indiqué son support dans la requête. En général, les clients demandent les codages qu'ils souhaitent dans l'en-tête `TE` de la requête. L'utilisation de codages que le client n'a pas explicitement demandés peut entraîner des problèmes d'interopérabilité.

source: This message had parameters on its transfer-codings.
es: Este mensaje tenía parámetros en sus transfer-codings.
fr: Ce message avait des paramètres sur ses transfer-codings.
ja: このメッセージは transfer-codings にパラメータがありました。
zh: 此消息的 transfer-codings 带有参数。

source: HTTP allows transfer-codings in the `Transfer-Encoding` header to have optional parameters, but it doesn't define what they mean. This message has encodings with such parameters; although they're technically allowed, they may cause interoperability problems. They should be removed.
es: HTTP permite a las `transfer-codings` en la cabecera `Transfer-Encoding` tener parámetros opcionales, pero no define su significado. Este mensaje tiene codificaciones con tales parámetros; aunque técnicamente están permitidos, pueden causar problemas de interoperabilidad. Deberían eliminarse.
fr: HTTP permet aux codages de transfert dans l'en-tête `Transfer-Encoding` d'avoir des paramètres optionnels, mais il ne définit pas leur signification. Ce message contient des codages avec de tels paramètres ; bien qu'ils soient techniquement autorisés, ils peuvent causer des problèmes d'interopérabilité. Ils devraient être supprimés.
ja: HTTP では `Transfer-Encoding` ヘッダーの transfer-codings にオプションのパラメータを含めることができますが、その意味は定義されていません。 このメッセージには、そのようなパラメータを持つエンコーディングが含まれています。技術的には許可されていますが、相互運用の問題を引き起こす可能性があります。削除する必要があります。
zh: HTTP 允许 `Transfer-Encoding` 标头中的传输编码具有可选参数，但它没有定义这些参数的含义。 此消息包含带有此类参数的编码；尽管它们在技术上是允许的，但可能会导致互操作性问题。应将其删除。

source: The `Upgrade` header allows the client to specify what additional communication protocols it supports and would like to use if the server finds it appropriate to switch protocols. Servers use it to confirm upgrade to a specific protocol. `Upgrade` cannot be used in HTTP/2 or HTTP/3.
es: La cabecera `Upgrade` permite al cliente especificar qué protocolos de comunicación adicionales admite y le gustaría utilizar si el servidor considera apropiado cambiar de protocolo. Los servidores la utilizan para confirmar la actualización a un protocolo específico. `Upgrade` no se puede utilizar en HTTP/2 o HTTP/3.
ja: `Upgrade` ヘッダーを使用すると、クライアントはサポートしており、サーバーがプロトコルの切り替えを適切と判断した場合に使用したい追加の通信プロトコルを指定できます。サーバーは、特定のプロトコルへのアップグレードを確認するためにこれを使用します。 `Upgrade` は HTTP/2 または HTTP/3 では使用できません。

source: The %(field_name)s parameter '%(param)s' has an invalid type.
es: El parámetro %(field_name)s '%(param)s' tiene un tipo no válido.
fr: Le paramètre « %(field_name)s » avec la valeur « %(param)s » a un type non valide.

source: The `%(field_name)s` parameter `%(param)s` must be a `%(expected)s`. Found `%(got)s`.
es: El parámetro `'%(field_name)s'` `'%(param)s'` debe ser de `'%(expected)s'. Se encontró `'%(got)s'`.
fr: Le `%(field_name)s` paramètre `%(param)s` doit être un `%(expected)s`. Trouvé `%(got)s`.

source: The match-dest parameter has an invalid type.
es: El parámetro match-dest tiene un tipo no válido.
fr: Le paramètre match-dest a un type invalide.

source: The `match-dest` parameter must be a String or a list of Strings.
es: El parámetro `match-dest` debe ser una cadena o una lista de cadenas.
fr: Le paramètre `match-dest` doit être une chaîne ou une liste de chaînes.

source: The `Vary` response header indicates the set of request headers that determines whether a cache is permitted to use the response to reply to a subsequent request without validation. In uncacheable or stale responses, the Vary field value advises the user agent about the criteria that were used to select the representation.
es: La cabecera de respuesta `Vary` indica el conjunto de cabeceras de solicitud que determina si una caché tiene permiso para usar la respuesta para responder a una solicitud posterior sin validación. En respuestas no cacheadas o obsoletas, el valor del campo Vary informa al agente de usuario sobre los criterios que se utilizaron para seleccionar la representación.
ja: `Vary` レスポンスヘッダーは、キャッシュが後続のリクエストに対して検証なしでレスポンスを使用することを許可されるかどうかを決定するリクエストヘッダーのセットを示します。 キャッシュ不可または期限切れのレスポンスでは、Vary フィールド値は、表現の選択に使用された基準についてユーザーエージェントにアドバイスします。

source: Vary: * effectively makes this response uncacheable.
es: Vary: * hace que esta respuesta sea efectivamente no cacheadable.
fr: Vary: * rend effectivement cette réponse impossible à mettre en cache.
ja: Vary: * は、このレスポンスを実質的にキャッシュ不可能にします。
zh: Vary: * 有效地使此响应不可缓存。

source: `Vary *` indicates that responses for this resource vary by some aspect that can't (or won't) be described by the server. This makes this response effectively uncacheable.
es: `Vary *` indica que las respuestas para este recurso varían según algún aspecto que el servidor no puede (o no quiere) describir. Esto hace que esta respuesta sea efectivamente no almacenable en caché.
fr: `Vary *` indique que les réponses pour cette ressource varient selon un aspect qui ne peut pas (ou ne sera pas) décrit par le serveur. Cela rend cette réponse effectivement incachable.
ja: `Vary *` は、サーバーで説明できない（または説明しない）何らかの側面によって、このリソースの応答が異なることを示します。これにより、この応答は実質的にキャッシュ不可能になります。
zh: `Vary *` 表明此资源的响应因服务器无法（或不愿）描述的某些方面而异。这使得此响应实际上不可缓存。

source: Vary: User-Agent can cause cache inefficiency.
es: Vary: User-Agent puede causar ineficiencia en la caché.
fr: Vary: User-Agent peut entraîner une inefficacité du cache.
ja: Vary: User-Agent はキャッシュの効率を低下させる可能性があります。
zh: Vary: User-Agent 可能导致缓存效率低下。

source: Sending `Vary: User-Agent` requires caches to store a separate copy of the response for every `User-Agent` request header they see. Since there are so many different `User-Agent`s, this can "bloat" caches with many copies of the same thing, or cause them to give up on storing these responses at all. Consider having different URIs for the various versions of your content instead; this will give finer control over caching without sacrificing efficiency.
es: Enviar `Vary: User-Agent` requiere que las cachés almacenen una copia separada de la respuesta para cada cabecera `User-Agent` que vean. Dado que hay tantos `User-Agent` diferentes, esto puede "hinchar" las cachés con muchas copias de lo mismo o hacer que renuncien a almacenar estas respuestas por completo. Considere tener URIs diferentes para las diversas versiones de su contenido en su lugar; esto le dará un control más fino sobre el almacenamiento en caché sin sacrificar la eficiencia.
fr: L'envoi de `Vary: User-Agent` oblige les caches à stocker une copie distincte de la réponse pour chaque en-tête `User-Agent` qu'ils voient. Étant donné qu'il existe de nombreux `User-Agent` différents, cela peut "gonfler" les caches avec de nombreuses copies de la même chose, ou les amener à abandonner le stockage de ces réponses. Envisagez plutôt d'avoir des URI différents pour les différentes versions de votre contenu ; cela donnera un contrôle plus fin sur la mise en cache sans sacrifier l'efficacité.
ja: `Vary: User-Agent` を送信すると、キャッシュは、参照した `User-Agent` リクエストヘッダーごとにレスポンスの別個のコピーを保存する必要があります。 `User-Agent` は非常に多いため、キャッシュに同じもののコピーがたくさん「肥大化」したり、これらのレスポンスの保存を完全に中止したりする可能性があります。 代わりに、コンテンツのさまざまなバージョンに対して異なる URI を持つことを検討してください。これにより、効率を犠牲にすることなく、キャッシングをより細かく制御できます。
zh: 发送 `Vary: User-Agent` 会要求缓存为它们看到的每个 `User-Agent` 请求头单独存储一份响应副本。 由于 `User-Agent` 非常多，这会“膨胀”缓存，存储大量相同的副本，或者导致缓存放弃存储这些响应。 请考虑为您的内容的各种版本使用不同的 URI；这样可以在不牺牲效率的情况下更精细地控制缓存。

source: Vary: Host is not necessary.
es: Vary: Host no es necesario.
fr: Vary: Host n'est pas nécessaire.
ja: Vary: Host は不要です。
zh: Vary: Host 不需要。

source: Some servers (e.g., [Apache](http://httpd.apache.org/) with [mod_rewrite](http://httpd.apache.org/docs/2.4/mod/mod_rewrite.html)) will send `Host` in the `Vary` header, in the belief that this is necessary. This is not the case; HTTP specifies that the URI is the basis of the cache key, and the URI incorporates the `Host` header. The presence of `Vary: Host` may make some caches not store an otherwise cacheable response (since some cache implementations will not store anything that has a `Vary` header).
es: Algunos servidores (por ejemplo, [Apache](http://httpd.apache.org/) con [mod_rewrite](http://httpd.apache.org/docs/2.4/mod/mod_rewrite.html)) enviarán `Host` en la cabecera `Vary`, con la creencia de que esto es necesario. Este no es el caso; HTTP especifica que la URI es la base de la clave de caché, y la URI incorpora la cabecera `Host`. La presencia de `Vary: Host` puede hacer que algunas cachés no almacenen una respuesta que de otro modo sería almacenable en caché (ya que algunas implementaciones de caché no almacenarán nada que tenga una cabecera `Vary`).
fr: Certains serveurs (par exemple, [Apache](http://httpd.apache.org/) avec [mod_rewrite](http://httpd.apache.org/docs/2.4/mod/mod_rewrite.html)) enverront `Host` dans l'en-tête `Vary`, pensant que c'est nécessaire. Ce n'est pas le cas ; le protocole HTTP spécifie que l'URI est la base de la clé de cache, et l'URI intègre l'en-tête `Host`. La présence de `Vary: Host` peut amener certains caches à ne pas stocker une réponse autrement cacheable (car certaines implémentations de cache ne stockeront rien qui ait un en-tête `Vary`).
ja: 一部のサーバー（例：[Apache](http://httpd.apache.org/) の [mod_rewrite](http://httpd.apache.org/docs/2.4/mod/mod_rewrite.html)）は、必要だと考えて `Host` を `Vary` ヘッダーに含めることがあります。 しかし、これは正しくありません。HTTP では、URI がキャッシュキーの基盤であり、URI には `Host` ヘッダーが含まれると規定されています。 `Vary: Host` の存在は、キャッシュ可能なレスポンスであっても、一部のキャッシュが保存しない原因となる可能性があります（一部のキャッシュ実装では、`Vary` ヘッダーを持つものは何も保存しないため）。
zh: 有些服务器（例如，[Apache](http://httpd.apache.org/) 配合 [mod_rewrite](http://httpd.apache.org/docs/2.4/mod/mod_rewrite.html)）会发送 `Host` 作为 `Vary` 头部字段，认为这是必要的。 事实并非如此；HTTP 规定 URI 是缓存键的基础，而 URI 包含了 `Host` 头部字段。 `Vary: Host` 的存在可能会导致某些缓存不存储本可缓存的响应（因为有些缓存实现不会存储带有 `Vary` 头部字段的任何内容）。

source: Transparent Content Negotiation is not widely supported.
es: La Negociación de Contenido Transparente no está ampliamente soportada.
fr: La négociation de contenu transparente n'est pas largement prise en charge.
ja: 透過型コンテンツネゴシエーションは広くサポートされていません。
zh: 透明内容协商（Transparent Content Negotiation）支持不广泛。

source: The `Vary: Negotiate` header value is not necessary, as [Transparent Content Negotiation](https://www.rfc-editor.org/rfc/rfc2295.html) is not widely supported. Consider removing it.
es: El valor del encabezado `Vary: Negotiate` no es necesario, ya que la [Negociación de Contenido Transparente](https://www.rfc-editor.org/rfc/rfc2295.html) no tiene un amplio soporte. Considere eliminarlo.
fr: La valeur de l'en-tête `Vary: Negotiate` n'est pas nécessaire, car la [Négociation Transparente de Contenu](https://www.rfc-editor.org/rfc/rfc2295.html) n'est pas largement prise en charge. Envisagez de la supprimer.
ja: `Vary: Negotiate` ヘッダーの値は、[Transparent Content Negotiation](https://www.rfc-editor.org/rfc/rfc2295.html) が広くサポートされていないため、不要です。 削除を検討してください。
zh: `Vary: Negotiate` 标头值并非必需，因为[透明内容协商](https://www.rfc-editor.org/rfc/rfc2295.html) 并未得到广泛支持。 考虑移除它。

source: The Vary header contains duplicate values.
es: El encabezado Vary contiene valores duplicados.
fr: Le en-tête Vary contient des valeurs en double.

source: The `Vary` header allows you to list the parts of the request that effectively change the response representation. Listing the same header more than once is redundant and can be confusing.
es: La cabecera 'Vary' permite listar las partes de la solicitud que cambian efectivamente la representación de la respuesta. Listar la misma cabecera más de una vez es redundante y puede ser confuso.
fr: La tête « Vary » vous permet de lister les parties de la demande qui changent effectivement la représentation de la réponse. La liste de la même tête plus d'une fois est redondante et peut être confuse.

source: This resource varies in %(vary_count)s ways.
es: Este recurso varía de %(vary_count)s maneras.
fr: Cette ressource varie de %(vary_count)s manières.
ja: このリソースは%(vary_count)s の点で異なります。
zh: 此资源在 %(vary_count)s 个方面有所不同。

source: The `Vary` mechanism allows a resource to describe the dimensions that its responses vary, or change, over; each listed header is another dimension. Varying by too many dimensions makes using this information impractical.
es: El mecanismo `Vary` permite a un recurso describir las dimensiones sobre las cuales sus respuestas varían o cambian; cada encabezado listado es otra dimensión. Variar por demasiadas dimensiones hace que sea poco práctico usar esta información.
fr: Le mécanisme `Vary` permet à une ressource de décrire les dimensions sur lesquelles ses réponses varient, ou changent ; chaque en-tête listé est une dimension supplémentaire. Varier sur trop de dimensions rend l'utilisation de cette information peu pratique.
ja: `Vary` メカニズムにより、リソースは、そのレスポンスが変化する、または変更されるディメンションを記述できます。リストされた各ヘッダーは別のディメンションです。 ディメンションが多すぎると、この情報の利用が非現実的になります。
zh: `Vary` 机制允许资源描述其响应变化（或改变）的维度；列出的每个头字段代表一个维度。 变化维度过多会使使用此信息变得不切实际。

source: The `Via` header is added to requests and responses by proxies and other HTTP intermediaries. It can be used to help avoid request loops and identify the protocol capabilities of all senders along the request/response chain.
es: La cabecera `Via` es añadida a las peticiones y respuestas por proxies y otros intermediarios HTTP. Se puede usar para ayudar a evitar bucles de petición e identificar las capacidades de protocolo de todos los emisores a lo largo de la cadena de petición/respuesta.
ja: `Via` ヘッダーは、プロキシやその他の HTTP 中継サーバーによってリクエストおよびレスポンスに追加されます。 これにより、リクエストループの回避や、リクエスト/レスポンスチェーン上のすべての送信者のプロトコル機能を特定するのに役立ちます。

source: One or more intermediaries are present.
es: Hay uno o más intermediarios presentes.
fr: Un ou plusieurs intermédiaires sont présents.
ja: 一つ以上の仲介者が存在します。
zh: 存在一个或多个中间服务器。

source: The `Via` header indicates that one or more intermediaries are present between the user agent and the origin server for the resource. This may indicate that a proxy is configured, or that the server uses a "reverse proxy" or CDN in front of it. There field has three space-separated components; first, the HTTP version of the message that the intermediary received, then the identity of the intermediary (usually but not always its hostname), and then optionally a product identifier or comment (usually used to identify the software being used).
es: La cabecera `Via` indica que hay uno o más intermediarios entre el agente de usuario y el servidor de origen del recurso. Esto puede indicar que hay un proxy configurado, o que el servidor utiliza un "proxy inverso" o CDN delante de él. Este campo tiene tres componentes separados por espacios; primero, la versión HTTP del mensaje que recibió el intermediario, luego la identidad del intermediario (generalmente pero no siempre su nombre de host), y luego opcionalmente un identificador de producto o comentario (generalmente utilizado para identificar el software que se está utilizando).
fr: L'en-tête `Via` indique qu'un ou plusieurs intermédiaires sont présents entre l'agent utilisateur et le serveur d'origine de la ressource. Cela peut indiquer qu'un proxy est configuré, ou que le serveur utilise un "proxy inverse" ou un CDN devant lui. Ce champ comporte trois composantes séparées par des espaces ; d'abord, la version HTTP du message que l'intermédiaire a reçu, ensuite l'identité de l'intermédiaire (généralement, mais pas toujours, son nom d'hôte), et enfin, facultativement, un identifiant de produit ou un commentaire (généralement utilisé pour identifier le logiciel utilisé).
ja: `Via` ヘッダーは、リソースへのユーザーエージェントとオリジンサーバーの間に1つ以上の仲介が存在することを示します。 これは、プロキシが構成されていること、またはサーバーがその前に「リバースプロキシ」またはCDNを使用していることを示している可能性があります。 このフィールドには、スペースで区切られた3つのコンポーネントがあります。まず、仲介が受信したメッセージのHTTPバージョン、次に仲介の識別子（通常はホスト名ですが、常にそうとは限りません）、そしてオプションで製品識別子またはコメント（通常は使用されているソフトウェアを識別するために使用されます）。
zh: `Via` 报头表明用户代理和资源源服务器之间存在一个或多个中间服务器。 这可能表明配置了代理，或者服务器在其前面使用了“反向代理”或 CDN。 该字段由三个用空格分隔的组件组成；首先是中间服务器接收到的消息的 HTTP 版本，然后是中间服务器的标识（通常是其主机名，但不总是），最后是可选的产品标识符或注释（通常用于识别所使用的软件）。
