Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: This response's `Content-Encoding` header indicates it has content-codings applied (`%(unwanted_codings)s`) that the request didn't ask for. Normally, clients ask for the encodings they want in the `Accept-Encoding` request header. Using encodings that the client doesn't explicitly request can lead to interoperability problems.
ja: このレスポンスの `Content-Encoding` ヘッダーは、リクエストで要求されていないコンテンツコーディング (`%(unwanted_codings)s`) が適用されていることを示しています。 通常、クライアントは `Accept-Encoding` リクエストヘッダーで、希望するエンコーディングを要求します。クライアントが明示的に要求しないエンコーディングを使用すると、相互運用性の問題が発生する可能性があります。
zh: 此响应的 `Content-Encoding` 标头表明应用了请求未要求的编码（`%(unwanted_codings)s`）。 通常，客户端会在 `Accept-Encoding` 请求标头中请求它们想要的编码。使用客户端未明确请求的编码可能导致互操作性问题。

source: The `Content-Length` header indicates the size of the content, in number of bytes. In responses to the HEAD method, it indicates the size of the content that would have been sent had the request been a GET. If Content-Length is incorrect, HTTP/1.1 persistent connections will not work, and caches may not store the response (since they can't be sure if they have the whole response).
ja: `Content-Length` ヘッダーは、コンテンツのサイズをバイト単位で示します。HEAD メソッドへの応答では、リクエストが GET であった場合に送信されたであろうコンテンツのサイズを示します。 Content-Length が正しくない場合、HTTP/1.1 の永続接続が機能しなくなり、キャッシュは応答を保存できない可能性があります（応答全体を取得できたかどうかわからないため）。

source: The `Content-Location` response header can used to supply an address for the representation when it is accessible from a location separate from the request URI.
ja: `Content-Location` レスポンスヘッダーは、リクエスト URI とは別の場所からアクセスできる表現のアドレスを指定するために使用できます。

source: The `Content-MD5` header is an MD5 digest of the content, and provides an end-to-end message integrity check (MIC). Note that while a MIC is good for detecting accidental modification of content in transit, it is not proof against malicious attacks.
ja: `Content-MD5` ヘッダーはコンテンツの MD5 ダイジェストであり、エンドツーエンドのメッセージ整合性チェック (MIC) を提供します。 MIC は、転送中のコンテンツの偶発的な変更を検出するのに役立ちますが、悪意のある攻撃に対する証明にはならないことに注意してください。

source: The `Content-Range` response header is sent in a `206` (Partial Content) response to indicate where in the full response content the partial content is located. It is also used in `416` (Requested Range Not Satisfiable) responses.
ja: `Content-Range` レスポンスヘッダーは、`206` (Partial Content) レスポンスで、完全なレスポンスコンテンツのどこに部分コンテンツが配置されているかを示すために送信されます。`416` (Requested Range Not Satisfiable) レスポンスでも使用されます。

source: The `Content-Transfer-Encoding` isn't part of HTTP, but it is used in MIME protocols in a manner analogous to `Transfer-Encoding`.
ja: `Content-Transfer-Encoding` は HTTP には含まれませんが、MIME プロトコルで `Transfer-Encoding` と同様の方法で使用されます。

source: The `Content-Type` header indicates the media type of the content sent to the recipient or, in the case of responses to the HEAD method, the media type that would have been sent had the request been a GET.
ja: `Content-Type` ヘッダーは、受信者に送信されるコンテンツのメディアタイプ、または HEAD メソッドへの応答の場合、リクエストが GET であった場合に送信されたであろうメディアタイプを示します。

source: The `Cross-Origin-Embedder-Policy` header field prevents a document from loading any cross-origin resources that don't explicitly grant the document permission (using CORP or CORS).
ja: `Cross-Origin-Embedder-Policy` ヘッダーフィールドは、ドキュメントが、明示的に許可（CORPまたはCORSを使用）されていないクロスオリジンリソースの読み込みを防ぎます。

source: The `Cross-Origin-Opener-Policy` header field allows a document to disown its opener, ensuring that it doesn't have a reference to the opener's window object.
ja: `Cross-Origin-Opener-Policy` ヘッダーフィールドは、ドキュメントがそのopenerを切り離すことを可能にし、openerのwindowオブジェクトへの参照を持たないことを保証します。

source: The `Cross-Origin-Resource-Policy` header field allows a resource to indicate whether it can be loaded by a cross-origin document.
ja: `Cross-Origin-Resource-Policy` ヘッダーフィールドにより、リソースはクロスオリジン文書によって読み込まれることができるかどうかを示すことができます。

source: `%(value)s` is not a valid value for the `Cross-Origin-Resource-Policy` header; it must be one of `same-origin`, `same-site`, or `cross-origin`.
ja: `%(value)s` は `Cross-Origin-Resource-Policy` ヘッダーの有効な値ではありません。 `same-origin`、`same-site`、または `cross-origin` のいずれかである必要があります。
zh: `%(value)s` 不是 `Cross-Origin-Resource-Policy` 标头的一个有效值； 它必须是 `same-origin`、`same-site` 或 `cross-origin` 之一。

source: The `%(field_name)s` field usually means that a HTTP load balancer, proxy or other intermediary in front of the server has rewritten the `Content-Length` header, to allow it to insert its own. Usually, this is done because an intermediary has dynamically compressed the message. It takes this form because the most efficient way of assuring that clients don't see the header is to rearrange or change individual characters in its name.
ja: `%(field_name)s`フィールドは通常、サーバーの前面にあるHTTPロードバランサー、プロキシ、またはその他の仲介者が、独自のヘッダーを挿入できるように `Content-Length` ヘッダーを書き換えたことを意味します。 通常、これは、仲介者がメッセージを動的に圧縮したために行われます。 クライアントがヘッダーを見ないように保証する最も効率的な方法が、その名前の個々の文字を並べ替えたり変更したりすることであるため、この形式をとります。

source: The `Date` header represents the time when the message was generated, regardless of caching that happened since. It is used by caches as input to expiration calculations, and to detect clock drift.
ja: `Date` ヘッダーは、キャッシュが行われたかどうかに関わらず、メッセージが生成された時刻を表します。 キャッシュはこのヘッダーを、有効期限の計算やクロックドリフトの検出の入力として使用します。

source: The `ETag` header provides an opaque identifier for the representation.
ja: `ETag` ヘッダーは、表現の不透明な識別子を提供します。

source: The `Expires` response header gives a time after which the response is considered stale by caches.
ja: `Expires` レスポンスヘッダーは、レスポンスがキャッシュによって古くなったとみなされる時刻を指定します。

source: The `From` header field contains an Internet email address for the human user who controls the requesting user agent.
ja: `From` ヘッダーフィールドには、リクエストユーザーエージェントを制御する人間のユーザーのインターネットメールアドレスが含まれています。

source: The `Host` header field provides the host and port information from the target URI, enabling the origin server to distinguish between resources while servicing requests for multiple host names on a single IP address.
ja: `Host` ヘッダーフィールドは、ターゲット URI からホストおよびポート情報を提供し、オリジンサーバーが単一の IP アドレスでの複数のホスト名に対するリクエストを処理する際に、リソースを区別できるようにします。

source: The `If-Modified-Since` header field makes a request method conditional on the selected representation's modification date being more recent than the date provided in the field-value.
ja: `If-Modified-Since` ヘッダーフィールドは、選択された表現の最終更新日時が、フィールド値で提供された日時よりも新しい場合にのみ、リクエストメソッドを条件付けします。

source: The `If-Range` header field allows a client to "short-circuit" the second request. It means: if the representation is unchanged, send me the part(s) that I am missing; otherwise, send me the entire new representation.
ja: `If-Range` ヘッダーフィールドにより、クライアントは2番目のリクエストを「ショートサーキット」できます。これは、リソースが変更されていない場合は、不足している部分のみを送信し、変更されている場合は、完全に新しいリソース全体を送信することを意味します。

source: The `If-Unmodified-Since` header field makes the request method conditional on the selected representation's last modification date being earlier than or equal to the date provided in the field-value.
ja: `If-Unmodified-Since` ヘッダーフィールドは、選択された表現の最終更新日時が、フィールド値で提供された日時以前であるか、または同等である場合に、リクエストメソッドを条件付けます。

source: The `Last-Modified` response header indicates the time that the origin server believes the representation was last modified.
ja: `Last-Modified` レスポンスヘッダーは、オリジンサーバーがリソースの最終更新日時であると判断した時刻を示します。

source: The `Link` header, defined by [RFC5988](https://www.rfc-editor.org/rfc/rfc5988#section-5), uses the `rel` parameter to communicate the type of a link. `rev` is deprecated by that specification because it is often confusing. Use `rel` and an appropriate relation.
ja: `Link` ヘッダーは、[RFC5988](https://www.rfc-editor.org/rfc/rfc5988#section-5) で定義されており、 `rel` パラメーターを使用してリンクのタイプを伝達します。`rev` は、しばしば混乱を招くため、 この仕様で非推奨とされています。 `rel` と適切なリレーションを使用してください。
zh: `Link` 标头，由 [RFC5988](https://www.rfc-editor.org/rfc/rfc5988#section-5) 定义，使用 `rel` 参数来传达链接的类型。`rev` 已在该规范中弃用， 因为它经常令人困惑。 请使用 `rel` 和一个合适的关联。

source: The `Link` header, defined by [RFC5988](https://www.rfc-editor.org/rfc/rfc5988#section-5), uses the `anchor` parameter to define the context URI for the link. This parameter can be an absolute or relative URI; however, `%(anchor)s` is neither.
ja: `Link` ヘッダーは [RFC5988](https://www.rfc-editor.org/rfc/rfc5988#section-5) で定義されており、`anchor` パラメーターを使用してリンクのコンテキスト URI を定義します。 このパラメーターは絶対 URI または相対 URI にできます。しかし、`%(anchor)s` はどちらでもありません。
zh: `Link` 标头（根据 [RFC5988](https://www.rfc-editor.org/rfc/rfc5988#section-5) 定义）使用 `anchor` 参数来定义链接的上下文 URI。 此参数可以是绝对 URI 或相对 URI；然而，`%(anchor)s` 既不是。

source: The `Location` response header is used in `3xx` responses to redirect the recipient to a different location to complete the request. In `201` (Created) responses, it identifies a newly created resource.
ja: `Location` レスポンスヘッダーは、`3xx` レスポンスで使用され、リクエストを完了するために受信者を別の場所にリダイレクトします。 `201` (Created) レスポンスでは、新しく作成されたリソースを特定します。

source: The `Max-Forwards` header field provides a mechanism to limit the number of times that the request is forwarded by intermediaries.
ja: `Max-Forwards` ヘッダーフィールドは、リクエストが中間サーバーによって転送される回数を制限するメカニズムを提供します。

source: HTTP is not a MIME-compliant protocol. However, HTTP/1.1 messages can include a single MIME-Version header to indicate what version of the MIME protocol was used to construct the message. Use of the MIME-Version header indicates that the message is in full compliance with the MIME protocol.
ja: HTTP は MIME 準拠プロトコルではありません。しかし、HTTP/1.1 メッセージには、メッセージの構築に使用された MIME プロトコルのバージョンを示す単一の MIME-Version ヘッダーを含めることができます。MIME-Version ヘッダーの使用は、メッセージが MIME プロトコルに完全に準拠していることを示します。

source: The `P3P` response header allows a server to describe its privacy policy in a machine-readable way. It has been deprecated, because client support was poor.
ja: `P3P` レスポンスヘッダーを使用すると、サーバーはプライバシーポリシーを機械可読な方法で記述できます。クライアントのサポートが弱かったため、非推奨となりました。

source: The `Permissions-Policy` response header allows a site to control the use of browser features.
ja: `Permissions-Policy` レスポンスヘッダーは、サイトがブラウザ機能の使用を制御できるようにします。

source: Pragma: no-cache is a request directive, not a response directive.
ja: Pragma: no-cache はリクエストディレクティブであり、レスポンスディレクティブではありません。
zh: Pragma: no-cache 是一个请求指令，而非响应指令。

source: `Pragma` is a very old request header that is sometimes used as a response header, even though this is not specified behaviour. `Cache-Control: no-cache` is more appropriate.
ja: `Pragma` は非常に古いリクエストヘッダーですが、仕様外であるにもかかわらず、レスポンスヘッダーとして使用されることがあります。`Cache-Control: no-cache` の方が適切です。
zh: `Pragma` 是一个非常旧的请求头，有时也会被用作响应头，尽管 这并不是指定的行为。`Cache-Control: no-cache` 是更合适的选择。

source: The `Proxy-Authorization` header field allows a user agent to authenticate itself with a proxy -- usually, but not necessarily, after receiving a 407 (Proxy Authentication Required) response.
ja: `Proxy-Authorization` ヘッダーフィールドを使用すると、ユーザーエージェントはプロキシに対して自身を認証できます。通常、これは 407 (Proxy Authentication Required) レスポンスを受け取った後ですが、それに限定されません。

source: The `Proxy-Status` header field indicates how intermediaries have handled the response.
ja: `Proxy-Status` ヘッダーフィールドは、中間サーバーがどのようにレスポンスを処理したかを示します。

source: The `Range` header field on a GET request modifies the method semantics to request only those parts of the representation that are specified.
ja: GET リクエストの `Range` ヘッダーフィールドは、指定された表現のパートのみを要求するようにメソッドセマンティクスを変更します。

source: The `Referer` [sic] header field allows the user agent to specify a URI Reference for the resource from which the target URI was obtained (i.e., the "referrer").
ja: `Referer` ヘッダーフィールドは、ユーザーエージェントがターゲットURIを取得したリソースのURI参照（つまり、「リファラー」）を指定することを許可します。

source: The `Retry-After` response header can be used with a `503` (Service Unavailable) response to indicate how long the service is expected to be unavailable to the requesting client. The value of this field can be either a date or an integer number of seconds.
ja: `Retry-After` レスポンスヘッダーは、`503`（サービス利用不可）レスポンスとともに、リクエスト元のクライアントに対してサービスが利用不可と予想される期間を示すために使用できます。 このフィールドの値は、日付または秒単位の整数です。

source: The `Set-Cookie` response header sets a stateful "cookie" on the client, to be included in future requests to the server.
ja: `Set-Cookie` レスポンスヘッダーは、クライアントにステートフルな「Cookie」を設定し、将来サーバーへのリクエストに含められます。

source: The `domain` parameter on this `Set-Cookie` header is empty. Browsers will probably ignore it as a result.
ja: この `Set-Cookie` ヘッダーの `domain` パラメータが空です。 その結果、ブラウザはおそらく無視するでしょう。
zh: `Set-Cookie` 标头中的 `domain` 参数为空。 浏览器因此可能会忽略它。

source: The `Secure` attribute on this `Set-Cookie` header is missing. Browsers will ignore it.
ja: `Set-Cookie` ヘッダーの `Secure` 属性がありません。 ブラウザはこれを無視します。
zh: 此 `Set-Cookie` 标头中缺少 `Secure` 属性。 浏览器将会忽略它。

source: The `Set-Cookie` value is %(set_cookie_value_length)s long. This may be wasteful.
ja: `Set-Cookie` の値は %(set_cookie_value_length)s バイトです。 これは無駄遣いである可能性があります。
zh: `Set-Cookie` 的值长度为 %(set_cookie_value_length)s。 这可能很浪费。

source: The `Set-Cookie` header has a lifetime (Max-Age or Expires) that is greater than 400 days. Browsers will cap the lifetime to 400 days.
ja: `Set-Cookie` ヘッダーには、400 日を超える有効期間 (Max-Age または Expires) が指定されています。 ブラウザは有効期間を 400 日に制限します。
zh: `Set-Cookie` 标头具有大于 400 天的生命周期（Max-Age 或 Expires）。 浏览器会将生命周期上限设置为 400 天。

source: The `SOAPAction` request header is used by SOAP, which isn't really HTTP. Stop it.
ja: SOAP は実際には HTTP ではないため、`SOAPAction` リクエストヘッダーは使用されません。停止してください。

source: The `Strict-Transport-Security` response header (often abbreviated as HSTS) lets a web site tell browsers that it should only be communicated with using HTTPS, instead of using HTTP.
ja: `Strict-Transport-Security` レスポンスヘッダー（HSTS と略されることもあります）は、ウェブサイトがブラウザに対して、HTTP ではなく HTTPS のみを使用して通信すべきであることを伝えることができます。

source: This response has multiple HSTS headers.
ja: このレスポンスには複数のHSTSヘッダーが含まれています。
zh: 此响应有多个 HSTS 标头。

source: A response should only contain a single `Strict-Transport-Security` header. User agents are required to process only the first one and ignore the rest.
ja: レスポンスには `Strict-Transport-Security` ヘッダーを1つだけ含める必要があります。 ユーザーエージェントは最初の1つのみを処理し、残りは無視することが要求されます。
zh: 响应应只包含一个 `Strict-Transport-Security` 报头。 用户代理被要求只处理第一个，并忽略其余的。

source: This message has unsupported transfer-coding.
ja: このメッセージには、サポートされていない転送エンコーディングが含まれています。
zh: 此消息具有不受支持的传输编码。

source: This message's `Transfer-Encoding` header indicates it has transfer-codings applied, but the request didn't ask for it (or them) to be. They are: `%(unwanted_codings)s` Normally, clients ask for the encodings they want in the `TE` request header. Using codings that the client doesn't explicitly request can lead to interoperability problems.
ja: このメッセージの `Transfer-Encoding` ヘッダーは、転送コーディングが適用されていることを示していますが、リクエストはそれを求めていませんでした。 それらは： `%(unwanted_codings)s` 通常、クライアントは `TE` リクエストヘッダーで必要なエンコーディングを要求します。クライアントが明示的に要求しないコーディングを使用すると、相互運用性の問題が発生する可能性があります。
zh: 此消息的 `Transfer-Encoding` 标头表明它已应用了传输编码，但请求并未要求应用（或它们）。 它们是： `%(unwanted_codings)s` 通常，客户端会在 `TE` 请求标头中请求它们想要的编码。使用客户端未明确请求的编码可能导致互操作性问题。

source: The `User-Agent` header field contains information about the user agent originating the request.
ja: `User-Agent` ヘッダーフィールドには、リクエストを発信したユーザーエージェントに関する情報が含まれています。

source: The X-Frame-Options response header declares a policy regarding whether the browser may display the transmitted content in frames that are part of other web pages.
ja: X-Frame-Options レスポンスヘッダーは、ブラウザがフレーム内で表示できるコンテンツのポリシーを宣言します。これは他のウェブページの一部として表示される場合に適用されます。

source: The `%(field_name)s` response header is used to "pad" the size of the response's headers. Very old versions of the Netscape browser had a bug whereby a response whose headers were exactly 256 or 257 bytes long, the browser would consider the response invalid. Since the affected browsers (specifically, Netscape 2.x, 3.x and 4.0 up to beta 2) are no longer widely used, it's safe to omit this header.
ja: `%(field_name)s` レスポンスヘッダーは、レスポンスヘッダーのサイズを「パディング」するために使用されます。 Netscape ブラウザーの非常に古いバージョンには、ヘッダーのサイズがちょうど 256 バイトまたは 257 バイトだった場合、ブラウザーがレスポンスを無効とみなすバグがありました。 影響を受けるブラウザー (具体的には Netscape 2.x, 3.x および 4.0 beta 2 まで) はもはや 広く使用されていないため、このヘッダーを省略しても安全です。

source: The %(field_name)s header is very large (%(field_size)s bytes).
zh: %(field_name)s 标头非常大（%(field_size)s 字节）。

source: Some implementations limit the size of any single header line.
zh: 某些实现会限制单个标头行的长度。

source: The total size of the headers is very large (%(header_size)s bytes).
zh: 请求头总大小过大（%(header_size)s 字节）。

source: Some implementations limit the total size of the header block. 32KB is a reasonable upper limit.
zh: 某些实现会限制请求头块的总大小。32KB 是一个合理的上限。

source: The %(field_name)s header's name contains non-ASCII characters.
zh: %(field_name)s 报头字段的名称包含非 ASCII 字符。

source: The %(field_name)s header's value contains non-ASCII characters.
zh: “%(field_name)s” 标头的值包含非 ASCII 字符。

source: HTTP fields notionally use the ISO-8859-1 character set, but in most cases are pure ASCII (a subset of this encoding). This header has non-ASCII characters, which have been interpreted as being encoded in ISO-8859-1. If another encoding is used (e.g., UTF-8), the results may be unpredictable.
zh: HTTP 字段名义上使用 ISO-8859-1 字符集，但在大多数情况下是纯 ASCII （此编码的子集）。 此标头包含非 ASCII 字符，已被解释为使用 ISO-8859-1 编码。如果使用了其他编码（例如 UTF-8），结果可能会不可预测。
