Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: The `Keep-Alive` header is completely optional; it is defined primarily because the `keep-alive` connection token implies that such a header exists, not because anyone actually uses it. Some implementations (e.g., [Apache](http://httpd.apache.org/)) do generate a `Keep-Alive` header to convey how many requests they're willing to serve on a single connection, what the connection timeout is and other information. However, this isn't usually used by clients. It's safe to remove this header if you wish to save a few bytes.
es: La cabecera `Keep-Alive` es completamente opcional; se define principalmente porque el token de conexión `keep-alive` implica que dicha cabecera existe, no porque alguien la utilice realmente. Algunas implementaciones (por ejemplo, [Apache](http://httpd.apache.org/)) sí generan una cabecera `Keep-Alive` para comunicar cuántas solicitudes están dispuestas a servir en una sola conexión, cuál es el tiempo de espera de la conexión y otra información. Sin embargo, esto no suele ser utilizado por los clientes. Es seguro eliminar esta cabecera si desea ahorrar unos pocos bytes.
ja: `Keep-Alive` ヘッダーは完全にオプションです。このヘッダーが主に定義されているのは、`keep-alive` 接続トークンがそのようなヘッダーが存在することを示唆しているからであり、実際に使用されているわけではありません。 一部の実装（例：[Apache](http://httpd.apache.org/)）は、`Keep-Alive` ヘッダーを生成して、単一接続で何件のリクエストを受け付けるか、接続タイムアウト時間、その他の情報などを伝達します。ただし、これは通常クライアントによって使用されません。 数バイトを節約したい場合は、このヘッダーを削除しても安全です。

source: The Last-Modified time is in the future.
es: La hora Last-Modified está en el futuro.
fr: L'heure Last-Modified est dans le futur.
ja: 最終更新時刻が未来の日付になっています。
zh: 最后修改时间在未来。

source: The `Last-Modified` header indicates the last point in time that the resource has changed. This response's `Last-Modified` time is in the future, which doesn't have any defined meaning in HTTP.
es: La cabecera `Last-Modified` indica el último punto en el tiempo en que el recurso ha cambiado. La hora `Last-Modified` de esta respuesta está en el futuro, lo cual no tiene ningún significado definido en HTTP.
fr: L'en-tête `Last-Modified` indique le dernier moment où la ressource a été modifiée. L'heure `Last-Modified` de cette réponse est dans le futur, ce qui n'a aucune signification définie dans HTTP.
ja: `Last-Modified` ヘッダーは、リソースが最後に変更された時点を示します。 このレスポンスの `Last-Modified` 時刻は未来であり、HTTP では定義された意味を持ちません。
zh: `Last-Modified` 标头指示资源上次修改的时间点。 此响应的 `Last-Modified` 时间是将来时，在 HTTP 中没有明确的含义。

source: The resource last changed %(last_modified_string)s.
es: El recurso cambió por última vez %(last_modified_string)s.
fr: La ressource a changé pour la dernière fois %(last_modified_string)s.
ja: リソースは%(last_modified_string)sに最後に変更されました。
zh: 该资源上次修改时间是 %(last_modified_string)s。

source: The `Last-Modified` header indicates the last point in time that the resource has changed. It is used in HTTP for validating cached responses, and for calculating heuristic freshness in caches. This resource last changed %(last_modified_string)s.
es: La cabecera `Last-Modified` indica el último momento en que el recurso ha cambiado. Se usa en HTTP para validar respuestas cacheadas y para calcular la frescura heurística en las cachés. Este recurso cambió por última vez el %(last_modified_string)s.
fr: L'en-tête `Last-Modified` indique le dernier moment où la ressource a été modifiée. Il est utilisé dans HTTP pour valider les réponses mises en cache et pour calculer la fraîcheur heuristique dans les caches. Cette ressource a été modifiée pour la dernière fois le %(last_modified_string)s.
ja: `Last-Modified` ヘッダーは、リソースが最後に変更された時点を示します。HTTP では、キャッシュされた応答の検証や、キャッシュでのヒューリスティックな鮮度計算に使用されます。 このリソースは %(last_modified_string)s に最後に変更されました。
zh: `Last-Modified` 标头指示资源最后一次更改的时间点。它用于 HTTP 中验证缓存的响应，以及计算缓存的启发式新鲜度。 此资源最后一次更改时间为 %(last_modified_string)s。

source: The `Link` header allows links related to the content to be conveyed. A link can be viewed as a statement of the form "[context IRI] has a [relation type] resource at [target IRI], which has [target attributes].
es: La cabecera `Link` permite comunicar enlaces relacionados con el contenido. Un enlace se puede ver como una declaración de la forma "[IRI de contexto] tiene un recurso de [tipo de relación] en [IRI de destino], el cual tiene [atributos de destino]".
ja: `Link` ヘッダーを使用すると、コンテンツに関連するリンクを伝えることができます。リンクは、「[コンテキストIRI] が [ターゲットIRI] に [関係タイプ] リソースを持ち、そのリソースは [ターゲット属性] を持つ」という形式のステートメントとして表示できます。

source: The 'rev' parameter on the Link header is deprecated.
es: El parámetro 'rev' en la cabecera Link está obsoleto.
fr: Le paramètre 'rev' sur l'en-tête Link est obsolète.
ja: Link ヘッダーの 'rev' パラメータは非推奨です。
zh: Link 响应头上的 'rev' 参数已弃用。

source: The `Link` header, defined by [RFC 8288](https://www.rfc-editor.org/rfc/rfc8288#section-3), uses the `rel` parameter to communicate the type of a link. `rev` is deprecated by that specification because it is often confusing. Use `rel` and an appropriate relation.
es: La cabecera `Link`, definida por [RFC 8288](https://www.rfc-editor.org/rfc/rfc8288#section-3), utiliza el parámetro `rel` para comunicar el tipo de un enlace. `rev` está en desuso por esa especificación porque a menudo es confusa. Utilice `rel` y una relación apropiada.
fr: La tête `Link`, définie par [RFC 8288](https://www.rfc-editor.org/rfc/rfc8288#section-3), utilise le paramètre `rel` pour communiquer le type d'un lien. `rev` est obsolète par cette spécification parce qu'il est souvent déroutant. Utilisez `rel` et une relation appropriée.

source: The 'anchor' parameter on the %(link)s Link header isn't a URI.
es: El parámetro 'anchor' en el encabezado Link de %(link)s no es una URI.
fr: Le paramètre 'anchor' sur l'en-tête Link %(link)s n'est pas un URI.
ja: %(link)s の Link ヘッダーの 'anchor' パラメーターは URI ではありません。
zh: ‘%(link)s’ 链接头部中的 ‘anchor’ 参数不是一个 URI。

source: The `Link` header, defined by [RFC 8288](https://www.rfc-editor.org/rfc/rfc8288#section-3), uses the `anchor` parameter to define the context URI for the link. This parameter can be an absolute or relative URI; however, `%(anchor)s` is neither.
es: La cabecera `Link`, definida por [RFC 8288](https://www.rfc-editor.org/rfc/rfc8288#section-3), utiliza el parámetro `anchor` para definir la URI de contexto para el enlace. Este parámetro puede ser una URI absoluta o relativa; sin embargo, `%(anchor)s` no lo es.
fr: La `Link` header, définie par [RFC 8288](https://www.rfc-editor.org/rfc/rfc8288#section-3), utilise le `anchor` paramètre pour définir l'URI de contexte pour le lien. Ce paramètre peut être un URI absolu ou relatif ; toutefois, `%(anchor)s` n'est ni l'un ni l'autre.

source: The 'type' parameter on the %(link)s Link header isn't a media type.
es: El 'tipo' en el encabezado de enlace %(link)s no es un tipo de medio.
fr: Le paramètre 'type' sur l'en-tête %(link)s Link n'est pas un type de média.

source: The `Link` header, defined by [RFC 8288](https://www.rfc-editor.org/rfc/rfc8288#section-3), uses the `type` parameter to define the media type of the link target. However, `%(type)s` is not a valid media type.
es: La cabecera 'Link', definida en [RFC 8288](https://www.rfc-editor.org/rfc/rfc8288#section-3), utiliza el parámetro 'type' para definir el tipo de medio del objetivo de la vinculación. Sin embargo, '%(type)s' no es un tipo de medio válido.
fr: La tête `Link`, définie par [RFC 8288](https://www.rfc-editor.org/rfc/rfc8288#section-3), utilise le paramètre `type` pour définir le type multimédia de la cible du lien. Cependant, `%(type)s` n'est pas un type multimédia valide.

source: This status code doesn't define any meaning for the Location header.
es: Este código de estado no define ningún significado para la cabecera Location.
fr: Ce code d'état ne définit pas de signification pour l'en-tête Location.
ja: このステータスコードは、Locationヘッダーに定義された意味を持ちません。
zh: 此状态码对 Location 标头没有定义任何含义。

source: The `Location` header is used for specific purposes in HTTP; mostly to indicate the URI of another resource (e.g., in redirection, or when a new resource is created). In other status codes (such as this one) it doesn't have a defined meaning, so any use of it won't be interoperable. Sometimes `Location` is confused with `Content-Location`, which indicates a URI for the payload of the message that it appears in.
es: La cabecera `Location` se utiliza para fines específicos en HTTP; principalmente para indicar la URI de otro recurso (por ejemplo, en redireccionamientos, o cuando se crea un nuevo recurso). En otros códigos de estado (como este) no tiene un significado definido, por lo que su uso no será interoperable. A veces `Location` se confunde con `Content-Location`, que indica una URI para el contenido del mensaje en el que aparece.
fr: L'en-tête `Location` est utilisé à des fins spécifiques en HTTP ; principalement pour indiquer l'URI d'une autre ressource (par exemple, dans une redirection, ou lorsqu'une nouvelle ressource est créée). Dans d'autres codes d'état (comme celui-ci), il n'a pas de signification définie, donc toute utilisation de celui-ci ne sera pas interopérable. Parfois, `Location` est confondu avec `Content-Location`, qui indique une URI pour la charge utile du message dans lequel il apparaît.
ja: `Location` ヘッダーは HTTP で特定の目的、主に別のリソースの URI を示すために使用されます（例：リダイレクト時、または新しいリソースが作成された場合）。 （このコードのような）他のステータスコードでは、定義された意味を持たないため、その使用は相互運用性がありません。 `Location` は、メッセージのペイロードの URI を示す `Content-Location` と混同されることがあります。
zh: `Location` 标头在 HTTP 中有特定用途；主要用于指示另一个资源的 URI（例如，在重定向时，或创建新资源时）。 在其他状态代码（例如此状态代码）中，它没有明确的含义，因此任何使用它都不会具有互操作性。 有时 `Location` 会与 `Content-Location` 混淆，后者指示其所在消息的负载的 URI。

source: The Location header contains a relative URI.
es: La cabecera Location contiene una URI relativa.
fr: L'en-tête Location contient un URI relatif.
ja: Location ヘッダーには相対 URI が含まれています。
zh: Location 标头包含相对 URI。

source: `Location` was originally specified to contain an absolute, not relative, URI. It is in the process of being updated, and most clients will work around this. The correct absolute URI is (probably): `%(full_uri)s`
es: `Location` originalmente se especificó para contener una URI absoluta, no relativa. Está en proceso de actualización y la mayoría de los clientes lo solucionarán. La URI absoluta correcta es (probablemente): `%(full_uri)s`
fr: `Location` était à l'origine spécifié pour contenir un URI absolu, et non relatif. Il est en cours de mise à jour, et la plupart des clients s'en accommoderont. L'URI absolu correct est (probablement) : `%(full_uri)s`
ja: `Location` は、相対URIではなく絶対URIを含むように当初指定されていました。 現在更新中であり、ほとんどのクライアントはこの問題を回避します。 正しい絶対URIは（おそらく）次のとおりです。`%(full_uri)s`
zh: `Location` 最初被指定为包含绝对 URI，而不是相对 URI。 它正在更新过程中，大多数客户端会对此进行规避。 正确的绝对 URI（可能）是：`%(full_uri)s`

source: The Max-Forwards header is ignored for this method.
es: La cabecera Max-Forwards se ignora para este método.
fr: L'en-tête Max-Forwards est ignoré pour cette méthode.
ja: Max-Forwards ヘッダーは、このメソッドでは無視されます。
zh: Max-Forwards 标头不适用于此方法。

source: The `Max-Forwards` header is only defined for `TRACE` and `OPTIONS` requests; for other methods, it is likely to be ignored.
es: La cabecera `Max-Forwards` solo está definida para peticiones `TRACE` y `OPTIONS`; para otros métodos, es probable que se ignore.
fr: L'en-tête `Max-Forwards` est uniquement défini pour les requêtes `TRACE` et `OPTIONS` ; pour les autres méthodes, il est probable qu'il soit ignoré.
ja: `Max-Forwards` ヘッダーは `TRACE` および `OPTIONS` リクエストでのみ定義されています。他のメソッドでは、無視される可能性が高いです。
zh: `Max-Forwards` 标头仅为 `TRACE` 和 `OPTIONS` 请求定义；对于其他方法，它 很可能被忽略。

source: The NEL header has an invalid structure.
es: La cabecera NEL tiene una estructura no válida.
fr: Le en-tête NEL a une structure invalide.

source: The `NEL` header should be a list of objects.
es: La cabecera `NEL` debe ser una lista de objetos.
fr: La `NEL` header devrait être une liste d'objets.

source: The NEL policy is missing the '%(key)s' key.
es: La política NEL falta la clave '%%(key)s'.
fr: La politique NEL manque la clé '%(key)s'.

source: The `%(key)s` key is required in `NEL` policies.
es: El `%(key)s` es un campo obligatorio en las políticas `NEL`.
fr: La clé `'%(key)s'` est requise dans les politiques `NEL`.

source: The NEL policy has an invalid type for '%(key)s'.
es: La política NEL tiene un tipo no válido para '%(key)s'.
fr: La politique NEL a un type invalide pour « %(key)s ».

source: The `%(key)s` key must be of type %(expected)s.
es: La clave `'%(key)s'` debe ser del tipo `'%(expected)s'`.
fr: La clé `%(key)s` doit être de type %(expected)s.

source: The NEL policy has an invalid value for '%(key)s'.
es: La política NEL tiene un valor no válido para '%(key)s'.
fr: La politique NEL a une valeur non valide pour '%(key)s'.

source: The `%(key)s` key has an invalid value; %(details)s. Details: %(details)s
es: La clave `'%(key)s'` tiene un valor no válido; `'%(details)s'`.
fr: La clé `%(key)s` a une valeur non valide ; %(details)s. Détails : %(details)s

source: The report_to endpoint '%(value)s' is not defined.
es: El punto final 'report_to' '%(value)s' no está definido.

source: The `report_to` member in the [Network Error Logging](https://w3c.github.io/network-error-logging/) policy specifies a reporting endpoint, but no matching endpoint refers to it in the `Reporting-Endpoints` header.
es: La `report_to` en la [politica de registro de errores de red](https://w3c.github.io/network-error-logging/) se especifica un punto final de informes, pero ningún punto final coincidente lo hace en el "Encabezado de puntos finales de informes".
fr: Le membre `report_to` dans la [politique de journalisation des erreurs réseau](https://w3c.github.io/network-error-logging/) spécifie un point de rapport, mais aucun point de rapport correspondant ne le mentionne dans l'en-tête `Reporting-Endpoints`.

source: %(value)s is not a valid origin.
es: El %(value)s no es un origen válido.
fr: %(value)s n'est pas une origine valide.

source: The Origin header must contain a list of serialized origins (scheme, host, and optional port), or the string "null".
es: La cabecera Origin debe contener una lista de orígenes serializados (esquema, host y puerto opcional), o la cadena "null".
fr: L'en-tête Origin doit contenir une liste d'origins serialisées (schéma, hôte et port facultatif), ou la chaîne "null".

source: This response sets a Permissions Policy.
es: Esta respuesta establece una Política de Permisos.
fr: Cette réponse définit une politique de permissions.
ja: このレスポンスは Permissions Policy を設定しています。
zh: 此响应设置了 Permissions Policy。

source: The `Permissions-Policy` header allows a site to control the use of browser features.
es: La cabecera `Permissions-Policy` permite a un sitio controlar el uso de características del navegador.
fr: L'en-tête `Permissions-Policy` permet à un site de contrôler l'utilisation des fonctionnalités du navigateur.
ja: `Permissions-Policy` ヘッダーを使用すると、サイトはブラウザ機能の使用を制御できます。
zh: `Permissions-Policy` 标头允许网站控制浏览器功能的使用。

source: The '%(feature)s' feature is allowed for all origins.
es: La característica '%(feature)s' está permitida para todos los orígenes.
fr: La fonctionnalité '%(feature)s' est autorisée pour toutes les origines.
ja: 「%(feature)s」機能は、すべてのオリジンで許可されています。
zh: “%(feature)s”功能允许所有来源。

source: The `%(feature)s` feature is allowed for all origins (using `*`). This is insecure and should be restricted to specific origins or `self`.
es: La característica `%(feature)s` está permitida para todos los orígenes (usando `*`). Esto es inseguro y debería restringirse a orígenes específicos o `self`.
fr: La fonctionnalité `%(feature)s` est autorisée pour toutes les origines (en utilisant `*`). Ceci est non sécurisé et devrait être restreint à des origines spécifiques ou à `self`.
ja: `%(feature)s` 機能はすべてのオリジン ( `*` を使用) で許可されています。 これは安全ではなく、特定のオリジンまたは `self` に制限する必要があります。
zh: `%(feature)s` 功能对所有来源（使用 `*`）都允许。 这是不安全的，应该限制为特定来源或 `self`。

source: The value for '%(feature)s' should be an Inner List or the token '*'.
es: El valor para '%(feature)s' debe ser una Lista Interna o el token '*'.
fr: La valeur pour '%(feature)s' doit être une liste interne ou le jeton '*'.
ja: 「%(feature)s」の値は、Inner List またはトークン「*」である必要があります。
zh: '%(feature)s' 的值应为 Inner List 或 '*' 令牌。

source: The value for the `%(feature)s` feature in `Permissions-Policy` is invalid. It should be either an Inner List of origins (e.g., `(self "https://example.com")`) or the special token `*`.
es: El valor para la característica `%(feature)s` en `Permissions-Policy` es inválido. Debe ser una Lista Interna de orígenes (por ejemplo, `(self "https://example.com")`) o el token especial `*`.
fr: La valeur pour la fonctionnalité `%(feature)s` dans `Permissions-Policy` est invalide. Elle doit être soit une liste interne d'origines (par exemple, `(self "https://example.com")`), soit le jeton spécial `*`.
ja: `Permissions-Policy` の `%(feature)s` フィーチャーの値が無効です。オリジンの内部リスト（例：`(self "https://example.com")`）または特殊トークン `*` のいずれかである必要があります。
zh: `Permissions-Policy` 中 `%(feature)s` 功能的值无效。它应该是 origin 的内部列表（例如 `(self "https://example.com")`）或特殊标记 `*`。

source: '%(token)s' is not valid in an allowlist.
es: '%(token)s' no es válido en una lista blanca.
fr: '%(token)s' n'est pas valide dans une liste d'autorisation.
ja: 「%(token)s」は許可リストで無効です。
zh: '%(token)s' 不在允许列表中。

source: The token `%(token)s` is not a valid keyword in an allowlist. Valid tokens are `self` and `src`.
es: El token `%(token)s` no es una palabra clave válida en una lista de permitidos. Los tokens válidos son `self` y `src`.
fr: Le jeton `%(token)s` n'est pas un mot-clé valide dans une liste d'autorisation. Les jetons valides sont `self` et `src`.
ja: トークン `%(token)s` は、allowlist の有効なキーワードではありません。 有効なトークンは `self` および `src` です。
zh: 令牌 `%(token)s` 不是 allowlist 中的有效关键字。 有效令牌为 `self` 和 `src`。

source: The value '%(value)s' looks like a keyword but is a string.
es: El valor '%(value)s' parece una palabra clave pero es una cadena.
fr: La valeur '%(value)s' ressemble à un mot-clé mais est une chaîne.
ja: 値 '%(value)s' はキーワードのように見えますが、文字列です。
zh: 值 '%(value)s' 看起来像一个关键字，但它是一个字符串。

source: The value `%(value)s` is a string, but it looks like a keyword. If you meant to use the keyword, remove the quotes (e.g., `self` instead of `"self"`).
es: El valor `%(value)s` es una cadena, pero parece una palabra clave. Si querías usar la palabra clave, quita las comillas (por ejemplo, `self` en lugar de `"self"`).
fr: La valeur `%(value)s` est une chaîne de caractères, mais elle ressemble à un mot-clé. Si vous vouliez utiliser le mot-clé, supprimez les guillemets (par exemple, `self` au lieu de `"self"`).
ja: 値 `%(value)s` は文字列ですが、キーワードのように見えます。 キーワードを使用するつもりだった場合は、引用符を削除してください（例：「self」ではなく `self`）。
zh: 值 `%(value)s` 是一个字符串，但它看起来像一个关键字。 如果你的意思是使用关键字，请移除引号（例如，使用 `self` 而不是 `"self"`）。

source: The item '%(item)s' is not a valid type for an allowlist.
es: El elemento '%(item)s' no es un tipo válido para una lista de permitidos.
fr: L'élément '%(item)s' n'est pas un type valide pour une liste d'autorisation.
ja: 「%(item)s」という項目は、許可リストの有効なタイプではありません。
zh: 项目 '%(item)s' 不是允许列表的有效类型。

source: The item `%(item)s` is not a valid type for an allowlist. Allowlists should contain origins (strings) or keywords (tokens).
es: El elemento `%(item)s` no es un tipo válido para una lista de permitidos. Las listas de permitidos deben contener orígenes (cadenas) o palabras clave (tokens).
fr: L'élément `%(item)s` n'est pas un type valide pour une liste autorisée. Les listes autorisées doivent contenir des origines (chaînes de caractères) ou des mots-clés (jetons).
ja: `%(item)s` は、許可リストの有効なタイプではありません。 許可リストには、オリジン（文字列）またはキーワード（トークン）を含める必要があります。
zh: 条目 `%(item)s` 不是允许列表的有效类型。 允许列表应包含源（字符串）或关键字（令牌）。

source: The `Pragma` header is used to include implementation-specific directives that might apply to any recipient along the request chain. This header is deprecated, in favour of `Cache-Control`.
es: La cabecera `Pragma` se utiliza para incluir directivas específicas de la implementación que podrían aplicarse a cualquier destinatario a lo largo de la cadena de solicitud. Esta cabecera está obsoleta y se prefiere `Cache-Control`.
ja: `Pragma` ヘッダーは、リクエストチェーン上のどの受信者にも適用される可能性のある、実装固有のディレクティブを含めるために使用されます。 このヘッダーは、`Cache-Control` に取って代わられて非推奨になりました。

source: The Pragma header is being used in an undefined way.
es: El encabezado Pragma se está utilizando de una manera indefinida.
fr: L'en-tête Pragma est utilisé de manière indéfinie.
ja: Pragma ヘッダーが未定義の方法で使用されています。
zh: Pragma 头标的用法未定义。

source: HTTP only defines `Pragma: no-cache`; other uses of this header are deprecated.
es: HTTP solo define `Pragma: no-cache`; otros usos de esta cabecera están obsoletos.
fr: HTTP ne définit que `Pragma: no-cache` ; d'autres utilisations de cet en-tête sont dépréciées.
ja: HTTP は `Pragma: no-cache` のみを定義しており、このヘッダーのその他の使用方法は非推奨です。
zh: HTTP 仅定义 `Pragma: no-cache`；此标头的其他用法已弃用。

source: The `Proxy-Authenticate` response header consists of a challenge that indicates the authentication scheme and parameters applicable to the proxy for this request-target.
es: La cabecera de respuesta `Proxy-Authenticate` consiste en un desafío que indica el esquema de autenticación y los parámetros aplicables al proxy para este request-target.
ja: `Proxy-Authenticate` レスポンスヘッダーは、このリクエストターゲットに対するプロキシに適用される認証スキームとパラメータを示すチャレンジで構成されます。

source: The `Proxy-Authentication-Info` header field is used to communicate information after the client's authentication credentials have been accepted by a proxy.
es: El campo de encabezado `Proxy-Authentication-Info` se utiliza para comunicar información después de que las credenciales de autenticación del cliente hayan sido aceptadas por un proxy.
ja: `Proxy-Authentication-Info` ヘッダーフィールドは、プロキシがクライアントの認証情報を受け入れた後に、その情報を提供するために使用されます。

source: Information about intermediaries is available.
es: Hay información disponible sobre intermediarios.
fr: Des informations sur les intermédiaires sont disponibles.
ja: 中間業者に関する情報が利用可能です。
zh: 关于中介机构的信息是可用的。

source: The `Proxy-Status` header field indicates how intermediaries have handled the response. %(status)s
es: El campo de cabecera `Proxy-Status` indica cómo han manejado la respuesta los intermediarios. %(status)s
fr: L'en-tête `Proxy-Status` indique comment les intermédiaires ont traité la réponse. %(status)s
ja: `Proxy-Status` ヘッダーフィールドは、中間サーバーがレスポンスをどのように処理したかを示します。 %(status)s
zh: `Proxy-Status` 标头字段指示了中间服务器如何处理了响应。 %(status)s

source: The Proxy-Status header has an invalid structure.
es: La cabecera Proxy-Status tiene una estructura inválida.
fr: L'en-tête Proxy-Status a une structure invalide.
ja: Proxy-Status ヘッダーの構造が無効です。
zh: Proxy-Status 标头具有无效的结构。

source: The `Proxy-Status` header must be a list of members, where each member is a Token or String (identifying the proxy) with optional parameters.
es: La cabecera `Proxy-Status` debe ser una lista de miembros, donde cada miembro es un Token o String (identificando al proxy) con parámetros opcionales.
fr: L'en-tête `Proxy-Status` doit être une liste de membres, où chaque membre est un Token ou une String (identifiant le proxy) avec des paramètres optionnels.
ja: `Proxy-Status` ヘッダーは、トークンまたは文字列（プロキシを識別する）とオプションのパラメータで構成されるメンバーのリストである必要があります。
zh: `Proxy-Status` 头部必须是一个成员列表，其中每个成员是一个 Token 或 String（用于标识代理），并带有可选的参数。

source: The Proxy-Status header has an unknown parameter '%(param)s'.
es: La cabecera Proxy-Status tiene un parámetro desconocido '%(param)s'.
fr: L'en-tête Proxy-Status a un paramètre inconnu '%(param)s'.
ja: Proxy-Status ヘッダーに不明なパラメーター '%(param)s' があります。
zh: Proxy-Status 标头有一个未知的参数 '%(param)s'。

source: The `%(param)s` parameter is not defined in the Proxy-Status specification.
es: El parámetro `%(param)s` no está definido en la especificación Proxy-Status.
fr: Le paramètre `%(param)s` n'est pas défini dans la spécification Proxy-Status.
ja: `%(param)s` パラメータは Proxy-Status 仕様で定義されていません。
zh: `%(param)s` 参数在 Proxy-Status 规范中未定义。
