Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: The `Content-Range` header is missing a range unit at the start; it should almost always be `bytes`. For example: Content-Range: bytes 1-100/200
es: La cabecera `Content-Range` carece de la unidad de rango al principio; debería ser `bytes` casi siempre. Por ejemplo: Content-Range: bytes 1-100/200
fr: La `Content-Range` est manquante d'unité de plage au début ; il devrait presque toujours être `octets`. Par exemple : Content-Range: octets 1-100/200

source: The Content-Range header invalidly uses wildcards.
es: La cabecera Content-Range usa de forma inválida caracteres comodín.
fr: La requête contient des caractères non ASCII.

source: The `Content-Range` header cannot use a wildcard (`*`) for both the range and the complete length.
es: El encabezado `Content-Range` no puede utilizar un carácter comodín (`*`) para ambas la gama y la longitud completa.
fr: La tête `Content-Range` ne peut pas utiliser un jeton générique (`*`) pour la plage et la longueur complète.

source: The Content-Range header is missing a slash separator.
es: El encabezado Content-Range falta el separador de barra.
fr: Le en-tête Content-Range manque d'un séparateur slash.

source: The `Content-Range` header is missing a slash (`/`) separating the range from the complete length. For example: Content-Range: bytes 1-100/200
es: La cabecera `Content-Range` falta el slash (`/`) separando el rango de la longitud completa. Por ejemplo: Content-Range: bytes 1-100/200
fr: La tête `Content-Range` manque d'une barre oblique (`/`) séparant la plage de la longueur complète.

source: The Content-Range header is missing a hyphen.
es: El encabezado Content-Range falta un guión.
fr: La tête Content-Range manque d'un tiret.

source: The range specifier `%(value)s` is missing a hyphen separating the start and end positions.
es: El especificador de rango `'%(value)s'` carece de un guión que separa las posiciones de inicio y fin.
fr: Le spécificateur de plage « %(value)s » manque d'un tiret séparant les positions de début et de fin.

source: The Content-Range header contains a non-integer value.
es: El encabezado Content-Range contiene un valor no entero.
fr: L'en-tête Content-Range contient une valeur non entière.

source: The value `%(value)s` is not a valid integer.
es: El valor `%(value)s` no es un entero válido.
fr: La valeur `%(value)s` n'est pas un entier valide.

source: The Content-Range header is invalid.
es: El encabezado Content-Range es inválido.
fr: Le en-tête Content-Range est invalide.

source: The values indicated by the `Content-Range` header are not valid. The first position must be less than or equal to the last position, and the last position must be less than the complete length.
es: Los valores indicados en el encabezado `Content-Range` no son válidos. La primera posición debe ser menor o igual que la última posición, y la última posición debe ser menor que la longitud completa.
fr: Les valeurs indiquées par l'en-tête `Content-Range` ne sont pas valides. La première position doit être inférieure ou égale à la dernière position, et la dernière position doit être inférieure à la longueur complète.

source: The Content-Range header indicates an unsatisfied range, but the status code is 206.
es: El encabezado Content-Range indica un rango no satisfecho, pero el código de estado es 206.
fr: La requête a réussi, mais une partie de la requête n'a pas été satisfaite.

source: The `Content-Range` header uses the `*/<length>` syntax, which is reserved for `416` (Requested Range Not Satisfiable) responses to indicate the actual length of the resource. The `206` response status code indicates a successful range response, so this header is incorrect.
es: El encabezado `Content-Range` utiliza la sintaxis `*/<length>`, que está reservada para las respuestas `416` (Rango solicitado no satisfactoria) para indicar la longitud real del recurso. El código de estado de respuesta `206` indica una respuesta de rango exitosa, por lo que este encabezado es incorrecto.
fr: La tête `Content-Range` utilise la syntaxe `*/<length>`, qui est réservée pour les réponses `416` (Plage de requête non satisfaisable) pour indiquer la longueur effective de la ressource. Le code d'état de réponse `206` indique une réponse de plage réussie, donc cette tête est incorrecte.

source: The Content-Range header indicates an unknown total length.
es: El encabezado Content-Range indica una longitud total desconocida.
fr: Le en-tête Content-Range indique une longueur totale inconnue.

source: The `Content-Range` header uses `*` for the instance length, indicating that the total length of the resource is unknown.
es: La cabecera `Content-Range` utiliza `*` para la longitud de instancia, lo que indica que la longitud total del recurso es desconocida.
fr: La requête est trop longue, elle dépasse la limite de 2048 caractères.

source: The `Content-Security-Policy` response header allows web site administrators to declare approved sources of content that browsers are allowed to load on a page.
es: La cabecera de respuesta `Content-Security-Policy` permite a los administradores de sitios web declarar fuentes de contenido aprobadas que los navegadores pueden cargar en una página.
ja: `Content-Security-Policy` レスポンスヘッダーは、ウェブサイト管理者がブラウザがページで読み込むことを許可するコンテンツの承認済みソースを宣言できるようにします。

source: This response sets a Content Security Policy%(report_only)s.
es: Esta respuesta establece una Política de Seguridad de Contenido%(report_only)s.
fr: Cette réponse définit une Content Security Policy%(report_only)s.
ja: このレスポンスはContent Security Policy%(report_only)s を設定しています。
zh: 此响应设置了内容安全策略%(report_only)s。

source: [Content Security Policy](https://www.w3.org/TR/CSP3/) allows the server to declare the sources of content that browsers are allowed to use on a page.%(report_only_text)s
es: [Content Security Policy](https://www.w3.org/TR/CSP3/) permite al servidor declarar las fuentes de contenido que los navegadores pueden utilizar en una página.%(report_only_text)s
fr: [Content Security Policy](https://www.w3.org/TR/CSP3/) permet au serveur de déclarer les sources de contenu que les navigateurs sont autorisés à utiliser sur une page.%(report_only_text)s
ja: [Content Security Policy](https://www.w3.org/TR/CSP3/) は、ブラウザがページで使用することを許可されるコンテンツのソースをサーバーが宣言できるようにします。%(report_only_text)s
zh: [内容安全策略](https://www.w3.org/TR/CSP3/) 允许服务器声明浏览器允许在页面上使用的内容的来源。%(report_only_text)s

source: Inline scripts are allowed.
es: Se permiten scripts en línea.
fr: Les scripts en ligne sont autorisés.
ja: インラインスクリプトは許可されています。
zh: 内联脚本是允许的。

source: The `'unsafe-inline'` [Content Security Policy](https://www.w3.org/TR/CSP3/) directive allows the execution of inline scripts and event handlers, which significantly reduces the protection provided by CSP against Cross-Site Scripting (XSS) attacks. It was found in the following directives: %(directives_list)s
es: La directiva `'unsafe-inline'` de la [Política de Seguridad de Contenidos](https://www.w3.org/TR/CSP3/) permite la ejecución de scripts y manejadores de eventos en línea, lo que reduce significativamente la protección proporcionada por CSP contra ataques de Cross-Site Scripting (XSS). Se encontró en las siguientes directivas: %(directives_list)s
fr: La directive `'unsafe-inline'` [Content Security Policy](https://www.w3.org/TR/CSP3/) permet l'exécution de scripts en ligne et de gestionnaires d'événements, ce qui réduit considérablement la protection fournie par CSP contre les attaques par script intersite (XSS). Elle a été trouvée dans les directives suivantes : %(directives_list)s
ja: `'unsafe-inline'` [Content Security Policy](https://www.w3.org/TR/CSP3/) ディレクティブは、インラインスクリプトとイベントハンドラーの実行を許可します。これは、クロスサイトスクリプティング（XSS）攻撃に対するCSPが提供する保護を大幅に低下させます。 以下のディレクティブで見つかりました。 %(directives_list)s
zh: `'unsafe-inline'` [内容安全策略](https://www.w3.org/TR/CSP3/) 指令允许执行内联脚本和事件处理程序，这会大大削弱 CSP 对跨站脚本 (XSS) 攻击的防护能力。 在以下指令中发现： %(directives_list)s

source: Unsafe script evaluation is allowed.
es: La evaluación de scripts no segura está permitida.
fr: L'évaluation de script non sécurisée est autorisée.
ja: 安全でないスクリプト評価が許可されています。
zh: 允许不安全的脚本评估。

source: The `'unsafe-eval'` [Content Security Policy](https://www.w3.org/TR/CSP3/) directive allows the use of string-to-code mechanisms like `eval()`, which can make it easier for attackers to execute malicious code. It was found in the following directives: %(directives_list)s
es: La directiva `'unsafe-eval'` de [Content Security Policy](https://www.w3.org/TR/CSP3/) permite el uso de mecanismos de cadena a código como `eval()`, lo que puede facilitar que los atacantes ejecuten código malicioso. Se encontró en las siguientes directivas: %(directives_list)s
fr: La directive `'unsafe-eval'` [Content Security Policy](https://www.w3.org/TR/CSP3/) permet l'utilisation de mécanismes de conversion de chaînes en code comme `eval()`, ce qui peut faciliter l'exécution de code malveillant par des attaquants. Elle a été trouvée dans les directives suivantes : %(directives_list)s
ja: `'unsafe-eval'` [Content Security Policy](https://www.w3.org/TR/CSP3/) ディレクティブは、`eval()` のような文字列からコードへの変換メカニズムの使用を許可しますが、これは攻撃者が悪意のあるコードを実行するのを容易にする可能性があります。 以下のディレクティブで見つかりました： %(directives_list)s
zh: `'unsafe-eval'` [Content Security Policy](https://www.w3.org/TR/CSP3/) 指令允许使用字符串到代码的机制（例如 `eval()`），这可能使攻击者更容易执行恶意代码。 在以下指令中发现： %(directives_list)s

source: Loading from insecure HTTP sources is allowed.
es: Se permite la carga desde fuentes HTTP inseguras.
fr: Le chargement à partir de sources HTTP non sécurisées est autorisé.
ja: 安全でないHTTPソースからの読み込みが許可されています。
zh: 允许从不安全的 HTTP 源加载。

source: Allowing `http:` sources in `%(field_name)s` can allow attackers to intercept and modify content loaded by the page, potentially bypassing security controls. It was found in the following directives: %(directives_list)s
es: Permitir fuentes `http:` en `%(field_name)s` puede permitir a los atacantes interceptar y modificar el contenido cargado por la página, eludiendo potencialmente los controles de seguridad. Se encontró en las siguientes directivas: %(directives_list)s
fr: L'autorisation de sources `http:` dans `%(field_name)s` peut permettre aux attaquants d'intercepter et de modifier le contenu chargé par la page, contournant ainsi potentiellement les contrôles de sécurité. Il a été trouvé dans les directives suivantes : %(directives_list)s
ja: `%(field_name)s` で `http:` ソースを許可すると、攻撃者がページで読み込まれるコンテンツを傍受および変更できるようになり、セキュリティ制御を回避できる可能性があります。 以下のディレクティブで見つかりました: %(directives_list)s
zh: 在 `%(field_name)s` 中允许 `http:` 源，可能使攻击者能够拦截和修改页面加载的内容，从而绕过安全控制。 在以下指令中发现了此问题： %(directives_list)s

source: Duplicate directives are present.
es: Se encuentran directivas duplicadas.
fr: Des directives en double sont présentes.
ja: 重複したディレクティブが存在します。
zh: 重复的指令存在。

source: Directives must only appear once in the `%(field_name)s` header; subsequent occurrences are ignored. The following directives were duplicated: %(directives_list)s
es: Las directivas solo deben aparecer una vez en la cabecera `%(field_name)s`; las ocurrencias subsiguientes se ignoran. Las siguientes directivas se duplicaron: %(directives_list)s
fr: Les directives ne doivent apparaître qu'une seule fois dans l'en-tête `%(field_name)s` ; les occurrences ultérieures sont ignorées. Les directives suivantes étaient dupliquées : %(directives_list)s
ja: `%(field_name)s` ヘッダーにはディレクティブは一度だけ出現する必要があります。それ以降の出現は無視されます。 以下のディレクティブが重複していました： %(directives_list)s
zh: 指令在 `%(field_name)s` 标头中只能出现一次；后续的出现将被忽略。 以下指令已重复： %(directives_list)s

source: The deprecated report-uri directive is used.
es: Se usa la directiva report-uri obsoleta.
fr: La directive obsolète report-uri est utilisée.
ja: 非推奨の report-uri ディレクティブが使用されています。
zh: 已使用已弃用的 report-uri 指令。

source: The `report-uri` [Content Security Policy](https://www.w3.org/TR/CSP3/) directive is deprecated in favor of `report-to`. It is recommended to use `report-to` for reporting violations, although `report-uri` may still be supported for backward compatibility.
es: La directiva `report-uri` de [Content Security Policy](https://www.w3.org/TR/CSP3/) está obsoleta en favor de `report-to`. Se recomienda usar `report-to` para informar sobre violaciones, aunque `report-uri` todavía puede ser compatible por compatibilidad retroactiva.
fr: La directive `report-uri` [Content Security Policy](https://www.w3.org/TR/CSP3/) est dépréciée au profit de `report-to`. Il est recommandé d'utiliser `report-to` pour signaler les violations, bien que `report-uri` puisse encore être pris en charge pour des raisons de compatibilité ascendante.
ja: `report-uri` [Content Security Policy](https://www.w3.org/TR/CSP3/) ディレクティブは `report-to` に置き換えられ、非推奨になりました。違反の報告には `report-to` の使用が推奨されますが、後方互換性のために `report-uri` が引き続きサポートされる場合もあります。
zh: `report-uri` [Content Security Policy](https://www.w3.org/TR/CSP3/) 指令已弃用，推荐使用 `report-to`。建议使用 `report-to` 来报告违规，但 `report-uri` 可能仍出于向后兼容性而受支持。

source: All sources are allowed in one or more directives.
es: Se permiten todas las fuentes en una o más directivas.
fr: Toutes les sources sont autorisées dans une ou plusieurs directives.
ja: すべてのソースは、1つ以上のディレクティブで許可されます。
zh: 所有来源都允许在一条或多条指令中。

source: The `*` [Content Security Policy](https://www.w3.org/TR/CSP3/) directive allows resources to be loaded from any origin, which significantly reduces the protection provided by CSP.%(report_only_text)s It was found in the following directives: %(directives_list)s
es: La directiva `*` de [Content Security Policy](https://www.w3.org/TR/CSP3/) permite cargar recursos desde cualquier origen, lo que reduce significativamente la protección proporcionada por CSP.%(report_only_text)s Se encontró en las siguientes directivas: %(directives_list)s
fr: La directive `*` [Content Security Policy](https://www.w3.org/TR/CSP3/) permet de charger des ressources depuis n'importe quelle origine, ce qui réduit considérablement la protection fournie par CSP.%(report_only_text)s Elle a été trouvée dans les directives suivantes : %(directives_list)s
ja: `*` [Content Security Policy](https://www.w3.org/TR/CSP3/) ディレクティブにより、あらゆるオリジンからリソースを読み込むことができるため、CSP によって提供される保護が大幅に低下します。%(report_only_text)s 以下のディレクティブで見つかりました。 %(directives_list)s
zh: `*` [内容安全策略](https://www.w3.org/TR/CSP3/) 指令允许从任何来源加载资源，这大大降低了 CSP 提供的保护。%(report_only_text)s 在以下指令中发现： %(directives_list)s

source: The report-to endpoint '%(endpoint)s' is not defined.
es: El punto final 'report-to' '%(endpoint)s' no está definido.
fr: Le point de terminaison 'report-to' '%(endpoint)s' n'est pas défini.

source: The `report-to` directive [Content Security Policy](https://www.w3.org/TR/CSP3/) specifies a reporting endpoint, but no matching endpoint refers to it in the `Reporting-Endpoints` header.%(report_only_text)s
es: La directiva `report-to` [Política de Seguridad de Contenido](https://www.w3.org/TR/CSP3/) especifica un punto final de reporte, pero ningún punto final coincidente se refiere a él en el encabezado `Reporting-Endpoints`.%(report_only_text)s
fr: La directive `report-to` [Politique de sécurité du contenu](https://www.w3.org/TR/CSP3/) spécifie un point de terminaison de rapport, mais aucun point de terminaison correspondant ne fait référence à celui-ci dans l'en-tête `Reporting-Endpoints`.%(report_only_text)s à celui-ci dans l'en-tête `Reporting-Endpoints`.

source: This response requires resources to have a CORP header%(report_only)s.
es: Esta respuesta requiere que los recursos tengan una cabecera CORP%(report_only)s.
fr: Cette réponse nécessite que les ressources aient un en-tête CORP%(report_only)s.
ja: このレスポンスには、CORP ヘッダーを持つリソースが必要です%(report_only)s。
zh: 此响应要求资源具有 CORP 标头%(report_only)s。

source: The `require-corp` [Cross Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) requires that all cross-origin resources must explicitly grant permission to be loaded via a `Cross-Origin-Resource-Policy` header, in supporting browsers.%(report_only_text)s
es: La política `require-corp` [Cross Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) requiere que todos los recursos de origen cruzado otorguen explícitamente permiso para ser cargados a través de una cabecera `Cross-Origin-Resource-Policy`, en navegadores compatibles.%(report_only_text)s
fr: La politique `require-corp` de [Cross Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) exige que toutes les ressources inter-origines accordent explicitement l'autorisation d'être chargées via un en-tête `Cross-Origin-Resource-Policy`, dans les navigateurs compatibles.%(report_only_text)s
ja: `require-corp` [Cross Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) により、サポートされているブラウザでは、すべてのクロスオリジンリソースが `Cross-Origin-Resource-Policy` ヘッダーを介して明示的に読み込み権限を付与する必要があります。%(report_only_text)s
zh: `require-corp` [Cross Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) 要求在支持的浏览器中，所有跨域资源都必须通过 `Cross-Origin-Resource-Policy` 头部明确授予加载权限。%(report_only_text)s

source: This response loads cross-origin resources without credentials%(report_only)s.
es: Esta respuesta carga recursos cross-origin sin credenciales%(report_only)s.
fr: Cette réponse charge des ressources inter-origines sans informations d'identification%(report_only)s.
ja: このレスポンスは、認証情報なしでクロスオリジンリソースを読み込みます%(report_only)s。
zh: 此响应在未携带凭证的情况下加载跨域资源%(report_only)s。

source: The `credentialless` [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) allows loading cross-origin resources without explicit permission in supporting browsers, but requests for them will not include credentials (cookies, client certificates, etc.).%(report_only_text)s
es: La política `credentialless` de [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) permite cargar recursos de origen cruzado sin permiso explícito en navegadores compatibles, pero las solicitudes para ellos no incluirán credenciales (cookies, certificados de cliente, etc.).%(report_only_text)s
fr: La politique `credentialless` [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) permet de charger des ressources inter-origines sans permission explicite dans les navigateurs compatibles, mais les requêtes pour celles-ci n'incluront pas les identifiants (cookies, certificats client, etc.).%(report_only_text)s
ja: `credentialless` [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) は、対応ブラウザで明示的な許可なしにクロスオリジンリソースを読み込むことを許可しますが、それらのリソースに対するリクエストには認証情報（Cookie、クライアント証明書など）は含まれません。%(report_only_text)s
zh: `credentialless` [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) 允许在支持的浏览器中加载跨源资源，而无需显式权限，但对它们的请求不包含凭据（Cookie、客户端证书等）。%(report_only_text)s

source: This response allows loading cross-origin resources without restriction%(report_only)s.
es: Esta respuesta permite cargar recursos de origen cruzado sin restricción%(report_only)s.
fr: Cette réponse permet le chargement sans restriction de ressources inter-origines%(report_only)s.
ja: このレスポンスは、クロスオリジンリソースの読み込みを無制限に許可します%(report_only)s。
zh: 此响应允许无限制地加载跨域资源%(report_only)s。

source: The `unsafe-none` [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) is the default behavior, allowing cross-origin resources to be loaded without explicit permission in supporting browsers. This does not provide cross-origin isolation.%(report_only_text)s
es: El `unsafe-none` [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) es el comportamiento predeterminado, permitiendo que los recursos de origen cruzado se carguen sin permiso explícito en navegadores compatibles. Esto no proporciona aislamiento de origen cruzado.%(report_only_text)s
fr: Le `unsafe-none` [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) est le comportement par défaut, autorisant le chargement de ressources inter-origines sans permission explicite dans les navigateurs compatibles. Cela ne fournit pas d'isolation inter-origines.%(report_only_text)s
ja: `unsafe-none` [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) はデフォルトの動作であり、サポートしているブラウザでは明示的な許可なしにオリジン外のリソースを読み込むことができます。 これにより、オリジン外からの分離は提供されません。%(report_only_text)s
zh: `unsafe-none` [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) 是默认行为，允许在支持的浏览器中加载跨源资源 而无需显式权限。 这不提供跨源隔离。%(report_only_text)s

source: This response's %(field_name)s has an invalid value.
es: El campo %(field_name)s de esta respuesta tiene un valor inválido.
fr: Le %(field_name)s de cette réponse contient une valeur invalide.
ja: このレスポンスの%(field_name)sには無効な値が含まれています。
zh: 此响应的 %(field_name)s 具有无效值。

source: The `%(field_name)s` header must be one of `require-corp`, `credentialless`, or `unsafe-none`.
es: El encabezado `%(field_name)s` debe ser uno de `require-corp`, `credentialless` o `unsafe-none`.
fr: L'en-tête `%(field_name)s` doit être l'une des valeurs suivantes : `require-corp`, `credentialless` ou `unsafe-none`.
ja: `%(field_name)s` ヘッダーは、`require-corp`、`credentialless`、または `unsafe-none` のいずれかでなければなりません。
zh: `%(field_name)s` 标头必须是 `require-corp`、`credentialless` 或 `unsafe-none` 之一。

source: The report-to endpoint '%(endpoint)s' is not defined%(report_only)s.
es: El punto final 'report-to' '%(endpoint)s' no está definido.%(report_only)s.
fr: Le point de terminaison « report-to » '%(endpoint)s' n'est pas défini%(report_only)s.

source: The `report-to` parameter in the [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) header specifies a reporting endpoint, but no matching endpoint refers to it in the `Reporting-Endpoints` header.
es: El parámetro `report-to` en el encabezado [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) especifica un punto final de informe, pero ningún punto final coincidente hace referencia a él en el encabezado `Reporting-Endpoints`.
fr: Le paramètre `report-to` dans l'en-tête [Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header) spécifie un point de terminaison de rapport, mais aucun point de terminaison correspondant ne fait référence à celui-ci dans l'en-tête `Reporting-Endpoints`.

source: This response has both enforcing and report-only COEP headers.
es: Esta respuesta tiene encabezados COEP de aplicación forzosa y solo de informe.
fr: Cette réponse a à la fois des en-têtes COEP d'application et de rapport d'erreurs.
ja: このレスポンスには、強制モードとレポートオンリーモードの両方の COEP ヘッダーが含まれています。
zh: 此响应同时具有强制和仅报告的 COEP 标头。

source: A response should not have both `Cross-Origin-Embedder-Policy` and `Cross-Origin-Embedder-Policy-Report-Only` headers. The report-only header will be ignored.
es: Una respuesta no debe tener las cabeceras `Cross-Origin-Embedder-Policy` y `Cross-Origin-Embedder-Policy-Report-Only` al mismo tiempo. La cabecera report-only será ignorada.
fr: Une réponse ne doit pas avoir à la fois les en-têtes `Cross-Origin-Embedder-Policy` et `Cross-Origin-Embedder-Policy-Report-Only`. L'en-tête report-only sera ignoré.
ja: `Cross-Origin-Embedder-Policy` ヘッダーと `Cross-Origin-Embedder-Policy-Report-Only` ヘッダーの両方をレスポンスに含めるべきではありません。レポート専用ヘッダーは無視されます。
zh: 响应不应同时包含 `Cross-Origin-Embedder-Policy` 和 `Cross-Origin-Embedder-Policy-Report-Only` 标头。report-only 标头将被忽略。
