Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: This response doesn't have a Date header.
es: Esta respuesta no tiene una cabecera Date.
fr: Cette réponse n'a pas de Date header.
ja: このレスポンスにはDateヘッダーがありません。
zh: 此响应缺少 Date 标头。

source: Although HTTP allows a server not to send a `Date` header in responses if it doesn't have a local clock, this can make calculation of a stored response's age inexact.
es: Aunque HTTP permite que un servidor no envíe una cabecera `Date` en las respuestas si no tiene un reloj local, esto puede hacer que el cálculo de la antigüedad de una respuesta almacenada sea inexacto.
fr: Bien que HTTP permette à un serveur de ne pas envoyer un en-tête `Date` dans les réponses s'il ne dispose pas d'une horloge locale, cela peut rendre le calcul de l'âge d'une réponse stockée inexact.
ja: HTTPは、サーバーがローカルクロックを持っていない場合にレスポンスで`Date`ヘッダーを送信しないことを許可していますが、これにより保存されたレスポンスの経過時間を不正確に計算する可能性があります。
zh: 尽管 HTTP 允许服务器在没有本地时钟的情况下不发送 `Date` 头部，但这可能导致存储响应年龄的计算不准确。

source: This response has an Expires or Last-Modified header, but no Date.
es: Esta respuesta tiene una cabecera Expires o Last-Modified, pero no Date.
fr: Cette réponse comporte un en-tête Expires ou Last-Modified, mais pas de Date.
ja: このレスポンスにはExpires または Last-Modified ヘッダーがありますが、Date ヘッダーがありません。
zh: 此响应具有 Expires 或 Last-Modified 标头，但缺少 Date 标头。

source: Because both the `Expires` and `Last-Modified` headers are date-based, it's necessary to send when the message was generated in `Date` for them to be useful; otherwise, clock drift, transit times between nodes as well as caching could skew their application.
es: Dado que tanto las cabeceras `Expires` como `Last-Modified` se basan en fechas, es necesario enviar la fecha de generación del mensaje en `Date` para que sean útiles; de lo contrario, la deriva del reloj, los tiempos de tránsito entre nodos, así como el almacenamiento en caché, podrían sesgar su aplicación.
fr: Étant donné que les en-têtes `Expires` et `Last-Modified` sont basés sur des dates, il est nécessaire d'indiquer la date de génération du message dans l'en-tête `Date` pour qu'ils soient utiles ; sinon, la dérive d'horloge, les temps de transit entre les nœuds ainsi que la mise en cache pourraient fausser leur application.
ja: `Expires` および `Last-Modified` ヘッダーはどちらも日付ベースであるため、それらが有用であるためには `Date` ヘッダーでメッセージが生成された時刻を送信する必要があります。そうしないと、クロックドリフト、ノード間の転送時間、キャッシュなどがそれらを歪める可能性があります。
zh: 由于 `Expires` 和 `Last-Modified` 报头都是基于日期的，因此有必要发送生成消息的 `Date` 时间，以使它们有用；否则，时钟漂移、节点之间的传输时间以及缓存可能会导致其应用出现偏差。

source: Responses to the %(method)s method can't be stored by caches.
es: Las respuestas al método %(method)s no pueden ser almacenadas por las cachés.
fr: Les réponses à la méthode %(method)s ne peuvent pas être mises en cache.
ja: %(method)s メソッドへの応答は、キャッシュに保存できません。
zh: 缓存无法存储对 %(method)s 方法的响应。

source: This response can't be stored by caches.
es: Esta respuesta no puede ser almacenada por cachés.
fr: Cette réponse ne peut pas être stockée par les caches.
ja: このレスポンスはキャッシュに保存できません。
zh: 此响应无法被缓存存储。

source: The `Cache-Control: no-store` directive indicates that this response can't be stored by a cache.
es: La directiva `Cache-Control: no-store` indica que esta respuesta no puede ser almacenada por una caché.
fr: La directive `Cache-Control: no-store` indique que cette réponse ne peut pas être stockée par un cache.
ja: `Cache-Control: no-store` ディレクティブは、このレスポンスがキャッシュに保存できないことを示します。
zh: `Cache-Control: no-store` 指令表示此响应无法被缓存存储。

source: This response allows only private caches to store it.
es: Esta respuesta solo permite que las cachés privadas la almacenen.
fr: Cette réponse autorise uniquement les caches privés à la stocker.
ja: このレスポンスは、プライベートキャッシュのみが保存できます。
zh: 此响应仅允许私有缓存存储。

source: The `Cache-Control: private` directive indicates that the response can only be stored by caches that are specific to a single user; for example, a browser cache. Shared caches, such as those in proxies, cannot store it.
es: La directiva `Cache-Control: private` indica que la respuesta solo puede ser almacenada por cachés que son específicos de un solo usuario; por ejemplo, la caché del navegador. Los cachés compartidos, como los de los proxies, no pueden almacenarla.
fr: La directive `Cache-Control: private` indique que la réponse ne peut être stockée que par des caches spécifiques à un seul utilisateur ; par exemple, un cache de navigateur. Les caches partagés, tels que ceux des proxys, ne peuvent pas le stocker.
ja: `Cache-Control: private` ディレクティブは、レスポンスが単一ユーザー固有のキャッシュでのみ保存可能であることを示します。例えば、ブラウザキャッシュなどです。プロキシ内のキャッシュなどの共有キャッシュは、これを保存できません。
zh: `Cache-Control: private` 指令表明响应只能由特定于单个用户的缓存存储；例如，浏览器缓存。共享缓存（例如代理中的缓存）则不能存储它。

source: This response contains both the `public` and `private` Cache-Control directives.
es: Esta respuesta contiene tanto las directivas `public` como `private` de Cache-Control.
fr: Cette réponse contient à la fois les directives Cache-Control `public` et `private`.
ja: このレスポンスには `public` と `private` の両方の Cache-Control ディレクティブが含まれています。
zh: 此响应同时包含 `public` 和 `private` Cache-Control 指令。

source: `Cache-Control: public` and `Cache-Control: private` conflict; they should not occur on the same message. Conservative caches will ignore `public` and honor `private`, but this cannot be relied upon.
es: `Cache-Control: public` y `Cache-Control: private` entran en conflicto; no deberían ocurrir en el mismo mensaje. Las cachés conservadoras ignorarán `public` y respetarán `private`, pero no se puede confiar en esto.
fr: `Cache-Control: public` et `Cache-Control: private` sont en conflit ; ils ne devraient pas apparaître sur le même message. Les caches conservateurs ignoreront `public` et respecteront `private`, mais on ne peut pas s'y fier.
ja: `Cache-Control: public` と `Cache-Control: private` は競合します。同じメッセージに含めるべきではありません。 保守的なキャッシュは `public` を無視して `private` を優先しますが、これは信頼できません。
zh: `Cache-Control: public` 和 `Cache-Control: private` 冲突；它们不应出现在同一消息中。 保守的缓存会忽略 `public` 并遵守 `private`，但不能依赖这种行为。

source: This response can only be stored by private caches, because the request was authenticated.
es: Esta respuesta solo puede ser almacenada por cachés privados, porque la solicitud fue autenticada.
fr: Cette réponse ne peut être stockée que par des caches privés, car la requête a été authentifiée.
ja: このレスポンスは、リクエストが認証されたため、プライベートキャッシュのみに保存できます。
zh: 此响应只能由私有缓存存储，因为请求已通过身份验证。

source: Because the request was authenticated and this response doesn't contain a `Cache-Control: public` directive, this response can only be stored by caches that are specific to a single user; for example, a browser cache. Shared caches, such as those in proxies, cannot store it.
es: Debido a que la solicitud fue autenticada y esta respuesta no contiene la directiva `Cache-Control: public`, esta respuesta solo puede ser almacenada por cachés que son específicos para un solo usuario; por ejemplo, la caché de un navegador. Las cachés compartidas, como las de los proxies, no pueden almacenarla.
fr: Parce que la requête a été authentifiée et que cette réponse ne contient pas de directive `Cache-Control: public`, cette réponse ne peut être stockée que par des caches spécifiques à un seul utilisateur ; par exemple, un cache de navigateur. Les caches partagés, comme ceux des proxys, ne peuvent pas la stocker.
ja: リクエストは認証済みであり、このレスポンスに `Cache-Control: public` ディレクティブが含まれていないため、このレスポンスは単一ユーザー専用のキャッシュ（例: ブラウザキャッシュ）にのみ保存できます。プロキシなどの共有キャッシュには保存できません。
zh: 由于请求已通过身份验证，且此响应不包含 `Cache-Control: public` 指令，因此此响应只能由特定于单个用户的缓存存储；例如，浏览器缓存。共享缓存，如代理中的缓存，则无法存储它。

source: This response can be stored by all caches, even though the request was authenticated.
es: Esta respuesta puede ser almacenada por todas las cachés, aunque la solicitud fue autenticada.
fr: Cette réponse peut être stockée par tous les caches, même si la requête a été authentifiée.
ja: このレスポンスは、リクエストが認証済みであっても、すべてのキャッシュによって格納できます。
zh: 此响应可以被所有缓存存储，即使请求已通过身份验证。

source: Usually, responses to authenticated requests can't be stored by shared caches. However, because This response contains a `Cache-Control: %(directive)s` directive, it can be stored by all caches, including shared caches (like those in proxies).
es: Por lo general, las respuestas a solicitudes autenticadas no pueden ser almacenadas por cachés compartidos. Sin embargo, debido a que esta respuesta contiene la directiva `Cache-Control: %(directive)s`, puede ser almacenada por todas las cachés, incluyendo las cachés compartidas (como las de los proxies).
fr: Habituellement, les réponses aux requêtes authentifiées ne peuvent pas être stockées par les caches partagés. Cependant, parce que cette réponse contient une directive `Cache-Control: %(directive)s`, elle peut être stockée par tous les caches, y compris les caches partagés (tels que ceux des proxies).
ja: 通常、認証済みリクエストへの応答は共有キャッシュに保存できません。しかし、この応答には `Cache-Control: %(directive)s` ディレクティブが含まれているため、プロキシなどの共有キャッシュを含むすべてのキャッシュに保存できます。
zh: 通常，对已认证请求的响应不能被共享缓存存储。然而，因为此响应包含一个`Cache-Control: %(directive)s`指令，所以它可以被所有缓存存储，包括共享缓存（如代理中的缓存）。

source: Cache-Control: public is probably not necessary.
es: Cache-Control: public probablemente no sea necesario.
fr: Cache-Control: public n'est probablement pas nécessaire.
ja: Cache-Control: public はおそらく不要です。
zh: Cache-Control: public 可能不是必需的。

source: The `Cache-Control: public` directive allows caches to store and use responses in some circumstances when they would otherwise not be able to. For example, it allows responses to authenticated requests to be stored by shared caches. Other responses **do not need to contain `public`**; it does not make the response "more cacheable", and only makes the response headers larger.
es: La directiva `Cache-Control: public` permite que las cachés almacenen y utilicen respuestas en algunas circunstancias en las que de otro modo no podrían hacerlo. Por ejemplo, permite que las respuestas a solicitudes autenticadas sean almacenadas por cachés compartidas. Otras respuestas **no necesitan contener `public`**; no hace que la respuesta sea "más almacenable en caché" y solo aumenta el tamaño de las cabeceras de la respuesta.
fr: La directive `Cache-Control: public` permet aux caches de stocker et d'utiliser les réponses dans certaines circonstances où ils ne seraient pas en mesure de le faire autrement. Par exemple, elle permet aux caches partagés de stocker les réponses aux requêtes authentifiées. Les autres réponses **n'ont pas besoin de contenir `public`** ; cela ne rend pas la réponse "plus cacheable", et augmente uniquement la taille des en-têtes de réponse.
ja: `Cache-Control: public` ディレクティブにより、通常はキャッシュできない場合でも、条件付きでレスポンスをキャッシュに保存して使用できるようになります。 例えば、認証されたリクエストに対するレスポンスを共有キャッシュに保存できるようになります。 その他のレスポンスでは `public` を含める**必要はありません**。レスポンスが「よりキャッシュしやすくなる」わけではなく、レスポンスヘッダーが大きくなるだけです。
zh: `Cache-Control: public` 指令允许缓存存储和使用响应，在某些情况下，即使它们在其他情况下无法做到。 例如，它允许共享缓存存储已认证请求的响应。 其他响应**不需要包含 `public`**；它不会使响应“更易于缓存”，只会使响应头更大。

source: This response allows all caches to store it.
es: Esta respuesta permite que todas las cachés la almacenen.
fr: Cette réponse permet à tous les caches de la stocker.
ja: このレスポンスは、すべてのキャッシュが保存することを許可しています。
zh: 此响应允许所有缓存对其进行存储。

source: A cache can store this response; it may or may not be able to use it to satisfy a particular request.
es: Una caché puede almacenar esta respuesta; puede que pueda o no utilizarla para satisfacer una solicitud concreta.
fr: Un cache peut stocker cette réponse ; il peut ou peut ne pas être en mesure de l'utiliser pour satisfaire une requête particulière.
ja: このレスポンスはキャッシュに保存できます。特定の要求を満たすために使用できる場合もあれば、そうでない場合もあります。
zh: 缓存可以存储此响应；它可能能够也可能不能用它来满足特定请求。

source: This response allows only shared caches to store it.
es: Esta respuesta solo permite que las cachés compartidas la almacenen.
fr: Cette réponse permet uniquement aux caches partagés de la stocker.
ja: このレスポンスは共有キャッシュのみに保存を許可します。
zh: 此响应仅允许共享缓存存储。

source: A shared cache can store this response; it may or may not be able to use it to satisfy a particular request. Private caches cannot store it, because there is no explicit freshness information (such as Cache-Control: max-age), and the status code is not heuristically cacheable. Note that a cache extension might override this behaviour.
es: Una caché compartida puede almacenar esta respuesta; puede o no poder usarla para satisfacer una solicitud particular. Las cachés privadas no pueden almacenarla, porque no hay información explícita de frescura (como Cache-Control: max-age), y el código de estado no es heurísticamente almacenable en caché. Tenga en cuenta que una extensión de caché podría anular este comportamiento.
fr: Un cache partagé peut stocker cette réponse ; il peut ou non être en mesure de l'utiliser pour satisfaire une requête particulière. Les caches privés ne peuvent pas la stocker, car il n'y a pas d'informations explicites sur la fraîcheur (telles que Cache-Control: max-age), et le code de statut n'est pas mis en cache de manière heuristique. Notez qu'une extension de cache pourrait annuler ce comportement.
ja: 共有キャッシュはこのレスポンスを保存できますが、特定の要求を満たすために使用できるかどうかは保証されません。 プライベートキャッシュは、明示的な鮮度情報（Cache-Control: max-ageなど）がなく、ステータスコードが推論でキャッシュ可能ではないため、これを保存できません。 キャッシュ拡張機能がこの動作を上書きする可能性があることに注意してください。
zh: 共享缓存可以存储此响应；它可能能够也可能不能使用它来满足特定请求。 私人缓存不能存储它，因为没有明确的新鲜度信息（如 Cache-Control: max-age），并且状态码不可启发式缓存。 请注意，缓存扩展可能会覆盖此行为。

source: This response cannot be stored by caches.
es: Esta respuesta no puede ser almacenada por cachés.
fr: Cette réponse ne peut pas être mise en cache par les caches.
ja: このレスポンスはキャッシュに保存できません。
zh: 此响应无法被缓存。

source: While caches can store many kinds of response as being heuristically cacheable -- that is, they can store them without explicit caching directives like Cache-Control:max-age, this reponse's status code is not defined as being heuristically cacheable, and other directives that would allow it to be stored (such as Cache-Control: public) are not present. Note that a cache extension might override this behaviour.
es: Si bien las cachés pueden almacenar muchos tipos de respuestas como siendo heurísticamente almacenables en caché (es decir, pueden almacenarlas sin directivas de caché explícitas como Cache-Control:max-age), el código de estado de esta respuesta no está definido como siendo heurísticamente almacenable en caché, y otras directivas que permitirían su almacenamiento (como Cache-Control: public) no están presentes. Tenga en cuenta que una extensión de caché podría anular este comportamiento.
fr: Bien que les caches puissent stocker de nombreux types de réponses comme étant cachables heuristiquement -- c'est-à-dire, qu'ils peuvent les stocker sans directives de mise en cache explicites comme Cache-Control:max-age, le code de statut de cette réponse n'est pas défini comme étant cachable heuristiquement, et d'autres directives qui permettraient de la stocker (telles que Cache-Control: public) ne sont pas présentes. Notez qu'une extension de cache pourrait outrepasser ce comportement.
ja: キャッシュは、Cache-Control:max-age のような明示的なキャッシュディレクティブなしで、ヒューリスティックにキャッシュ可能と見なされる多くの種類の応答を保存できますが、この応答のステータスコードはヒューリスティックにキャッシュ可能とは定義されておらず、保存を許可する他のディレクティブ (Cache-Control: public など) も存在しません。 キャッシュ拡張機能がこの動作を上書きする可能性があることに注意してください。
zh: 尽管缓存可以存储多种响应，这些响应被认为是启发式可缓存的——也就是说， 它们可以在没有明确缓存指令（如 Cache-Control: max-age）的情况下存储它们，但此 响应的状态码并未定义为启发式可缓存，并且不允许存储它的其他指令（如 Cache-Control: public） 也不存在。 请注意，缓存扩展可能会覆盖此行为。

source: This response cannot be served from cache without validation.
es: Esta respuesta no puede servirse desde la caché sin validación.
fr: Cette réponse ne peut pas être servie du cache sans validation.
ja: このレスポンスは、検証なしではキャッシュから提供できません。
zh: 此响应无法在不进行验证的情况下从缓存提供。

source: The `Cache-Control: no-cache` directive means that while caches can store this response, they cannot use it to satisfy a request unless it has been validated (either with an `If-None-Match` or `If-Modified-Since` conditional) for that request.
es: La directiva `Cache-Control: no-cache` significa que si bien las cachés pueden almacenar esta respuesta, no pueden usarla para satisfacer una solicitud a menos que haya sido validada (ya sea con una condicional `If-None-Match` o `If-Modified-Since`) para esa solicitud.
fr: La directive `Cache-Control: no-cache` signifie que bien que les caches puissent stocker cette réponse, ils ne peuvent pas l'utiliser pour satisfaire une requête, sauf si elle a été validée (soit avec une condition `If-None-Match` ou `If-Modified-Since`) pour cette requête.
ja: `Cache-Control: no-cache` ディレクティブは、キャッシュはこのレスポンスを保存できますが、そのレスポンスがリクエストに対して検証されない限り（`If-None-Match` または `If-Modified-Since` 条件付きリクエストによる）、リクエストを処理するために使用できないことを意味します。
zh: `Cache-Control: no-cache` 指令意味着缓存可以存储此响应，但除非已（使用 `If-None-Match` 或 `If-Modified-Since` 条件）对该请求进行过验证，否则不能用它来满足请求。

source: This response cannot be served from cache without validation, and doesn't have a validator.
es: Esta respuesta no se puede servir desde la caché sin validación y no tiene un validador.
fr: Cette réponse ne peut pas être servie du cache sans validation, et n'a pas de validateur.
ja: このレスポンスは検証なしではキャッシュから提供できません。また、バリデーターも含まれていません。
zh: 此响应无法在无需验证的情况下从缓存提供，并且没有验证器。

source: The `Cache-Control: no-cache` directive means that while caches can store this response, they cannot use it to satisfy a request unless it has been validated (either with an `If-None-Match` or `If-Modified-Since` conditional) for that request. This response doesn't have a `Last-Modified` or `ETag` header, so it effectively can't be used by a cache. `Cache-Control: no-store` is more appropriate.
es: La directiva `Cache-Control: no-cache` significa que, aunque las cachés pueden almacenar esta respuesta, no pueden usarla para satisfacer una solicitud a menos que haya sido validada (ya sea con una condicional `If-None-Match` o `If-Modified-Since`) para esa solicitud. Esta respuesta no tiene una cabecera `Last-Modified` o `ETag`, por lo que efectivamente no puede ser utilizada por una caché. `Cache-Control: no-store` es más apropiado.
fr: La directive `Cache-Control: no-cache` signifie que, bien que les caches puissent stocker cette réponse, ils ne peuvent pas l'utiliser pour satisfaire une requête à moins qu'elle n'ait été validée (soit avec une condition `If-None-Match` ou `If-Modified-Since`) pour cette requête. Cette réponse n'a pas d'en-tête `Last-Modified` ou `ETag`, elle ne peut donc pas être effectivement utilisée par un cache. `Cache-Control: no-store` est plus approprié.
ja: `Cache-Control: no-cache` ディレクティブは、キャッシュはこのレスポンスを保存できますが、リクエストを検証しない限り（そのリクエストに対して `If-None-Match` または `If-Modified-Since` 条件付きで）、リクエストを処理するために使用できないことを意味します。 このレスポンスには `Last-Modified` または `ETag` ヘッダーがないため、事実上キャッシュで使用することはできません。`Cache-Control: no-store` の方が適切です。
zh: `Cache-Control: no-cache` 指令意味着缓存可以存储此响应，但除非已通过（使用 `If-None-Match` 或 `If-Modified-Since` 条件）验证，否则不能将其用于满足请求。 此响应没有 `Last-Modified` 或 `ETag` 标头，因此缓存实际上无法使用它。`Cache-Control: no-store` 更合适。

source: This response has already been cached for %(age)s.
es: Esta respuesta ya ha sido cachead por %(age)s.
fr: Cette réponse a déjà été mise en cache depuis %(age)s.
ja: このレスポンスは%(age)s前からキャッシュされています。
zh: 此响应已缓存%(age)s。

source: HTTP defines an algorithm that uses the `Age` header, `Date` header, and local time observations to determine the age of a response. As a result, caches might use a value other than that in the `Age` header to determine how old the response is -- and therefore how much longer it can be used.
es: HTTP define un algoritmo que utiliza la cabecera `Age`, la cabecera `Date` y las observaciones de tiempo local para determinar la antigüedad de una respuesta. Como resultado, las cachés pueden usar un valor diferente al de la cabecera `Age` para determinar cuánta antigüedad tiene la respuesta y, por lo tanto, cuánto tiempo más se puede utilizar.
fr: HTTP définit un algorithme qui utilise l'en-tête `Age`, l'en-tête `Date` et des observations de l'heure locale pour déterminer l'âge d'une réponse. Par conséquent, les caches peuvent utiliser une valeur différente de celle de l'en-tête `Age` pour déterminer l'âge de la réponse -- et donc combien de temps encore elle peut être utilisée.
ja: HTTPは、`Age`ヘッダー、`Date`ヘッダー、およびローカル時間の観測値を使用して、レスポンスの経過時間を決定するアルゴリズムを定義しています。その結果、キャッシュは`Age`ヘッダーの値とは異なる値を使用して、レスポンスの経過時間、したがってあとどれくらい使用できるかを判断する場合があります。
zh: HTTP 定义了一种算法，它使用 `Age` 标头、`Date` 标头和本地时间观察来确定响应的年龄。因此，缓存可能使用 `Age` 标头之外的值来确定响应的旧程度——从而确定它还能使用多长时间。

source: This response is fresh for %(freshness_left)s.
es: Esta respuesta está fresca por %(freshness_left)s.
fr: Cette réponse est fraîche pendant %(freshness_left)s.
ja: このレスポンスは%(freshness_left)s間フレッシュです。
zh: 此响应在 %(freshness_left)s 后过期。

source: A response can be considered fresh when its age (here, %(current_age)s) is less than its freshness lifetime (in this case, %(freshness_lifetime)s).
es: Una respuesta puede considerarse fresca cuando su antigüedad (aquí, %(current_age)s) es menor que su vida útil de frescura (en este caso, %(freshness_lifetime)s).
fr: Une réponse peut être considérée comme fraîche lorsque son âge (ici, %(current_age)s) est inférieur à sa durée de vie utile (dans ce cas, %(freshness_lifetime)s).
ja: レスポンスの年齢（ここでは %(current_age)s）がフレッシュネスの有効期間（この場合は %(freshness_lifetime)s）よりも短い場合、そのレスポンスはフレッシュであると見なすことができます。
zh: 当响应的年龄（此处为 %(current_age)s）小于其新鲜度有效期（此处为 %(freshness_lifetime)s）时，该响应可被视为新鲜。

source: This response is %(private_status)s for %(fresh_left)s (%(shared_status)s for %(share_left)s in shared caches).
es: Esta respuesta es %(private_status)s durante %(fresh_left)s (%(shared_status)s durante %(share_left)s en cachés compartidos).
fr: Cette réponse est %(private_status)s pendant %(fresh_left)s (%(shared_status)s pendant %(share_left)s dans les caches partagés).
ja: このレスポンスは、%(fresh_left)s に対して%(private_status)sです（共有キャッシュでは%(share_left)s に対して%(shared_status)s）。
zh: 此响应的%(private_status)s为%(fresh_left)s（在共享缓存中的%(shared_status)s为%(share_left)s）。

source: This response has different freshness lifetimes for private (e.g., browser) and shared (e.g., proxy) caches. Private caches can consider it fresh for %(fresh_lifetime)s (until %(fresh_left)s from now). Shared caches can consider it fresh for %(share_lifetime)s (until %(share_left)s from now).
es: Esta respuesta tiene diferentes tiempos de vida de frescura para cachés privados (por ejemplo, navegador) y compartidos (por ejemplo, proxy). Las cachés privadas pueden considerarla fresca durante %(fresh_lifetime)s (hasta %(fresh_left)s desde ahora). Las cachés compartidas pueden considerarla fresca durante %(share_lifetime)s (hasta %(share_left)s desde ahora).
fr: Cette réponse a différentes durées de fraîcheur pour les caches privés (par exemple, un navigateur) et partagés (par exemple, un proxy). Les caches privés peuvent la considérer comme fraîche pendant %(fresh_lifetime)s (jusqu'à %(fresh_left)s à partir de maintenant). Les caches partagés peuvent la considérer comme fraîche pendant %(share_lifetime)s (jusqu'à %(share_left)s à partir de maintenant).
ja: このレスポンスは、プライベートキャッシュ（例：ブラウザ）と共有キャッシュ（例：プロキシ）で異なる鮮度有効期限を持っています。 プライベートキャッシュは %(fresh_lifetime)s （現在から %(fresh_left)s まで）の間、これを新鮮とみなすことができます。 共有キャッシュは %(share_lifetime)s （現在から %(share_left)s まで）の間、これを新鮮とみなすことができます。
zh: 此响应对于私有（例如浏览器）和共享（例如代理）缓存具有不同的新鲜度寿命。 私有缓存可认为其在 %(fresh_lifetime)s 内（即从现在起 %(fresh_left)s）是新鲜的。 共享缓存可认为其在 %(share_lifetime)s 内（即从现在起 %(share_left)s）是新鲜的。

source: This response is stale.
es: Esta respuesta está obsoleta.
fr: Cette réponse est périmée.
ja: このレスポンスは古いものです。
zh: 此响应已过时。
