Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: Parameter values that end in '*' are reserved for non-ascii text, as explained in [RFC5987](https://www.rfc-editor.org/rfc/rfc5987). The `%(param)s` parameter on the `%(field_name)s` field does not allow this; you should use %(param)s without the "*" on the end (and without the associated encoding).
es: Los valores de parámetro que terminan en '*' están reservados para texto no ASCII, como se explica en [RFC5987](https://www.rfc-editor.org/rfc/rfc5987). El parámetro `%(param)s` en el campo `%(field_name)s` no lo permite; deberías usar %(param)s sin el "*" al final (y sin la codificación asociada).
fr: Les valeurs de paramètres se terminant par '*' sont réservées aux textes non ASCII, comme expliqué dans [RFC5987](https://www.rfc-editor.org/rfc/rfc5987). Le paramètre `%(param)s` sur le champ `%(field_name)s` ne le permet pas ; vous devriez utiliser %(param)s sans le "*" à la fin (et sans l'encodage associé).
ja: 末尾に'*'が付くパラメータ値は、[RFC5987](https://www.rfc-editor.org/rfc/rfc5987)で説明されているように、非ASCIIテキスト用に予約されています。 `%(field_name)s` フィールドの `%(param)s` パラメータはこれを許可していません。末尾の'*'を付けずに（および関連するエンコーディングなしで）%(param)sを使用してください。
zh: 结尾带 '*' 的参数值保留给非 ASCII 文本，如 [RFC5987](https://www.rfc-editor.org/rfc/rfc5987) 中所述。 `%(field_name)s` 字段上的 `%(param)s` 参数不允许这样做；您应该使用 没有结尾 '*' 的 %(param)s（并且不进行关联编码）。

source: The '%(param)s' parameter's value cannot be quoted.
es: El valor del parámetro '%(param)s' no puede ser entrecomillado.
fr: La valeur du paramètre '%(param)s' ne peut pas être entre guillemets.
ja: 「%(param)s」パラメータの値は引用できません。
zh: “%(param)s” 参数的值不能被引用。

source: Parameter values that end in '*' have a specific format, defined in [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), to allow non-ASCII text. The `%(param)s` parameter on the `%(field_name)s` field has double-quotes around it, which is not valid.
es: Los valores de parámetro que terminan en '*' tienen un formato específico, definido en [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), para permitir texto no ASCII. El parámetro `%(param)s` en el campo `%(field_name)s` tiene comillas dobles alrededor, lo cual no es válido.
fr: Les valeurs de paramètre qui se terminent par '*' ont un format spécifique, défini dans [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), pour permettre du texte non ASCII. Le paramètre `%(param)s` sur le champ `%(field_name)s` est entouré de guillemets doubles, ce qui n'est pas valide.
ja: `*`で終わるパラメータ値は、非ASCIIテキストを許可するために[RFC5987](https://www.rfc-editor.org/rfc/rfc5987)で定義された特定フォーマットを持っています。 `%(field_name)s`フィールドの`%(param)s`パラメータが二重引用符で囲まれていますが、これは無効です。
zh: 以 '*' 结尾的参数值具有特定格式，定义在 [RFC5987](https://www.rfc-editor.org/rfc/rfc5987) 中，以允许使用非 ASCII 文本。 `%(field_name)s` 字段上的 `%(param)s` 参数带有双引号，这是无效的。

source: The %(param)s parameter's value is invalid.
es: El valor del parámetro %(param)s no es válido.
fr: La valeur du paramètre %(param)s n'est pas valide.
ja: %(param)s パラメータの値が無効です。
zh: %(param)s 参数的值无效。

source: Parameter values that end in '*' have a specific format, defined in [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), to allow non-ASCII text. The `%(param)s` parameter on the `%(field_name)s` field is not valid; it needs to have three parts, separated by single quotes (').
es: Los valores de los parámetros que terminan en '*' tienen un formato específico, definido en [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), para permitir texto no ASCII. El parámetro `%(param)s` en el campo `%(field_name)s` no es válido; necesita tener tres partes, separadas por comillas simples (').
fr: Les valeurs de paramètres qui se terminent par '*' ont un format spécifique, défini dans [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), pour permettre le texte non-ASCII. Le paramètre `%(param)s` sur le champ `%(field_name)s` n'est pas valide ; il doit avoir trois parties, séparées par des apostrophes (').
ja: `*` で終わるパラメータ値は、ASCII 以外のテキストを許可するために [RFC5987](https://www.rfc-editor.org/rfc/rfc5987) で定義された特定の形式を持っています。 `%(field_name)s` フィールドの `%(param)s` パラメータは無効です。単一引用符 (') で区切られた 3 つの部分が必要です。
zh: 结尾带有“*”的参数值具有特定格式，在 [RFC5987](https://www.rfc-editor.org/rfc/rfc5987) 中定义，允许使用非 ASCII 文本。 `%(field_name)s` 字段上的 `%(param)s` 参数无效；它需要包含三个 部分，并用单引号（'）分隔。

source: The %(param)s parameter's value doesn't define an encoding.
es: El valor del parámetro %(param)s no define una codificación.
fr: La valeur du paramètre %(param)s ne définit pas d'encodage.
ja: %(param)s パラメータの値はエンコーディングを定義していません。
zh: %(param)s 参数的值未定义编码。

source: Parameter values that end in '*' have a specific format, defined in [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), to allow non-ASCII text. The `%(param)s` parameter on the `%(field_name)s` header doesn't declare its character encoding, which means that recipients can't understand it. It should be `UTF-8`.
es: Los valores de parámetro que terminan en '*' tienen un formato específico, definido en [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), para permitir texto no ASCII. El parámetro `%(param)s` en la cabecera `%(field_name)s` no declara su codificación de caracteres, lo que significa que los destinatarios no pueden entenderlo. Debería ser `UTF-8`.
fr: Les valeurs de paramètre qui se terminent par '*' ont un format spécifique, défini dans [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), pour permettre le texte non-ASCII. Le paramètre `%(param)s` sur l'en-tête `%(field_name)s` ne déclare pas son encodage de caractères, ce qui signifie que les destinataires ne peuvent pas le comprendre. Il devrait être `UTF-8`.
ja: '*'で終わるパラメータ値は、非ASCIIテキストを許可するために[RFC5987](https://www.rfc-editor.org/rfc/rfc5987)で定義された特定の形式を持っています。 `%(field_name)s` ヘッダーの `%(param)s` パラメータは文字エンコーディングを宣言していないため、受信側で理解できません。`UTF-8` であるべきです。
zh: 以 '*' 结尾的参数值采用特定格式，定义于 [RFC5987](https://www.rfc-editor.org/rfc/rfc5987)，允许使用非 ASCII 文本。 `%(field_name)s` 标头上的 `%(param)s` 参数未声明其字符编码， 这意味着接收者无法理解它。它应该是 `UTF-8`。

source: The %(param)s parameter's value uses an encoding other than UTF-8.
es: El valor del parámetro %(param)s utiliza una codificación distinta a UTF-8.
fr: La valeur du paramètre %(param)s utilise un encodage autre que UTF-8.
ja: %(param)s パラメータの値は UTF-8 以外のエンコーディングを使用しています。
zh: %(param)s 参数的值使用了 UTF-8 以外的编码。

source: Parameter values that end in '*' have a specific format, defined in [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), to allow non-ASCII text. The `%(param)s` parameter on the `%(field_name)s` header uses the `'%(enc)s` encoding, which has interoperability issues with some browsers. It should be `UTF-8`.
es: Los valores de parámetro que terminan en '*' tienen un formato específico, definido en [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), para permitir texto no ASCII. El parámetro `%(param)s` en la cabecera `%(field_name)s` utiliza la codificación `'%(enc)s`, que tiene problemas de interoperabilidad con algunos navegadores. Debería ser `UTF-8`.
fr: Les valeurs de paramètre qui se terminent par '*' ont un format spécifique, défini dans [RFC5987](https://www.rfc-editor.org/rfc/rfc5987), pour autoriser du texte non ASCII. Le paramètre `%(param)s` sur l'en-tête `%(field_name)s` utilise l'encodage `'%(enc)s`, qui présente des problèmes d'interopérabilité avec certains navigateurs. Il devrait être `UTF-8`.
ja: '*'で終わるパラメータ値は、ASCII以外のテキストを許可するために[RFC5987](https://www.rfc-editor.org/rfc/rfc5987)で定義された特定の形式を持ちます。 `%(field_name)s`ヘッダーの`%(param)s`パラメータは、一部のブラウザで相互運用性の問題がある`'%(enc)s`エンコーディングを使用しています。`UTF-8`であるべきです。
zh: 以“*”结尾的参数值具有特定格式，在 [RFC5987](https://www.rfc-editor.org/rfc/rfc5987) 中定义，允许使用非 ASCII 文本。 `%(field_name)s` 标头上的 `%(param)s` 参数使用了“`%(enc)s`”编码，该编码在与某些浏览器交互时存在问题。应使用 `UTF-8`。

source: The %(field_name)s header's value isn't a valid date.
es: El valor del encabezado %(field_name)s no es una fecha válida.
fr: La valeur de l'en-tête %(field_name)s n'est pas une date valide.
ja: 「%(field_name)s」ヘッダーの値は有効な日付ではありません。
zh: %(field_name)s 头的取值不是一个有效的日期。

source: HTTP dates have specific syntax, and sending an invalid date can cause a number of problems, especially with caching. Common problems include sending "1 May" instead of "01 May" (the month is a fixed-width field), and sending a date in a timezone other than GMT. See [the HTTP specification](https://www.rfc-editor.org/rfc/rfc9110.html#name-date-time-formats) for more information.
es: Las fechas HTTP tienen una sintaxis específica, y enviar una fecha no válida puede causar una serie de problemas, especialmente con el almacenamiento en caché. Los problemas comunes incluyen enviar "1 May" en lugar de "01 May" (el mes es un campo de ancho fijo) y enviar una fecha en una zona horaria distinta de GMT. Consulte [la especificación HTTP](https://www.rfc-editor.org/rfc/rfc9110.html#name-date-time-formats) para obtener más información.
fr: Les dates HTTP ont une syntaxe spécifique, et l'envoi d'une date invalide peut causer un certain nombre de problèmes, notamment avec la mise en cache. Les problèmes courants incluent l'envoi de "1 May" au lieu de "01 May" (le mois est un champ de largeur fixe) et l'envoi d'une date dans un fuseau horaire autre que GMT. Consultez [la spécification HTTP](https://www.rfc-editor.org/rfc/rfc9110.html#name-date-time-formats) pour plus d'informations.
ja: HTTP の日付には特定の構文があり、無効な日付を送信すると、特にキャッシュにおいて多くの問題が発生する可能性があります。一般的な問題としては、「01 May」の代わりに「1 May」を送信すること（月は固定幅フィールドです）、GMT 以外のタイムゾーンで日付を送信することなどがあります。 詳細については、[HTTP 仕様](https://www.rfc-editor.org/rfc/rfc9110.html#name-date-time-formats)を参照してください。
zh: HTTP 日期具有特定的语法，发送无效日期可能会导致一系列问题，尤其是在缓存方面。常见的问题包括发送“1 May”而不是“01 May”（月份是固定宽度字段），以及发送除 GMT 之外的任何时区的日期。 有关更多信息，请参阅 [HTTP 规范](https://www.rfc-editor.org/rfc/rfc9110.html#name-date-time-formats)。

source: The %(field_name)s header's value uses an obsolete format.
es: El valor de la cabecera %(field_name)s usa un formato obsoleto.
fr: La valeur de l'en-tête %(field_name)s utilise un format obsolète.
ja: 「%(field_name)s」ヘッダーの値は廃止された形式を使用しています。
zh: %(field_name)s 标头的值使用了过时的格式。

source: HTTP has a number of defined date formats for historical reasons. This header is using an old format that are now obsolete. See [the specification](https://www.rfc-editor.org/rfc/rfc9110.html#name-obsolete-date-formats) for more information.
es: HTTP tiene varios formatos de fecha definidos por razones históricas. Esta cabecera está utilizando un formato antiguo que ahora está obsoleto. Consulte [la especificación](https://www.rfc-editor.org/rfc/rfc9110.html#name-obsolete-date-formats) para obtener más información.
fr: HTTP possède un certain nombre de formats de date définis pour des raisons historiques. Cet en-tête utilise un ancien format qui est maintenant obsolète. Voir [la spécification](https://www.rfc-editor.org/rfc/rfc9110.html#name-obsolete-date-formats) pour plus d'informations.
ja: HTTPには、歴史的な理由からいくつかの定義済みの日付フォーマットがあります。このヘッダーは、現在廃止されている古いフォーマットを使用しています。詳細については、[仕様](https://www.rfc-editor.org/rfc/rfc9110.html#name-obsolete-date-formats)を参照してください。
zh: HTTP 出于历史原因定义了多种日期格式。此标头使用的是现已废弃的旧格式。有关更多信息，请参阅 [规范](https://www.rfc-editor.org/rfc/rfc9110.html#name-obsolete-date-formats)。

source: The `Accept` header field can be used by user agents to specify response media types that are acceptable in responses.
es: El campo de encabezado `Accept` puede ser utilizado por los agentes de usuario para especificar los tipos de medios de respuesta que son aceptables en las respuestas.
ja: `Accept` ヘッダーフィールドは、ユーザーエージェントが応答で許容されるメディアタイプを指定するために使用できます。

source: The q value on '{media_type}' is invalid.
es: El valor q en '{media_type}' es inválido.
fr: La valeur q sur '{media_type}' est invalide.

source: The `q` parameter must be a decimal number between 0 and 1, with at most 3 digits of precision.
es: El parámetro `q` debe ser un número decimal entre 0 y 1, con un máximo de 3 dígitos de precisión.
fr: La `q` paramètre doit être un nombre décimal entre 0 et 1, avec au plus 3 chiffres de précision.

source: The Accept header isn't valid.
es: El encabezado Accept no es válido.
fr: Le en-tête Accept n'est pas valide.

source: The value for this field doesn't conform to its specified syntax; see [its definition](%(ref_uri)s) for more information.
es: El valor de este campo no se ajusta a su sintaxis especificada; consulte [su definición](%(ref_uri)s) para obtener más información.
fr: La valeur de ce champ n'est pas conforme à sa syntaxe spécifiée ; voir [sa définition](%(ref_uri)s) pour plus d'informations.
ja: このフィールドの値は指定された構文に準拠していません。[定義](%(ref_uri)s)を参照してください。
zh: 此字段的值不符合其指定的语法；请参阅[其定义](%(ref_uri)s)以获取更多信息。

source: Accept-CH is ignored over plain HTTP.
es: Accept-CH se ignora en HTTP simple.
fr: Accept-CH est ignoré sur HTTP en clair.

source: The `Accept-CH` header field should only be used on secure (HTTPS) responses. Using it over plain HTTP exposes the user's information to network observers. Because of this, browsers will ignore the header.
es: El campo de encabezado `Accept-CH` solo debe usarse en respuestas seguras (HTTPS). Su uso en HTTP sin cifrar expone la información del usuario a los observadores de la red. Por este motivo, los navegadores ignorarán el encabezado.
fr: Le champ d'en-tête `Accept-CH` ne doit être utilisé que sur les réponses sécurisées (HTTPS). Son utilisation sur une connexion HTTP non sécurisée expose les informations de l'utilisateur aux observateurs du réseau. C'est pourquoi les navigateurs ignorent cet en-tête.

source: Accept-CH lists fields that are missing from Vary.
es: Accept-CH: enum(header, fields)
fr: Accept-CH : liste les champs manquants dans Vary.

source: The following fields appear in `Accept-CH` but are not listed in the `Vary` header: %(missing_fields)s. Because these fields can affect the response content, they should be included in `Vary` to ensure that caches store separate responses for different client hints.
es: Los siguientes campos aparecen en «Accept-CH» pero no están enumerados en el encabezado «Vary»: %(missing_fields)s. Como estos campos pueden afectar el contenido de la respuesta, deben incluirse en «Vary» para garantizar que los cachés almacenen respuestas separadas para diferentes sugerencias de cliente.

source: The Accept-CH header isn't a List of Tokens.
es: La cabecera Accept-CH no es una lista de tokens.
fr: Le en-tête Accept-CH n'est pas une liste de jetons.

source: The `Accept-Encoding` header field can be used by user agents to indicate what response content-codings are acceptable in the response.
es: El campo de cabecera `Accept-Encoding` puede ser utilizado por los agentes de usuario para indicar qué codificaciones de contenido de respuesta son aceptables en la respuesta.
ja: `Accept-Encoding` ヘッダーフィールドは、ユーザーエージェントがレスポンスで許可されるレスポンスコンテンツコーディングを示すために使用できます。

source: The `Accept-Language` header field can be used by user agents to indicate the set of natural languages that are preferred in the response.
es: El campo de encabezado `Accept-Language` puede ser utilizado por los agentes de usuario para indicar el conjunto de lenguas naturales preferidas en la respuesta.
ja: `Accept-Language` ヘッダーフィールドは、ユーザーエージェントが応答で優先される自然言語のセットを示すために使用できます。

source: The q value on '{language}' is invalid.
es: El valor q en '{language}' es inválido.
fr: La valeur q sur '{language}' est invalide.

source: The Accept-Language header isn't valid.
es: La cabecera Accept-Language no es válida.
fr: Le header Accept-Language n'est pas valide.

source: The `Accept-Ranges` response header allows the server to indicate that it accepts range requests for a resource.
es: La cabecera de respuesta `Accept-Ranges` permite al servidor indicar que acepta solicitudes de rango para un recurso.
ja: `Accept-Ranges` レスポンスヘッダーにより、サーバーはリソースに対する範囲リクエストを受け入れることができることを示すことができます。

source: This response advertises support for non-standard range-units.
es: Esta respuesta anuncia soporte para unidades de rango no estándar.
fr: Cette réponse annonce la prise en charge d'unités de plage non-standards.
ja: このレスポンスは、非標準の range-units のサポートを広告しています。
zh: 此响应支持非标准范围单位。

source: The `Accept-Ranges` response header tells clients what `range-unit`s a resource is willing to process in future requests. HTTP only defines two: `bytes` and `none`. Clients who don't know about the non-standard range-unit will not be able to use it.
es: La cabecera de respuesta `Accept-Ranges` indica a los clientes qué `range-unit`s está dispuesto a procesar un recurso en futuras solicitudes. HTTP solo define dos: `bytes` y `none`. Los clientes que no conozcan el `range-unit` no estándar no podrán utilizarlo.
fr: L'en-tête de réponse `Accept-Ranges` indique aux clients quels `range-unit`s une ressource accepte de traiter dans les requêtes futures. HTTP n'en définit que deux : `bytes` et `none`. Les clients qui ignorent le `range-unit` non standard ne pourront pas l'utiliser.
ja: `Accept-Ranges` レスポンスヘッダーは、リソースが将来のリクエストで処理できる `range-unit` をクライアントに伝えます。HTTP で定義されているのは `bytes` と `none` の 2 つだけです。 標準外の `range-unit` を知らないクライアントは、それを使用できません。
zh: `Accept-Ranges` 响应头告知客户端资源愿意在未来请求中处理的 `range-unit`s。HTTP 仅定义两种：`bytes` 和 `none`。 不了解非标准 `range-unit` 的客户端将无法使用它。

source: Access-Control-Allow-Credentials must be 'true'.
es: Access-Control-Allow-Credentials debe ser 'true'.
fr: Access-Control-Allow-Credentials doit être 'true'.
ja: Access-Control-Allow-Credentials は 'true' である必要があります。
zh: Access-Control-Allow-Credentials 必须是 'true'。

source: The `Access-Control-Allow-Credentials` header must be set to `true` if present. If you don't want to allow credentials, omit the header.
es: La cabecera `Access-Control-Allow-Credentials` debe establecerse en `true` si está presente. Si no desea permitir credenciales, omita la cabecera.
fr: L'en-tête `Access-Control-Allow-Credentials` doit être défini sur `true` s'il est présent. Si vous ne souhaitez pas autoriser les informations d'identification, omettez l'en-tête.
ja: `Access-Control-Allow-Credentials` ヘッダーは、存在する場合 `true` に設定する必要があります。 認証情報を許可しない場合は、ヘッダーを省略してください。
zh: 如果存在 `Access-Control-Allow-Credentials` 标头，则必须将其设置为 `true`。如果您不想允许凭据，请省略该标头。

source: The `Access-Control-Allow-Headers` response header is used in response to a CORS preflight request to indicate which HTTP headers can be used during the actual request.
es: El encabezado de respuesta `Access-Control-Allow-Headers` se utiliza en respuesta a una solicitud CORS preflight para indicar qué encabezados HTTP pueden utilizarse durante la solicitud real.
ja: `Access-Control-Allow-Headers` レスポンスヘッダーは、CORSプリフライトリクエストへの応答として使用され、実際のリクエスト中に使用できるHTTPヘッダーを示します。

source: The `Access-Control-Allow-Methods` response header specifies the method or methods allowed when accessing the resource in response to a CORS preflight request.
es: La cabecera de respuesta `Access-Control-Allow-Methods` especifica el método o métodos permitidos al acceder al recurso en respuesta a una solicitud de preflight CORS.
ja: `Access-Control-Allow-Methods` レスポンスヘッダーは、CORSプリフライトリクエストへの応答としてリソースにアクセスする際に許可されるメソッドを指定します。

source: Access-Control-Allow-Origin should not have multiple values.
es: Access-Control-Allow-Origin no debe tener valores múltiples.
fr: Access-Control-Allow-Origin ne doit pas avoir plusieurs valeurs.
ja: Access-Control-Allow-Origin には複数の値を持たせるべきではありません。
zh: Access-Control-Allow-Origin 不应有多个值。

source: The `Access-Control-Allow-Origin` header can only contain a single origin, `*`, or `null`. It cannot contain a list of origins.
es: La cabecera `Access-Control-Allow-Origin` solo puede contener un único origen, `*`, o `null`. No puede contener una lista de orígenes.
fr: L'en-tête `Access-Control-Allow-Origin` ne peut contenir qu'une seule origine, `*`, ou `null`. Il ne peut pas contenir une liste d'origines.
ja: `Access-Control-Allow-Origin` ヘッダーには、単一のオリジン、`*`、または `null` のいずれかのみを含めることができます。オリジンのリストは含めることができません。
zh: `Access-Control-Allow-Origin` 标头只能包含单个来源、`*` 或 `null`。它不能包含来源列表。

source: The `Access-Control-Expose-Headers` response header allows a server to indicate which response headers should be made available to scripts running in the browser, in response to a cross-origin request.
es: La cabecera de respuesta `Access-Control-Expose-Headers` permite a un servidor indicar qué cabeceras de respuesta deben estar disponibles para scripts que se ejecutan en el navegador, en respuesta a una solicitud de origen cruzado.
ja: `Access-Control-Expose-Headers` レスポンスヘッダーを使用すると、サーバーは、オリジン間リクエストへの応答として、ブラウザーで実行されるスクリプトが利用できるようにすべきレスポンスヘッダーを示します。

source: The `Access-Control-Request-Headers` request header is used by browsers when issuing a CORS preflight request, to let the server know which HTTP headers the client might send when the actual request is made.
es: La cabecera de solicitud `Access-Control-Request-Headers` es utilizada por los navegadores al emitir una solicitud CORS preflight, para informar al servidor qué cabeceras HTTP el cliente podría enviar cuando se realiza la solicitud real.
ja: `Access-Control-Request-Headers` リクエストヘッダーは、CORSプリフライトリクエストを発行する際にブラウザによって使用され、実際の送信時にクライアントが送信する可能性のあるHTTPヘッダーをサーバーに通知します。

source: The Age header's value should be an integer.
es: El valor del encabezado Age debe ser un entero.
fr: La valeur de l'en-tête Age doit être un entier.
ja: Ageヘッダーの値は整数である必要があります。
zh: Age 头部的取值应为整数。

source: The `Age` header indicates the age of the response; i.e., how long it has been cached since it was generated. The value given was not an integer, so it is not a valid age.
es: La cabecera `Age` indica la edad de la respuesta; es decir, cuánto tiempo ha estado en caché desde que se generó. El valor proporcionado no era un entero, por lo que no es una edad válida.
fr: L'en-tête `Age` indique l'âge de la réponse ; c'est-à-dire depuis combien de temps elle a été mise en cache depuis sa génération. La valeur donnée n'était pas un entier, elle n'est donc pas un âge valide.
ja: `Age` ヘッダーは、レスポンスの経過時間、つまりキャッシュされてから生成されるまでの時間を表します。指定された値は整数ではなかったため、有効な経過時間ではありません。
zh: `Age` 标头指示响应的年龄；即，自生成以来缓存了多长时间。给定值不是整数，因此不是有效的年龄。

source: The Age headers' value must be a positive integer.
es: El valor de la cabecera Age debe ser un entero positivo.
fr: La valeur des en-têtes Age doit être un entier positif.
ja: Age ヘッダーの値は正の整数である必要があります。
zh: Age 标头的值必须是正整数。

source: The `Age` header indicates the age of the response; i.e., how long it has been cached since it was generated. The value given was negative, so it is not a valid age.
es: La cabecera `Age` indica la antigüedad de la respuesta; es decir, cuánto tiempo ha estado en caché desde que se generó. El valor proporcionado fue negativo, por lo que no es una edad válida.
fr: L'en-tête `Age` indique l'âge de la réponse, c'est-à-dire la durée pendant laquelle elle a été mise en cache depuis sa génération. La valeur fournie était négative, elle ne représente donc pas un âge valide.
ja: `Age` ヘッダーは、レスポンスの経過時間、つまりキャッシュされてから生成されるまでの時間を示します。指定された値は負だったため、有効な経過時間ではありません。
zh: `Age` 标头指示响应的年龄；即，自生成以来缓存了多长时间。给出的值是负数，因此不是有效的年龄。

source: The Age header's value is very large.
es: El valor del encabezado Age es muy grande.
fr: La valeur de l'en-tête Age est très grande.
ja: Age ヘッダーの値が大きすぎます。
zh: Age 头部的取值非常大。

source: The `Age` header's value is greater than 2,147,483,648. Some implementations may represent it using that value (which is over 68 years).
es: El valor del encabezado `Age` es mayor que 2.147.483.648. Algunas implementaciones pueden representarlo usando ese valor (que es más de 68 años).
fr: La valeur de l'en-tête `Age` est supérieure à 2 147 483 648. Certaines implémentations peuvent la représenter en utilisant cette valeur (qui dépasse 68 ans).
ja: `Age` ヘッダーの値は 2,147,483,648 を超えています。一部の実装では、この値（68年以上）で表現される場合があります。
zh: `Age` 标头的值大于 2,147,483,648。某些实现可能会使用该值表示（这超过 68 年）。

source: The `Allow` response header advertises the set of methods that are supported by the resource.
es: La cabecera de respuesta `Allow` anuncia el conjunto de métodos que son compatibles con el recurso.
ja: `Allow` レスポンスヘッダーは、リソースでサポートされているメソッドのセットを広告します。
