Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: The resource is unavailable for legal reasons.
es: El recurso no está disponible por razones legales.
fr: La ressource est indisponible pour des raisons juridiques.
ja: リソースは、法的な理由により利用できません。
zh: 该资源因法律原因不可用。

source: The `451 (Unavailable For Legal Reasons)` status code indicates that the server is denying access to the resource as a consequence of a legal demand.
es: El código de estado `451 (Unavailable For Legal Reasons)` indica que el servidor está denegando el acceso al recurso como consecuencia de una demanda legal.
fr: Le code d'état `451 (Unavailable For Legal Reasons)` indique que le serveur refuse l'accès à la ressource suite à une demande légale.
ja: `451 (法的な理由により利用不可)` ステータスコードは、サーバーが法的要求の結果としてリソースへのアクセスを拒否していることを示します。
zh: `451 (Unavailable For Legal Reasons)` 状态码表示服务器因法律要求而拒绝访问该资源。

source: The server terminated an operation because it encountered an infinite loop.
es: El servidor terminó una operación porque encontró un bucle infinito.
fr: Le serveur a terminé une opération car il a rencontré une boucle infinie.
ja: サーバーで無限ループが検出されたため、操作が終了しました。
zh: 服务器因遇到无限循环而终止了操作。

source: The `508 (Loop Detected)` status code indicates that the server terminated an operation because it encountered an infinite loop while processing a request with "Depth: infinity".
es: El código de estado `508 (Loop Detected)` indica que el servidor terminó una operación porque encontró un bucle infinito al procesar una solicitud con "Depth: infinity".
fr: Le code d'état `508 (Loop Detected)` indique que le serveur a interrompu une opération car il a rencontré une boucle infinie lors du traitement d'une requête avec "Depth: infinity".
ja: `508 (Loop Detected)` ステータスコードは、サーバーが "Depth: infinity" を使用したリクエストの処理中に無限ループを検出したため、操作を終了したことを示します。
zh: `508 (Loop Detected)` 状态码表示服务器在处理带有“Depth: infinity”的请求时检测到无限循环，因此终止了该操作。

source: The client needs to authenticate to gain network access.
es: El cliente necesita autenticarse para obtener acceso a la red.
fr: Le client doit s'authentifier pour obtenir un accès réseau.
ja: クライアントはネットワークアクセス権を得るために認証する必要があります。
zh: 客户端需要进行身份验证才能获得网络访问权限。

source: The `511 (Network Authentication Required)` status code indicates that the client needs to authenticate to gain network access.
es: El código de estado `511 (Network Authentication Required)` indica que el cliente necesita autenticarse para obtener acceso a la red.
fr: Le code d'état `511 (Network Authentication Required)` indique que le client doit s'authentifier pour obtenir l'accès au réseau.
ja: `511 (Network Authentication Required)` ステータスコードは、クライアントがネットワークアクセスを得るために認証する必要があることを示します。
zh: `511 (网络认证要求)` 状态码表示客户端需要认证才能获得网络访问权限。

source: ahead
es: adelante
fr: en avance
ja: 先頭
zh: 提前

source: behind
es: detrás
fr: derrière
ja: 後ろ
zh: 落后

source: "%(field_name)s" is not a valid field name.
es: "%(field_name)s" no es un nombre de campo válido.
fr: "%(field_name)s" n'est pas un nom de champ valide.
ja: 「%(field_name)s」は、有効なフィールド名ではありません。
zh: “%(field_name)s” 不是一个有效的字段名。

source: Field names are limited to the `token` production in HTTP; i.e., they can't contain parenthesis, angle brackets (<>), ampersands (@), commas, semicolons, colons, backslashes (\), forward slashes (/), quotes, square brackets ([]), question marks, equals signs (=), curly brackets ({}) spaces or tabs.
es: Los nombres de campo están limitados a la producción `token` en HTTP; es decir, no pueden contener paréntesis, corchetes angulares (<>), ampersands (@), comas, punto y coma, dos puntos, barras invertidas (\), barras diagonales (/), comillas, corchetes ([]) , signos de interrogación, signos de igual (=), llaves ({}) espacios o tabulaciones.
fr: Les noms de champs sont limités à la production `token` HTTP ; c'est-à-dire qu'ils ne peuvent pas contenir de parenthèses, d'accolades (<>), d'esperluettes (@), de virgules, de points-virgules, de deux-points, de barres obliques inverses (\), de barres obliques (/), de guillemets, de crochets ([]), de points d'interrogation, de signes égaux (=), d'accolades ({}) d'espaces ou de tabulations.
ja: フィールド名はHTTPの`token`プロダクションに限定されます。つまり、括弧、山括弧（<>）、アンパサンド（@）、カンマ、セミコロン、コロン、バックスラッシュ（\）、フォワードスラッシュ（/）、引用符、角括弧（[]）、疑問符、等号（=）、波括弧（{}）、スペース、タブは含めることができません。
zh: 字段名称受限于 HTTP 的 `token` 规则；即，它们不能包含括号、 尖括号 (<>)、与号 (@)、逗号、分号、冒号、反斜杠 (\)、正斜杠 (/)、引号、方括号 ([])、 问号、等号 (=)、花括号 ({})、空格或制表符。

source: The %(field_name)s field value doesn't conform to its specified syntax.
es: El valor del campo %(field_name)s no cumple con su sintaxis especificada.
fr: Le champ %(field_name)s a une valeur qui ne respecte pas sa syntaxe spécifiée.

source: The value for this field has syntax specified using [Augmented BNF](https://www.rfc-editor.org/rfc/rfc5234.html), but doesn't conform to it. See [the field's ABNF](%(ref_uri)s) for more information. This error may or may not prevent recipients from parsing the field; fixing it will improve interoperability.
es: El valor de este campo tiene una sintaxis especificada mediante [Augmented BNF](https://www.rfc-editor.org/rfc/rfc5234.html), pero no cumple con ella. Consulte [la ABNF del campo](%(ref_uri)s) para obtener más información. Este error puede o no impedir que los destinatarios analicen el campo; solucionarlo mejorará la interoperabilidad.
fr: La valeur de ce champ a une syntaxe spécifiée en utilisant [Augmented BNF](https://www.rfc-editor.org/rfc/rfc5234.html), mais elle n'y est pas conforme. Consultez [le champ's ABNF](%(ref_uri)s) pour plus d'informations. Cette erreur peut ou non empêcher les destinataires de parser le champ ; la correction de celle-ci améliorera l'interopérabilité.

source: "%(field_name)s" isn't valid in a response.
es: "%(field_name)s" no es válido en una respuesta.
fr: "%(field_name)s" n'est pas valide dans une réponse.

source: The %(field_name)s field only has meaning in requests. Sending it a response doesn't do anything. REDbot (and most recipients) will ignore it.
es: El campo %(field_name)s solo tiene significado en las solicitudes. Enviarlo en una respuesta no hace nada. REDbot (y la mayoría de los destinatarios) lo ignorarán.
fr: Le %(field_name)s n'a de sens que dans les requêtes. L'envoyer en réponse ne fait rien. REDbot (et la plupart des destinataires) l'ignoreront.

source: "%(field_name)s" isn't valid in a request.
es: "%(field_name)s" no es válido en una solicitud.
fr: "%(field_name)s" n'est pas valide dans une requête.

source: The %(field_name)s field only has meaning in responses. Sending it in a request doesn't do anything. REDbot (and most recipients) will ignore it.
es: El %(field_name)s solo tiene significado en las respuestas. Enviarlo en una solicitud no hace nada. REDbot (y la mayoría de los destinatarios) lo ignorarán.
fr: Le %(field_name)s n'a de sens que dans les réponses. L'envoi dans une demande ne fait rien. REDbot (et la plupart des destinataires) l'ignoreront.

source: The %(field_name)s header is deprecated.
es: La cabecera %(field_name)s está obsoleta.
fr: L'en-tête %(field_name)s est obsolète.
ja: 「%(field_name)s」ヘッダーは非推奨です。
zh: %(field_name)s 标头已弃用。

source: This field is no longer recommended for use, because of interoperability problems and/or lack of use. This field should probably be removed. See [the deprecation notice](%(deprecation_ref)s) for more information.
es: Este campo ya no se recomienda para su uso, debido a problemas de interoperabilidad y/o falta de adopción. Es probable que este campo deba eliminarse. Consulte la [notificación de desuso](%(deprecation_ref)s) para obtener más información.
fr: Ce champ n'est plus recommandé pour l'utilisation, en raison de problèmes d'interopérabilité et/ou d'un manque d'utilisation. Ce champ devrait probablement être supprimé. Voir [l'avis de dépréciation](%(deprecation_ref)s) pour plus d'informations.

source: The %(field_name)s header is only allowed in CORS preflight responses.
es: La cabecera %(field_name)s solo está permitida en respuestas CORS preflight.
ja: ヘッダー '%(field_name)s' はCORSプリフライト応答でのみ許可されています。
zh: “%(field_name)s” 头仅允许在 CORS 预检响应中使用。

source: The `%(field_name)s` header is only used in the response to a Cross-Origin Resource Sharing (CORS) preflight request. A preflight request is an `OPTIONS` request that includes an `Origin` header and an `Access-Control-Request-Method` header. This response was not to a CORS preflight request, so this header should not be present.
es: La cabecera `%(field_name)s` solo se utiliza en la respuesta a una solicitud previa de Cross-Origin Resource Sharing (CORS). Una solicitud previa es una solicitud `OPTIONS` que incluye una cabecera `Origin` y una cabecera `Access-Control-Request-Method`. Esta respuesta no fue a una solicitud previa de CORS, por lo que esta cabecera no debería estar presente.
ja: `%(field_name)s` ヘッダーは、Cross-Origin Resource Sharing (CORS) プリフライトリクエストへの応答でのみ使用されます。 プリフライトリクエストは、`Origin` ヘッダーと `Access-Control-Request-Method` ヘッダーを含む `OPTIONS` リクエストです。 この応答は CORS プリフライトリクエストへのものではなかったため、このヘッダーは存在しないはずです。
zh: `%(field_name)s` 标头仅在对跨域资源共享 (CORS) 预检请求的响应中使用。 预检请求是包含 `Origin` 标头和 `Access-Control-Request-Method` 标头的 `OPTIONS` 请求。 此响应不是对 CORS 预检请求的响应，因此不应存在此标头。

source: The %(field_name)s header is only allowed in CORS preflight requests.
es: La cabecera %(field_name)s solo está permitida en solicitudes CORS preflight.
ja: %(field_name)s ヘッダーは、CORSプリフライトリクエストでのみ許可されます。
zh: %(field_name)s 标头仅在 CORS 预检请求中允许。

source: The `%(field_name)s` header is only used in a Cross-Origin Resource Sharing (CORS) preflight request. A preflight request uses the `OPTIONS` method; this request uses `%(method)s`.
es: La cabecera `%(field_name)s` solo se usa en una solicitud de preflight de Intercambio de Recursos de Origen Cruzado (CORS). Una solicitud de preflight usa el método `OPTIONS`; esta solicitud usa `%(method)s`.
fr: L'en-tête `%(field_name)s` est uniquement utilisé dans une requête pré-vérification de partage de ressources entre origines (CORS). Une requête pré-vérification utilise la méthode `OPTIONS` ; cette requête utilise `%(method)s`.
ja: `%(field_name)s` ヘッダーは Cross-Origin Resource Sharing (CORS) のプリフライトリクエストでのみ使用されます。 プリフライトリクエストは `OPTIONS` メソッドを使用しますが、このリクエストは `%(method)s` を使用しています。
zh: `%(field_name)s` 标头仅在跨源资源共享 (CORS) 预检请求中使用。 预检请求使用 `OPTIONS` 方法；此请求使用 `%(method)s`。

source: The %(field_name)s header requires the Origin header.
es: La cabecera %(field_name)s requiere la cabecera Origin.
fr: L'en-tête %(field_name)s nécessite l'en-tête Origin.
ja: %(field_name)s ヘッダーには Origin ヘッダーが必要です。
zh: %(field_name)s 标头需要 Origin 标头。

source: The `%(field_name)s` header is only used in a Cross-Origin Resource Sharing (CORS) preflight request. A preflight request requires the `Origin` header to be present.
es: La cabecera `%(field_name)s` solo se usa en una solicitud de pre-vuelo Cross-Origin Resource Sharing (CORS). Una solicitud de pre-vuelo requiere que la cabecera `Origin` esté presente.
fr: L'en-tête `%(field_name)s` est uniquement utilisé dans une requête d'exploration préalable de partage des ressources d'origine croisée (CORS). Une requête d'exploration préalable nécessite que l'en-tête `Origin` soit présent.
ja: `%(field_name)s` ヘッダーは、Cross-Origin Resource Sharing (CORS) のプリフライトリクエストでのみ使用されます。 プリフライトリクエストには `Origin` ヘッダーが必要です。
zh: `%(field_name)s` 标头仅用于跨源资源共享 (CORS) 预检请求。 预检请求要求存在 `Origin` 标头。

source: The %(field_name)s header requires the Access-Control-Request-Method header.
es: La cabecera %(field_name)s requiere la cabecera Access-Control-Request-Method.
fr: L'en-tête %(field_name)s requiert l'en-tête Access-Control-Request-Method.
ja: ヘッダー '%(field_name)s' には Access-Control-Request-Method ヘッダーが必要です。
zh: %(field_name)s 标头要求 Access-Control-Request-Method 标头。

source: The `%(field_name)s` header is only used in a Cross-Origin Resource Sharing (CORS) preflight request. A preflight request requires the `Access-Control-Request-Method` header to be present.
es: La cabecera `%(field_name)s` solo se utiliza en una solicitud preflight de Cross-Origin Resource Sharing (CORS). Una solicitud preflight requiere que la cabecera `Access-Control-Request-Method` esté presente.
fr: L'en-tête `%(field_name)s` est uniquement utilisé dans une requête preflight de partage des ressources d'origine croisée (CORS). Une requête preflight nécessite la présence de l'en-tête `Access-Control-Request-Method`.
ja: `%(field_name)s` ヘッダーは、Cross-Origin Resource Sharing (CORS) のプリフライトリクエストでのみ使用されます。 プリフライトリクエストには、`Access-Control-Request-Method` ヘッダーが必要です。
zh: `%(field_name)s` 标头仅在跨源资源共享 (CORS) 预检请求中使用。 预检请求需要存在 `Access-Control-Request-Method` 标头。

source: Unknown
es: Desconocido
ja: 不明

source: The %(field_name)s header value isn't valid JSON.
es: El valor del encabezado %(field_name)s no es válido JSON.
fr: La valeur du header %(field_name)s n'est pas valide en JSON.

source: Each `%(field_name)s` field line must be valid JSON. The JSON parsing error was: %(error)s
es: Cada línea de campo «%(field_name)s» debe ser un JSON válido. El error de análisis JSON fue: «%(error)s»
fr: Chaque ligne de champ « %(field_name)s » doit être une chaîne JSON valide. L'erreur de parsing JSON était : %(error)s

source: The %(field_name)s field is very large (%(field_size)s bytes).
es: El campo %(field_name)s es muy grande (%(field_size)s bytes).
fr: Le champ %(field_name)s est très grand (%(field_size)s octets).
ja: The %(field_name)s フィールドは非常に大きいです %(field_size)s バイト).

source: Some implementations limit the size of any single field line.
es: Algunas implementaciones limitan el tamaño de cualquier línea de campo individual.
fr: Certaines implémentations limitent la taille d'une seule ligne de champ.
ja: 一部の実施では、任意の単一のフィールド ラインのサイズに制限を課します。

source: The %(field_type)s section is very large (%(section_size)s bytes).
es: La sección %(field_type)s es muy grande (%(section_size)s bytes).
fr: La section %(field_type)s est très grande (%(section_size)s octets).
ja: The %(field_type)s セクションは非常に大きく (%(section_size)s バイト) です。

source: Some implementations limit the total size of a field section. 32KB is a reasonable upper limit.
es: Algunas implementaciones limitan el tamaño total de una sección de campo. 32 KB es un límite razonable.
fr: Certaines implémentations limitent la taille totale d'une section de champ. 32 Ko est une limite raisonnable.
ja: 一部の実施では、フィールド セクションの合計サイズを制限します。 32KB は妥当な上限です。

source: The %(field_name)s field's name contains non-ASCII characters.
es: El nombre del campo %(field_name)s contiene caracteres no ASCII.
fr: Le nom du champ « %(field_name)s » contient des caractères non ASCII.
ja: The %(field_name)s フィールドの名前には、非 ASCII 文字が含まれています。

source: HTTP field names can only contain ASCII characters.
es: Los nombres de campo HTTP solo pueden contener caracteres ASCII.
fr: Les noms de champs HTTP ne peuvent contenir que des caractères ASCII.
ja: HTTP フィールド名は ASCII 文字のみを含めることができます。
zh: HTTP 字段名称只能包含 ASCII 字符。

source: The %(field_name)s field's value contains non-ASCII characters.
es: El valor del campo %(field_name)s contiene caracteres no ASCII.
fr: Le champ « %(field_name)s » contient des caractères non-ASCII.
ja: The %(field_name)s フィールドの値に ASCII 以外の文字が含まれています。

source: HTTP fields notionally use the ISO-8859-1 character set, but in most cases are pure ASCII (a subset of this encoding). This field has non-ASCII characters, which have been interpreted as being encoded in ISO-8859-1. If another encoding is used (e.g., UTF-8), the results may be unpredictable.
es: HTTP campos teóricamente utilizan el conjunto de caracteres ISO-8859-1, pero en la mayoría de los casos son ASCII puro (un subconjunto de esta codificación).
fr: HTTP les champs utilisent théoriquement l'ensemble de caractères ISO-8859-1, mais dans la plupart des cas, ils sont simplement ASCII (une sous-ensemble de cette codage). Ce champ contient des caractères non-ASCII, qui ont été interprétés comme étant encodés en ISO-8859-1. Si un autre encodage est utilisé (par exemple, UTF-8), les résultats peuvent être imprévisibles.
ja: HTTP フィールドは ISO-8859-1 文字セットを使用すると考えられますが、実際には ASCII のサブセット (このエンコーディングの subset) を使用しています。 このフィールドには、ISO-8859-1 でエンコードされた非 ASCII 文字が含まれています。別のエンコーディング（例：UTF-8）が使用されている場合、予期しない結果になる可能性があります。

source: Only one %(field_name)s field is allowed in a message.
es: Solo se permite un campo %(field_name)s en un mensaje.
fr: Seule une %(field_name)s est autorisée dans un message.

source: This field is designed to only occur once in a message. When it occurs more than once, a receiver needs to choose the one to use, which can lead to interoperability problems, since different implementations may make different choices.
es: Este campo está diseñado para que aparezca solo una vez en un mensaje. Cuando aparece más de una vez, el receptor debe elegir cuál usar, lo que puede generar problemas de interoperabilidad, ya que diferentes implementaciones pueden tomar decisiones distintas.
fr: Ce champ est conçu pour n'apparaître qu'une seule fois dans un message. Lorsqu'il apparaît plus d'une fois, un récepteur doit choisir celui à utiliser, ce qui peut entraîner des problèmes d'interopérabilité, car différentes implémentations peuvent faire des choix différents.
ja: このフィールドは、メッセージ内で1度だけ出現するように設計されています。複数回出現した場合、受信側はどちらを使用するかを選択する必要があり、実装によって選択が異なる可能性があるため、相互運用性の問題につながる可能性があります。
zh: 此字段设计为在消息中只出现一次。当它出现多次时，接收器需要选择使用哪一个，这可能导致互操作性问题，因为不同的实现可能会做出不同的选择。

source: In %(field_name)s, the %(context)s key '%(key)s' is duplicated.
es: En %(field_name)s, la clave '%(key)s' de %(context)s está duplicada.
fr: Dans %(field_name)s, la clé %(context)s '%(key)s' est dupliquée.
ja: %(field_name)s では、%(context)s キー '%(key)s' が重複しています。
zh: 在 %(field_name)s 中，%(context)s 键 '%(key)s' 被重复了。

source: The %(context)s key '%(key)s' is duplicated. All instances after the first will be ignored.
es: La clave '%(key)s' en el contexto '%(context)s' está duplicada. Todas las instancias después de la primera serán ignoradas.
fr: La clé '%(key)s' pour le contexte '%(context)s' est dupliquée. Toutes les instances après la première seront ignorées.
ja: %(context)s のキー '%(key)s' が重複しています。最初のインスタンス以降は無視されます。
zh: '%(context)s' 键 '%(key)s' 已重复。第一个实例之后的所有实例都将被忽略。

source: The %(field_name)s field value isn't a valid Structured Field.
es: El valor del campo %(field_name)s no es un campo estructurado válido.
fr: La valeur du champ %(field_name)s n'est pas un champ structuré valide.
ja: %(field_name)sフィールドの値は、有効な構造化フィールドではありません。
zh: %(field_name)s 字段的值不是有效的结构化字段。

source: The %(field_name)s field is defined as a [Structured Field](https://www.rfc-editor.org/rfc/rfc9651.html), but its value can't be parsed as one. As a result, this field is likely to be ignored. The parser reports this error: %(problem)s %(context)s
es: El campo %(field_name)s está definido como un [campo estructurado](https://www.rfc-editor.org/rfc/rfc9651.html), pero su valor no puede ser analizado como uno. Como resultado, este campo es probable que sea ignorado. El analisador reporta este error: %(problem)s %(context)s
fr: Le %(field_name)s est défini en tant que [champ structuré](https://www.rfc-editor.org/rfc/rfc9651.html), mais sa valeur ne peut pas être analysée comme une telle. En conséquence, ce champ est susceptible d'être ignoré. L'analyste signale cette erreur : %(problem)s %(context)s

source: The %(header_name)s header can probably be removed.
es: La cabecera %(header_name)s probablemente se pueda eliminar.
fr: L'en-tête %(header_name)s peut probablement être supprimé.
ja: `%(header_name)s` ヘッダーは削除しても問題ないでしょう。
zh: %(header_name)s 标头可能可以移除。

source: The `%(header_name)s` header adds little value, contributes to unnecessary bandwidth, and may increase security risk by exposing details of the back-end system. Consider removing it.
es: El encabezado `%(header_name)s` aporta poco valor, contribuye al ancho de banda innecesario y puede aumentar el riesgo de seguridad al exponer detalles del sistema de backend. Considere eliminarlo.
fr: L'en-tête `%(header_name)s` ajoute peu de valeur, contribue à une bande passante inutile et peut augmenter le risque de sécurité en exposant les détails du système back-end. Envisagez de le supprimer.
ja: `%(header_name)s` ヘッダーはほとんど価値がなく、不要な帯域幅を消費し、バックエンドシステムの詳細を公開することでセキュリティリスクを高める可能性があります。 削除を検討してください。
zh: `%(header_name)s` 标头几乎没有价值，会增加不必要的带宽， 并且可能通过暴露后端系统的详细信息来增加安全风险。 考虑移除它。

source: The '%(param)s' parameter repeats in the %(field_name)s header.
es: El parámetro '%(param)s' se repite en la cabecera %(field_name)s.
fr: Le paramètre '%(param)s' se répète dans l'en-tête %(field_name)s.
ja: 「%(param)s」パラメータが %(field_name)s ヘッダーで繰り返されています。
zh: “%(param)s” 参数在 %(field_name)s 标头中重复。

source: Parameters on the %(field_name)s field should not repeat; implementations may handle them differently.
es: Los parámetros en el campo %(field_name)s no deben repetirse; las implementaciones pueden manejarlos de manera diferente.
fr: Les paramètres du champ %(field_name)s ne doivent pas se répéter ; les implémentations peuvent les traiter différemment.
ja: `%(field_name)s` フィールドのパラメータは繰り返されるべきではありません。実装によって異なる場合があります。
zh: %(field_name)s 字段上的参数不应重复；实现可能对此有不同的处理方式。

source: The '%(param)s' parameter on the %(field_name)s header is single-quoted.
es: El parámetro '%(param)s' en la cabecera %(field_name)s está entrecomillado.
fr: Le paramètre '%(param)s' sur l'en-tête %(field_name)s est entre guillemets simples.
ja: `%(param)s` パラメータは、`%(field_name)s` ヘッダーで単一引用符で囲まれています。
zh: '%(param)s' 参数在 %(field_name)s 标头中被单引号包围。

source: The `%(param)s`'s value on the %(field_name)s field starts and ends with a single quote ('). However, single quotes don't mean anything there. This means that the value will be interpreted as `%(param_val)s`, **not** `%(param_val_unquoted)s`. If you intend the latter, remove the single quotes.
es: El valor de `%(param)s` en el campo %(field_name)s empieza y termina con una comilla simple ('). Sin embargo, las comillas simples no significan nada ahí. Esto significa que el valor se interpretará como `%(param_val)s`, **no** como `%(param_val_unquoted)s`. Si quieres lo último, elimina las comillas simples.
fr: La valeur de `%(param)s` sur le champ %(field_name)s commence et se termine par un guillemet simple ('). Cependant, les guillemets simples n'ont aucune signification à cet endroit. Cela signifie que la valeur sera interprétée comme `%(param_val)s`, **et non** comme `%(param_val_unquoted)s`. Si vous vouliez cette dernière, supprimez les guillemets simples.
ja: `%(field_name)s` フィールドの `%(param)s` の値は、シングルクォート（'）で始まり、シングルクォート（'）で終わっています。 しかし、シングルクォートはそこでは意味を持ちません。 これは、値が `%(param_val_unquoted)s` **ではなく** `%(param_val)s` として解釈されることを意味します。後者の意図がある場合は、シングルクォートを削除してください。
zh: `%(param)s` 在 %(field_name)s 字段中的值以单引号 (') 开始和结束。 然而，单引号在那里没有任何意义。 这意味着该值将被解释为 `%(param_val)s`，**而不是** `%(param_val_unquoted)s`。如果您的意图是后者，请删除单引号。

source: The %(param)s* parameter isn't allowed on the %(field_name)s field.
es: El parámetro %(param)s* no está permitido en el campo %(field_name)s.
fr: Le paramètre %(param)s* n'est pas autorisé sur le champ %(field_name)s.
ja: %(param)s* パラメータは %(field_name)s フィールドでは許可されていません。
zh: “%(param)s” 参数在 %(field_name)s 字段中不允许。
