Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: The `%(param)s` parameter is not defined in the Cache-Status specification.
es: El parámetro `%(param)s` no está definido en la especificación Cache-Status.
fr: Le paramètre `%(param)s` n'est pas défini dans la spécification Cache-Status.
ja: `%(param)s` パラメータは Cache-Status 仕様で定義されていません。
zh: `%(param)s` 参数未在 Cache-Status 规范中定义。

source: The Cache-Status header has an unknown value for '%(param)s'.
es: La cabecera Cache-Status tiene un valor desconocido para '%(param)s'.
fr: Cette réponse a un en-tête Cache-Status avec une valeur inconnue pour "%(param)s".
ja: Cache-Status ヘッダーに '%(param)s' の未知の値があります。
zh: Cache-Status 标头中 '%(param)s' 的值未知。

source: The value `%(value)s` is not defined for the `%(param)s` parameter.
es: El valor `%(value)s` no está definido para el parámetro `%(param)s`.
fr: La valeur `%(value)s` n'est pas définie pour le paramètre `%(param)s`.
ja: `%(value)s` の値は `%(param)s` パラメータで定義されていません。
zh: 参数 `%(param)s` 的值 `%(value)s` 未定义。

source: The %(bad_directive)s CDN cache directive's syntax is incorrect.
es: La sintaxis del %(bad_directive)s CDN cache directive es incorrecta.
fr: La syntaxe de la directive de cache CDN %(bad_directive)s est incorrecte.

source: This value must be %(expected_type)s.
es: Este valor debe ser %(expected_type)s.
fr: Ce valeur doit être %(expected_type)s.

source: This response targets cache directives to Content Delivery Networks.
es: Esta respuesta va dirigida a las directivas de caché para redes de entrega de contenido.
fr: Cette réponse cible les directives de cache pour les réseaux de diffusion de contenu.

source: The `CDN-Cache-Control` header field allows you to specify cache directives that are targeted at Content Delivery Network (CDN) caches, separately from the `Cache-Control` header field (which applies to all caches).
es: El campo de encabezado 'CDN-Cache-Control' le permite especificar directivas de caché que van dirigidas a las redes de entrega de contenido (CDN) caches, por separado del campo de encabezado 'Cache-Control' (que se aplica a todos los cachés).
fr: Le champ d'en-tête `CDN-Cache-Control` vous permet de spécifier des directives de cache qui sont ciblées sur les caches de réseau de distribution de contenu (CDN), séparément du champ d'en-tête `Cache-Control` (qui s'applique à tous les caches).

source: The `Clear-Site-Data` header clears the data associated with the requesting website in the user's browser. It allows web developers to have more control over the data stored by a client for their origin.
es: La cabecera `Clear-Site-Data` limpia los datos asociados con el sitio web solicitante en el navegador del usuario. Permite a los desarrolladores web tener un mayor control sobre los datos almacenados por un cliente para su origen.
ja: `Clear-Site-Data` ヘッダーは、ユーザーのブラウザで要求元のウェブサイトに関連付けられたデータをクリアします。これにより、ウェブ開発者は、クライアントが自分のオリジンに対して保存するデータをより細かく制御できるようになります。

source: The Clear-Site-Data header contains an unknown value '%(value)s'.
es: El encabezado Clear-Site-Data contiene un valor desconocido '%(value)s'.
fr: L'en-tête Clear-Site-Data contient une valeur inconnue '%(value)s'.
ja: Clear-Site-Data ヘッダーに不明な値 '%(value)s' が含まれています。
zh: Clear-Site-Data 标头包含一个未知值 '%(value)s'。

source: The `Clear-Site-Data` header contains a value that is not recognized. Valid values are: `"cache"`, `"cookies"`, `"storage"`, `"executionContexts"`, `"*"`.
es: La cabecera `Clear-Site-Data` contiene un valor que no se reconoce. Los valores válidos son: `"cache"`, `"cookies"`, `"storage"`, `"executionContexts"`, `"*"`.
fr: L'en-tête `Clear-Site-Data` contient une valeur qui n'est pas reconnue. Les valeurs valides sont : `"cache"`, `"cookies"`, `"storage"`, `"executionContexts"`, `"*`".
ja: `Clear-Site-Data` ヘッダーの値が認識されません。 有効な値は次のとおりです: `"cache"`、`"cookies"`、`"storage"`、`"executionContexts"`、`"*"`。
zh: `Clear-Site-Data` 标头包含一个未识别的值。 有效值为：`"cache"`、`"cookies"`、`"storage"`、`"executionContexts"`、`"*"`。

source: The Clear-Site-Data header has an empty value.
es: La cabecera Clear-Site-Data tiene un valor vacío.
fr: La valeur de l'en-tête Clear-Site-Data est vide.

source: The `Clear-Site-Data` header value is empty. It should contain at least one directive.
es: El valor de la cabecera 'Clear-Site-Data' está vacío. Debería contener al menos una directiva.
fr: La valeur de l'en-tête `Clear-Site-Data` est vide. Elle doit contenir au moins une directive.

source: Clear-Site-Data contains unquoted values.
es: Clear-Site-Data contiene valores sin comillas.
fr: Clear-Site-Data contient des valeurs non-entre-guillemets.

source: Values in the `Clear-Site-Data` header must be quoted; unquoted values will be ignored. The following values were found unquoted: %(values)s.
es: Los valores en el encabezado `Clear-Site-Data` deben estar entre comillas; los valores sin comillas se ignorarán. Los siguientes valores no tienen comillas: %(values)s.
fr: Les valeurs dans l'en-tête « Clear-Site-Data » doivent être entre guillemets ; les valeurs non entre guillemets seront ignorées. Les valeurs suivantes n'étaient pas entre guillemets : %(values)s.

source: The `Connection` header allows senders to specify which headers are hop-by-hop; that is, those that are not forwarded by intermediaries. It also indicates options that are desired for this particular connection; e.g., `close` means that it should not be reused. Connection is only valid in HTTP/1.x; HTTP/2 and HTTP/3 forbit it.
es: La cabecera `Connection` permite a los remitentes especificar qué cabeceras son de salto a salto; es decir, aquellas que no son reenviadas por intermediarios. También indica opciones que se desean para esta conexión en particular; p. ej., `close` significa que no debe reutilizarse. Connection solo es válida en HTTP/1.x; HTTP/2 y HTTP/3 la prohíben.
ja: `Connection` ヘッダーにより、送信者はホップバイホップのヘッダー（つまり、中間プロキシによって転送されないヘッダー）を指定できます。 また、この特定の接続で希望されるオプションを示すこともできます。例えば、`close` は再利用されるべきではないことを意味します。 Connection は HTTP/1.x でのみ有効です。HTTP/2 および HTTP/3 では禁止されています。

source: The '%(disposition)s' Content-Disposition isn't known.
es: La Content-Disposition '%(disposition)s' no es conocida.
fr: Le Content-Disposition '%(disposition)s' n'est pas connu.
ja: 「%(disposition)s」というContent-Dispositionは不明です。
zh: 未知的“%(disposition)s”Content-Disposition。

source: The `Content-Disposition` header has two widely-known values; `inline` and `attachment`. `%(disposition)s` isn't recognised, and most implementations will default to handling it like `attachment`.
es: La cabecera `Content-Disposition` tiene dos valores conocidos: `inline` y `attachment`. `%(disposition)s` no se reconoce, y la mayoría de las implementaciones lo tratarán por defecto como `attachment`.
fr: L'en-tête `Content-Disposition` a deux valeurs bien connues : `inline` et `attachment`. `%(disposition)s` n'est pas reconnu, et la plupart des implémentations le traiteront par défaut comme `attachment`.
ja: `Content-Disposition` ヘッダーには、`inline` と `attachment` という広く知られた2つの値があります。 `%(disposition)s` は認識されず、ほとんどの実装では `attachment` と同様に処理されるデフォルトになります。
zh: `Content-Disposition` 标头有两个广为人知的取值；`inline` 和 `attachment`。 `%(disposition)s` 未被识别，大多数实现会将其默认作为 `attachment` 来处理。

source: The Content-Disposition header doesn't have a 'filename' parameter.
es: El encabezado Content-Disposition no tiene el parámetro 'filename'.
fr: L'en-tête Content-Disposition n'a pas de paramètre 'filename'.
ja: Content-Disposition ヘッダーに 'filename' パラメーターがありません。
zh: Content-Disposition 标头缺少 'filename' 参数。

source: The `Content-Disposition` header with a disposition of `attachment` suggests a filename for clients to use when saving the file locally. It should always contain a `filename` parameter, even when the `filename*` parameter is used to carry an internationalised filename, so that browsers can fall back to an ASCII-only filename.
es: La cabecera `Content-Disposition` con una disposición de `attachment` sugiere un nombre de archivo para que los clientes lo utilicen al guardar el archivo localmente. Siempre debe contener un parámetro `filename`, incluso cuando se utiliza el parámetro `filename*` para incluir un nombre de archivo internacionalizado, de modo que los navegadores puedan recurrir a un nombre de archivo que solo contenga caracteres ASCII.
fr: L'en-tête `Content-Disposition` avec une disposition de `attachment` suggère un nom de fichier que les clients doivent utiliser lors de l'enregistrement du fichier localement. Il doit toujours contenir un paramètre `filename`, même lorsque le paramètre `filename*` est utilisé pour véhiculer un nom de fichier internationalisé, afin que les navigateurs puissent se rabattre sur un nom de fichier ASCII uniquement.
ja: `attachment` の disposition を持つ `Content-Disposition` ヘッダーは、クライアントがファイルをローカルに保存する際に使用するファイル名を示唆します。 国際化されたファイル名を指定するために `filename*` パラメータが使用されている場合でも、ブラウザが ASCII のみで構成されるファイル名にフォールバックできるように、常に `filename` パラメータを含む必要があります。
zh: `Content-Disposition` 标头中的 `attachment` 属性表明了一个文件名，供客户端在本地保存文件时使用。 即使使用了 `filename*` 参数来承载国际化文件名，它也应始终包含 `filename` 参数，以便浏览器能够回退到仅包含 ASCII 字符的文件名。

source: The 'filename' parameter on the Content-Disposition header contains a '%%' character.
es: El parámetro 'filename' en la cabecera Content-Disposition contiene un carácter '%%'.
fr: Le paramètre 'filename' dans l'en-tête Content-Disposition contient un caractère '%%'.
ja: Content-Disposition ヘッダーの「filename」パラメーターには「%%」文字が含まれています。
zh: Content-Disposition 头部中的 'filename' 参数包含一个 '%%' 字符。

source: The `Content-Disposition` header suggests a filename for clients to use when saving the file locally, using the `filename` parameter. [RFC6266](https://www.rfc-editor.org/rfc/rfc6266) specifies how to carry non-ASCII characters in this parameter. However, historically some (but not all) browsers have also decoded %%-encoded characters in the `filename` parameter, which means that they'll be treated differently depending on the browser you're using. As a result, it's not interoperable to use percent characters in the `filename` parameter. Use the correct encoding in the `filename*` parameter instead.
es: La cabecera `Content-Disposition` sugiere un nombre de archivo para que los clientes lo usen al guardar el archivo localmente, utilizando el parámetro `filename`. [RFC6266](https://www.rfc-editor.org/rfc/rfc6266) especifica cómo transportar caracteres no ASCII en este parámetro. Sin embargo, históricamente algunos (pero no todos) navegadores también han decodificado caracteres codificados con %% en el parámetro `filename`, lo que significa que se tratarán de forma diferente según el navegador que esté utilizando. Como resultado, no es interoperable usar caracteres de porcentaje en el parámetro `filename`. Utilice la codificación correcta en el parámetro `filename*` en su lugar.
fr: L'en-tête `Content-Disposition` suggère un nom de fichier que les clients doivent utiliser lors de l'enregistrement du fichier localement, en utilisant le paramètre `filename`. Le [RFC6266](https://www.rfc-editor.org/rfc/rfc6266) spécifie comment transporter des caractères non-ASCII dans ce paramètre. Cependant, historiquement, certains navigateurs (mais pas tous) ont également décodé les caractères %% encodés dans le paramètre `filename`, ce qui signifie qu'ils seront traités différemment selon le navigateur que vous utilisez. Par conséquent, il n'est pas interopérable d'utiliser des caractères pourcentage dans le paramètre `filename`. Utilisez le bon encodage dans le paramètre `filename*` à la place.
ja: `Content-Disposition` ヘッダーは、クライアントがファイルをローカルに保存する際に使用するファイル名を `filename` パラメーターで示唆します。 [RFC6266](https://www.rfc-editor.org/rfc/rfc6266) は、このパラメーターで非 ASCII 文字をどのように伝送するかを規定しています。しかし、歴史的には一部のブラウザー（すべてではありません）が `filename` パラメーター内の % エンコードされた文字をデコードしていたため、使用するブラウザーによって異なる扱いを受けることになります。 その結果、`filename` パラメーターでパーセント文字を使用するのは相互運用性がありません。代わりに、`filename*` パラメーターで正しいエンコーディングを使用してください。
zh: `Content-Disposition` 标头使用 `filename` 参数建议客户端在本地保存文件时使用的文件名。 [RFC6266](https://www.rfc-editor.org/rfc/rfc6266) 规定了在此参数中如何传输非 ASCII 字符。然而，历史上一些（但不是全部）浏览器也会解码 `filename` 参数中的 %% 编码字符，这意味着它们将根据您使用的浏览器而有所不同。 因此，在 `filename` 参数中使用百分号字符是不互通的。请改用 `filename*` 参数中的正确编码。

source: The filename in the Content-Disposition header contains a path character.
es: El nombre de archivo en la cabecera Content-Disposition contiene un carácter de ruta.
fr: Le nom de fichier dans l'en-tête Content-Disposition contient un caractère de chemin.
ja: Content-Disposition ヘッダーのファイル名にパス文字が含まれています。
zh: Content-Disposition 标头中的文件名包含路径字符。

source: The `Content-Disposition` header suggests a filename for clients to use when saving the file locally, using the `filename` and `filename*` parameters. One of these parameters contains a path character ("\" or "/"), used to navigate between directories on common operating systems. Because this can be used to attach the browser's host operating system (e.g., by saving a file to a system directory), browsers will usually ignore these parameters, or remove path information. You should remove these characters.
es: La cabecera `Content-Disposition` sugiere un nombre de archivo para que los clientes lo utilicen al guardar el archivo localmente, usando los parámetros `filename` y `filename*`. Uno de estos parámetros contiene un carácter de ruta ("\" o "/"), utilizado para navegar entre directorios en sistemas operativos comunes. Debido a que esto se puede usar para adjuntar el sistema operativo anfitrión del navegador (por ejemplo, guardando un archivo en un directorio del sistema), los navegadores generalmente ignorarán estos parámetros o eliminarán la información de la ruta. Deberías eliminar estos caracteres.
fr: L'en-tête `Content-Disposition` suggère un nom de fichier que les clients doivent utiliser lors de l'enregistrement du fichier localement, en utilisant les paramètres `filename` et `filename*`. L'un de ces paramètres contient un caractère de chemin ("\" ou "/"), utilisé pour naviguer entre les répertoires sur les systèmes d'exploitation courants. Étant donné que cela peut être utilisé pour accéder au système d'exploitation hôte du navigateur (par exemple, en enregistrant un fichier dans un répertoire système), les navigateurs ignoreront généralement ces paramètres ou supprimeront les informations de chemin. Vous devez supprimer ces caractères.
ja: `Content-Disposition` ヘッダーは、クライアントがファイルをローカルに保存する際に使用するファイル名を `filename` および `filename*` パラメーターで提案します。 これらのパラメーターのいずれかに、一般的なオペレーティングシステムでのディレクトリ間の移動に使用されるパス文字（"\" または "/"）が含まれています。 これは、ブラウザーのホストオペレーティングシステムにファイルを添付するために使用される可能性があるため（例: システムディレクトリにファイルを保存する）、ブラウザーは通常これらのパラメーターを無視するか、パス情報を削除します。 これらの文字を削除してください。
zh: `Content-Disposition` 标头使用 `filename` 和 `filename*` 参数，建议客户端在本地保存文件时使用的文件名。 其中一个参数包含一个路径字符（“\” 或 “/”），用于在常见操作系统中导航目录。 因为这可用于附加浏览器的宿主操作系统（例如，将文件保存到系统目录），浏览器通常会忽略这些参数，或删除路径信息。 您应该删除这些字符。

source: The `Content-Encoding` header's value indicates what content codings have been applied, and thus what decoding mechanisms must be used to obtain the media-type referenced by the Content-Type header. Content-Encoding is primarily used to allow a document to be compressed without losing the identity of its underlying media type; e.g., `gzip` and `deflate`.
es: El valor de la cabecera `Content-Encoding` indica qué codificaciones de contenido se han aplicado y, por lo tanto, qué mecanismos de decodificación deben utilizarse para obtener el media-type al que hace referencia la cabecera Content-Type. Content-Encoding se utiliza principalmente para permitir que un documento se comprima sin perder la identidad de su media-type subyacente; p. ej., `gzip` y `deflate`.
ja: `Content-Encoding` ヘッダーの値は、適用されたコンテンツコーディングと、それによって `Content-Type` ヘッダーで参照されているメディアタイプを取得するために使用されるべきデコーディングメカニズムを示します。 Content-Encoding は主に、基盤となるメディアタイプのアイデンティティを失うことなくドキュメントを圧縮できるようにするために使用されます。例: `gzip` および `deflate`。

source: This response is compressed with a dictionary,but is missing Vary: Available-Dictionary.
es: Esta respuesta está comprimida con un diccionario, pero falta Vary: Available-Dictionary.
fr: Cette réponse est compressée avec un dictionnaire, mais manque Vary: Available-Dictionary.

source: The response is compressed with a dictionary (dcb or dcz) and is cacheable, but does not list `Available-Dictionary` in the `Vary` header. [RFC 9842 Section 6.2](https://www.rfc-editor.org/rfc/rfc9842.html#section-6.2) requires that cacheable dictionary-compressed responses MUST include `Available-Dictionary` in the `Vary` header to prevent serving compressed content to clients that do not have the dictionary.
es: La respuesta está comprimida con un diccionario (dcb o dcz) y es cacheable, pero no incluye `Available-Dictionary` en el encabezado `Vary`. [La sección 6.2 del RFC 9842](https://www.rfc-editor.org/rfc/rfc9842.html#section-6.2) requiere que las respuestas cacheables y comprimidas con diccionario MUST incluir `Available-Dictionary` en el encabezado `Vary` para evitar servir contenido comprimido a clientes que no tengan el diccionario.
fr: La réponse est compressée avec un dictionnaire (dcb ou dcz) et est cacheable, mais ne répertorie pas `Available-Dictionary` dans l'en-tête `Vary`. [La section 6.2 du RFC 9842](https://www.rfc-editor.org/rfc/rfc9842.html#section-6.2) exige que les réponses compressées avec un dictionnaire cacheable DOIVENT inclure `Available-Dictionary` dans l'en-tête `Vary` pour empêcher la fourniture de contenu compressé aux clients qui ne disposent pas du dictionnaire.

source: This response uses the '%(coding)s' content-coding, but it wasn't requested.
es: Este respuesta usa el código de contenido '%(coding)s', pero no se solicitó.
fr: Cette réponse utilise le codage de contenu « %(coding)s », mais cela n'a pas été demandé.

source: This response's `Content-Encoding` header indicates it has the `%(coding)s content-coding applied , but the client didn't indicate support for it in the request. Normally, clients ask for the encodings they want in the `Accept-Encoding` request header. Using encodings that the client doesn't explicitly request can lead to interoperability problems.
es: El encabezado 'Content-Encoding' de esta respuesta indica que se ha aplicado un '%(coding)s content-coding', pero el cliente no lo solicitó en la solicitud. Normalmente, los clientes solicitan los códigos de contenido que desean en el encabezado 'Accept-Encoding' de la solicitud. El uso de códigos que el cliente no solicita explícitamente puede provocar problemas de interoperabilidad.
fr: Cette réponse indique dans son en-tête `Content-Encoding` qu'elle utilise le `%(coding)s content-coding`, mais le client n'a pas indiqué son support dans la requête. En général, les clients demandent les encodages qu'ils souhaitent dans l'en-tête de requête `Accept-Encoding`. L'utilisation d'encodages qui ne sont pas explicitement demandés par le client peut entraîner des problèmes d'interopérabilité.

source: The `Content-Language` header describes the natural language(s) of the intended audience for the messsage. Note that this might not convey all of the languages used.
es: La cabecera `Content-Language` describe el idioma o idiomas naturales de la audiencia prevista para el mensaje. Tenga en cuenta que esto podría no reflejar todos los idiomas utilizados.
ja: `Content-Language` ヘッダーは、メッセージの対象となるユーザーの自然言語を記述します。ただし、これは使用されているすべての言語を伝えるとは限らないことに注意してください。

source: The %(lang)s language tag appears more than once.
es: La etiqueta de idioma %(lang)s aparece más de una vez.
fr: La balise de langue %(lang)s apparaît plus d'une fois.
ja: %(lang)s言語タグが複数回出現しています。
zh: 语言标签 %(lang)s 出现次数超过一次。

source: The `%(lang)s` language tag is used more than once in the `Content-Language` header. Recipients will likely ignore duplicates.
es: La etiqueta de idioma `%(lang)s` se usa más de una vez en la cabecera `Content-Language`. Los destinatarios probablemente ignorarán los duplicados.
fr: Le tag de langue `%(lang)s` est utilisé plus d'une fois dans l'en-tête `Content-Language`. Les destinataires ignoreront probablement les doublons.
ja: `Content-Language` ヘッダーで `%(lang)s` 言語タグが複数回使用されています。 重複は受信者によって無視される可能性が高いです。
zh: `Content-Language` 标头中多次使用了 `%(lang)s` 语言标记。 接收方很可能会忽略重复项。

source: Content-Length and Transfer-Encoding should not be present together.
es: Content-Length y Transfer-Encoding no deben estar presentes juntos.
fr: Content-Length et Transfer-Encoding ne doivent pas être présents ensemble.
ja: Content-Length と Transfer-Encoding は同時に存在することはできません。
zh: Content-Length 和 Transfer-Encoding 不应同时存在。

source: RFC 9110 Section 8.6: > A sender MUST NOT send a Content-Length header field in any message that contains a Transfer-Encoding header field. This is because `Transfer-Encoding` overrides `Content-Length`.
es: RFC 9110 Sección 8.6: > Un remitente NO DEBE enviar un campo de encabezado Content-Length en ningún mensaje que contenga un campo de encabezado Transfer-Encoding. Esto se debe a que `Transfer-Encoding` anula `Content-Length`.
fr: RFC 9110 Section 8.6 : > Un expéditeur NE DOIT PAS envoyer un champ d'en-tête Content-Length dans un message qui contient un champ d'en-tête Transfer-Encoding. Ceci est parce que `Transfer-Encoding` remplace `Content-Length`.
ja: RFC 9110 セクション 8.6: > 送信者は、`Transfer-Encoding` ヘッダーフィールドを含むメッセージに `Content-Length` ヘッダーフィールドを送信してはならない。 これは `Transfer-Encoding` が `Content-Length` をオーバーライドするためです。
zh: RFC 9110 Section 8.6： > 发送方不得在包含 Transfer-Encoding 报头字段的任何消息中发送 Content-Length 报头字段。 这是因为 `Transfer-Encoding` 会覆盖 `Content-Length`。

source: The Content-Length header is very large.
es: La cabecera Content-Length es muy grande.
fr: L'en-tête Content-Length est très volumineux.
ja: Content-Length ヘッダーが非常に大きいです。
zh: Content-Length 标头非常大。

source: The `Content-Length` header's value is greater than 2^63-1. Some implementations may not be able to handle values this large.
es: El valor del encabezado `Content-Length` es mayor que 2^63-1. Algunas implementaciones pueden no ser capaces de manejar valores tan grandes.
fr: La valeur de l'en-tête `Content-Length` est supérieure à 2^63-1. Certaines implémentations pourraient ne pas être en mesure de gérer des valeurs aussi importantes.
ja: `Content-Length` ヘッダーの値が 2^63-1 より大きいです。一部の実装では、これほど大きな値を扱えない場合があります。
zh: `Content-Length` 标头的值大于 2^63-1。某些实现可能无法处理如此大的值。

source: This response shouldn't have a Content-Range header.
es: Esta respuesta no debería tener una cabecera Content-Range.
fr: Cette réponse ne devrait pas avoir d'en-tête Content-Range.
ja: このレスポンスには Content-Range ヘッダーを含めるべきではありません。
zh: 此响应不应带有 Content-Range 标头。

source: HTTP only defines meaning for the `Content-Range` header in responses with a `206` (Partial Content) or `416` (Requested Range Not Satisfiable) status code. Because the status code is neither of those, this `Content-Range` header may confuse caches and clients.
es: HTTP solo define el significado de la cabecera `Content-Range` en respuestas con un código de estado `206` (Contenido Parcial) o `416` (Rango Solicitado No Satisfecho). Dado que el código de estado no es ninguno de estos, esta cabecera `Content-Range` puede confundir a las cachés y a los clientes.
fr: HTTP ne définit la signification de l'en-tête `Content-Range` que pour les réponses avec un code d'état `206` (Contenu partiel) ou `416` (Plage demandée non satisfaite). Étant donné que le code d'état n'est ni l'un ni l'autre, cet en-tête `Content-Range` peut prêter à confusion pour les caches et les clients.
ja: HTTP は `206` (Partial Content) または `416` (Requested Range Not Satisfiable) のステータスコードを持つレスポンスにおける `Content-Range` ヘッダーの解釈のみを定義しています。 ステータスコードがそれらのいずれでもないため、この `Content-Range` ヘッダーはキャッシュやクライアントを混乱させる可能性があります。
zh: HTTP 仅在响应状态码为 `206` (部分内容) 或 `416` (请求范围不满足) 时定义 `Content-Range` 报头。 由于状态码不是这两者之一，此 `Content-Range` 报头可能会混淆缓存和客户端。

source: The Content-Range header is missing a unit (e.g., 'bytes').
es: La cabecera Content-Range está faltando un unitario (por ejemplo, 'bytes').
fr: La tête Content-Range manque d'unité (par exemple, 'octets').
