Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: A HTTP response is stale when its age (here, %(current_age)s) is equal to or exceeds its freshness lifetime (in this case, %(freshness_lifetime)s). There are a few reasons why a cache might serve a stale response: * HTTP allows stale responses to be used to satisfy requests in exceptional circumstances; e.g., when they lose contact with the origin server. This is subject to a number of requirements. * Response directives like `stale-if-error` and `stale-while-revalidate` explicitly allow stale responses to be used in particular circumstances. * Some caches are configured to ignore the response's freshness directives.
es: Una respuesta HTTP está obsoleta cuando su antigüedad (aquí, %(current_age)s) es igual o excede su vida útil de frescura (en este caso, %(freshness_lifetime)s). Hay varias razones por las que una caché podría servir una respuesta obsoleta: * HTTP permite que las respuestas obsoletas se utilicen para satisfacer solicitudes en circunstancias excepcionales; por ejemplo, cuando pierden el contacto con el servidor de origen. Esto está sujeto a una serie de requisitos. * Directivas de respuesta como `stale-if-error` y `stale-while-revalidate` permiten explícitamente que las respuestas obsoletas se utilicen en circunstancias particulares. * Algunas cachés están configuradas para ignorar las directivas de frescura de la respuesta.
fr: Une réponse HTTP est périmée lorsque son âge (ici, %(current_age)s) est égal ou supérieur à sa durée de fraîcheur (dans ce cas, %(freshness_lifetime)s). Plusieurs raisons peuvent expliquer pourquoi un cache sert une réponse périmée : * HTTP autorise l'utilisation de réponses périmées pour satisfaire des requêtes dans des circonstances exceptionnelles ; par exemple, lorsqu'elles perdent le contact avec le serveur d'origine. Ceci est soumis à un certain nombre d'exigences. * Les directives de réponse comme `stale-if-error` et `stale-while-revalidate` autorisent explicitement l'utilisation de réponses périmées dans des circonstances particulières. * Certains caches sont configurés pour ignorer les directives de fraîcheur de la réponse.
ja: HTTP レスポンスは、その Age（ここでは %(current_age)s）が Freshness Lifetime（この場合は %(freshness_lifetime)s）に等しいか、それを超えた場合に Stale（古くなった）とみなされます。 キャッシュが Stale なレスポンスを提供するのには、いくつかの理由があります。 * HTTP は、例外的な状況下で Stale なレスポンスを使用してリクエストを満たすことを許可しています。例として、オリジンサーバーとの連絡が途絶えた場合などです。これにはいくつかの要件が伴います。 * `stale-if-error` や `stale-while-revalidate` のようなレスポンスディレクティブは、特定の状況下で Stale なレスポンスの使用を明示的に許可しています。 * 一部のキャッシュは、レスポンスの Freshness ディレクティブを無視するように設定されています。
zh: 当 HTTP 响应的年龄（此处为 %(current_age)s）等于或超过其新鲜度寿命（此处为 %(freshness_lifetime)s）时，该响应即被视为陈旧。 缓存可能提供陈旧响应的原因有几种： * HTTP 允许在特殊情况下使用陈旧响应来满足请求；例如，当与源服务器失去联系时。这需要满足一些要求。 * `stale-if-error` 和 `stale-while-revalidate` 等响应指令明确允许在特定情况下使用陈旧响应。 * 一些缓存被配置为忽略响应的新鲜度指令。

source: This response allows caches to assign their own freshness lifetimes to it.
es: Esta respuesta permite a las cachés asignar sus propias vidas útiles de frescura.
fr: Cette réponse permet aux caches de lui attribuer leurs propres durées de vie de fraîcheur.
ja: このレスポンスは、キャッシュが独自の鮮度寿命を割り当てることを許可します。
zh: 此响应允许缓存为其分配自己的新鲜度寿命。

source: When a response doesn't have explicit freshness information (like a `Cache-Control: max-age` directive, or `Expires` header), caches are allowed to estimate how fresh it is using a heuristic (provided that the status code allows it). Caches often do this using the `Last-Modified` header. For example, if a response was last modified a week ago, a cache might consider it fresh for a day. Consider adding a `Cache-Control: max-age` header; otherwise, it may be cached for longer or shorter than you'd like.
es: Cuando una respuesta no tiene información de frescura explícita (como una directiva `Cache-Control: max-age` o la cabecera `Expires`), las cachés pueden estimar su frescura utilizando una heurística (siempre que el código de estado lo permita). Las cachés a menudo hacen esto utilizando la cabecera `Last-Modified`. Por ejemplo, si una respuesta se modificó por última vez hace una semana, una caché podría considerarla fresca durante un día. Considere agregar una cabecera `Cache-Control: max-age`; de lo contrario, podría ser cachead por más tiempo o menos tiempo del que le gustaría.
fr: Lorsqu'une réponse n'a pas d'informations explicites sur sa fraîcheur (comme une directive `Cache-Control: max-age`, ou un en-tête `Expires`), les caches sont autorisés à estimer sa fraîcheur en utilisant une heuristique (à condition que le `status code` le permette). Les caches font souvent cela en utilisant l'en-tête `Last-Modified`. Par exemple, si une réponse a été modifiée pour la dernière fois il y a une semaine, un cache pourrait la considérer comme fraîche pendant un jour. Envisagez d'ajouter un en-tête `Cache-Control: max-age`; sinon, elle pourrait être mise en cache plus longtemps ou moins longtemps que vous ne le souhaiteriez.
ja: 明確な鮮度情報（`Cache-Control: max-age` ディレクティブや `Expires` ヘッダーなど）がない場合、キャッシュはヒューリスティックを使用して鮮度を推定できます（ステータスコードが許可する場合）。 キャッシュはしばしば `Last-Modified` ヘッダーを使用してこれを行います。たとえば、応答が1週間前に最後に変更された場合、キャッシュは1日新鮮だと見なすかもしれません。 `Cache-Control: max-age` ヘッダーを追加することを検討してください。そうしないと、意図したよりも長く、または短くキャッシュされる可能性があります。
zh: 当响应没有显式的 freshness 信息时（例如 `Cache-Control: max-age` 指令或 `Expires` 头部），缓存可以根据启发式方法估算其 freshness（前提是状态码允许）。 缓存通常使用 `Last-Modified` 头部来完成此操作。例如，如果一个响应在过去一周被修改过，缓存可能会认为它一天内是 fresh 的。 请考虑添加 `Cache-Control: max-age` 头部；否则，它可能会被缓存比您期望的时间更长或更短。

source: This response cannot be considered fresh by caches.
es: Esta respuesta no puede considerarse fresca por las cachés.
fr: Cette réponse ne saurait être considérée comme fraîche par les caches.
ja: このレスポンスはキャッシュでフレッシュであるとはみなされません。
zh: 此响应无法被缓存视为新鲜。

source: This response doesn't have explicit freshness information (like a ` Cache-Control: max-age` directive, or `Expires` header), and this status code doesn't allow caches to calculate their own. Additionally, its status code doesn't allow caches to assign their own freshness lifetimes to it. Therefore, while caches might be allowed to store it, they generally can't use it, unless it can be served stale. As a result, many caches will not store the response at all, because it is not generally useful to do so.
es: Esta respuesta no tiene información explícita de frescura (como la directiva `Cache-Control: max-age` o la cabecera `Expires`), y este código de estado no permite a las cachés calcular la suya propia. Además, su código de estado no permite a las cachés asignarles sus propias vidas útiles de frescura. Por lo tanto, aunque las cachés puedan estar autorizadas a almacenarla, generalmente no podrán usarla, a menos que se pueda servir obsoleta. Como resultado, muchas cachés no almacenarán la respuesta en absoluto, porque no es generalmente útil hacerlo.
fr: Cette réponse ne contient pas d'informations explicites sur la fraîcheur (comme une directive `Cache-Control: max-age`, ou un en-tête `Expires`), et ce code de statut ne permet pas aux caches de calculer la leur. De plus, son code de statut ne permet pas aux caches de lui attribuer leurs propres durées de fraîcheur. Par conséquent, bien que les caches puissent être autorisés à la stocker, ils ne peuvent généralement pas l'utiliser, à moins qu'elle puisse être servie périmée. En conséquence, de nombreux caches ne stockeront pas du tout la réponse, car il n'est généralement pas utile de le faire.
ja: このレスポンスには、`Cache-Control: max-age` ディレクティブや `Expires` ヘッダーのような明示的な鮮度情報がありません。また、このステータスコードではキャッシュが独自に鮮度を計算することもできません。 さらに、このステータスコードでは、キャッシュが独自に鮮度ライフタイムを割り当てることもできません。 そのため、キャッシュは保存を許可されるかもしれませんが、通常は期限切れとして提供できる場合を除いて、使用することはできません。 結果として、多くのキャッシュでは、一般的に有用ではないため、このレスポンスをまったく保存しません。
zh: 此响应没有明确的新鲜度信息（如 `Cache-Control: max-age` 指令或 `Expires` 标头），且此状态码不允许缓存自行计算。 此外，其状态码也不允许缓存为其分配自己的新鲜度生命周期。 因此，虽然缓存可能允许存储它，但通常不能使用它，除非它可以被提供为陈旧内容。 结果是，许多缓存根本不会存储此响应，因为这样做通常没有用。

source: In exceptional circumstances, caches can serve this response stale.
es: En circunstancias excepcionales, las cachés pueden servir esta respuesta como obsoleta.
fr: Dans des circonstances exceptionnelles, les caches peuvent servir cette réponse périmée.
ja: 例外的な状況では、キャッシュはこのレスポンスを期限切れのまま提供することができます。
zh: 在特殊情况下，缓存可以提供此陈旧响应。

source: HTTP allows stale responses to be served in some circumstances; for example, if the origin server can't be contacted, a stale response can be used even if it doesn't have explicit freshness information available. This behaviour can be prevented by using the `Cache-Control: must-revalidate` response directive.
es: HTTP permite que se sirvan respuestas obsoletas en algunas circunstancias; por ejemplo, si no se puede contactar al servidor de origen, se puede usar una respuesta obsoleta incluso si no tiene información de frescura explícita disponible. Este comportamiento se puede prevenir usando la directiva de respuesta `Cache-Control: must-revalidate`.
fr: HTTP autorise la diffusion de réponses obsolètes dans certaines circonstances ; par exemple, si le serveur d'origine ne peut pas être contacté, une réponse obsolète peut être utilisée même si elle ne dispose pas d'informations explicites sur sa fraîcheur. Ce comportement peut être évité en utilisant la directive de réponse `Cache-Control: must-revalidate`.
ja: HTTPでは、場合によっては古いレスポンスを提供することが許可されています。例えば、オリジンサーバーに連絡できない場合、明示的な鮮度情報が利用できない場合でも、古いレスポンスを使用できます。 この動作は、`Cache-Control: must-revalidate` レスポンスディレクティブを使用することで防止できます。
zh: HTTP 在某些情况下允许提供过时的响应；例如，如果无法联系源服务器，即使过时的响应没有明确的有效性信息，也可以使用它。 可以通过使用 `Cache-Control: must-revalidate` 响应指令来阻止此行为。

source: If an error occurs, caches can serve this response stale.
es: Si ocurre un error, las cachés pueden servir esta respuesta como obsoleta.
fr: Si une erreur se produit, les caches peuvent servir cette réponse périmée.
ja: エラーが発生した場合、キャッシュはこのレスポンスを古い状態で提供することがあります。
zh: 如果发生错误，缓存可以提供此过时响应。

source: The `stale-if-error` cache directive allows a cache to return a stale response when an error (e.g., a 500 Internal Server Error, or a network timeout) is encountered while attempting to revalidate it. See [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) for more information.
es: La directiva de caché `stale-if-error` permite que una caché devuelva una respuesta obsoleta cuando se encuentra un error (por ejemplo, un 500 Internal Server Error, o un tiempo de espera de red) al intentar revalidarla. Consulte [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) para obtener más información.
fr: La directive de cache `stale-if-error` permet à un cache de renvoyer une réponse obsolète lorsqu'une erreur (par exemple, une erreur interne du serveur 500 ou un délai d'attente réseau) est rencontrée lors de sa révalidation. Voir la [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) pour plus d'informations.
ja: `stale-if-error` キャッシュディレクティブにより、キャッシュは、再検証の試行中にエラー（例：500 Internal Server Error、またはネットワークタイムアウト）が発生した場合に、古いレスポンスを返すことができます。 詳細については、[RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) を参照してください。
zh: `stale-if-error` 缓存指令允许缓存返回一个过时的响应，当在尝试重新验证时遇到错误（例如，500 内部服务器错误或网络超时）。 有关更多信息，请参阅 [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861)。

source: This response can be served stale from a cache while it is being revalidated.
es: Esta respuesta se puede servir obsoleta desde una caché mientras se está revalidando.
fr: Cette réponse peut être servie périmée depuis un cache pendant qu'elle est en cours de revalidation.
ja: このレスポンスは、再検証中にキャッシュから提供される場合に「stale」とみなされる可能性があります。
zh: 此响应在重新验证时可被陈旧缓存提供。

source: The `stale-while-revalidate` cache directive allows a cache to serve a stale response while a revalidation request is happening in the background. See [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) for more information.
es: La directiva de caché `stale-while-revalidate` permite que una caché sirva una respuesta obsoleta mientras se está realizando una solicitud de revalidación en segundo plano. Consulte [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) para obtener más información.
fr: La directive de cache `stale-while-revalidate` permet à un cache de servir une réponse obsolète pendant qu'une requête de revalidation est en cours en arrière-plan. Voir [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) pour plus d'informations.
ja: `stale-while-revalidate` キャッシュディレクティブにより、キャッシュはバックグラウンドで再検証リクエストが発生している間に、古いレスポンスを提供できます。 詳細については、[RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) を参照してください。
zh: `stale-while-revalidate` 缓存指令允许缓存提供陈旧响应，同时在后台进行重新验证请求。 有关更多信息，请参阅 [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861)。

source: This response cannot be served by a cache once it becomes stale.
es: Esta respuesta no puede ser servida por una caché una vez que se vuelve obsoleta.
fr: Cette réponse ne peut pas être servie par un cache une fois qu'elle est périmée.
ja: このレスポンスは、鮮度を失った後にキャッシュから提供することはできません。
zh: 一旦过期，此响应将无法被缓存提供。

source: The `Cache-Control: must-revalidate` directive forbids caches from using stale responses to satisfy requests. For example, caches often use stale responses when they cannot connect to the origin server; when this directive is present, they will return an error rather than a stale response.
es: La directiva `Cache-Control: must-revalidate` prohíbe que las cachés utilicen respuestas obsoletas para satisfacer solicitudes. Por ejemplo, las cachés a menudo utilizan respuestas obsoletas cuando no pueden conectarse al servidor de origen; cuando esta directiva está presente, devolverán un error en lugar de una respuesta obsoleta.
fr: La directive `Cache-Control: must-revalidate` interdit aux caches d'utiliser des réponses obsolètes pour satisfaire les requêtes. Par exemple, les caches utilisent souvent des réponses obsolètes lorsqu'ils ne peuvent pas se connecter au serveur d'origine ; lorsque cette directive est présente, ils renvoient une erreur plutôt qu'une réponse obsolète.
ja: `Cache-Control: must-revalidate` ディレクティブは、キャッシュが期限切れのレスポンスを使用してリクエストを満たすことを禁止します。 たとえば、キャッシュはオリジンサーバーに接続できない場合に期限切れのレスポンスを使用することがよくありますが、このディレクティブが存在する場合、期限切れのレスポンスを返すのではなくエラーを返します。
zh: `Cache-Control: must-revalidate` 指令禁止缓存使用过期的响应来满足请求。 例如，当缓存无法连接到源服务器时，它们通常会使用过期的响应；当存在此指令时，它们将返回错误而不是过期的响应。

source: This response cannot be served by a cache now that it is stale.
es: Esta respuesta no puede ser servida por una caché ahora que está obsoleta.
fr: Cette réponse ne peut pas être servie par un cache maintenant qu'elle est périmée.
ja: このレスポンスは、キャッシュが無効になったため、キャッシュから提供できません。
zh: 此响应已过期，无法由缓存提供服务。

source: This response cannot be served by a shared cache once it becomes stale.
es: Esta respuesta no puede ser servida por una caché compartida una vez que esté obsoleta.
fr: Cette réponse ne peut pas être servie par un cache partagé une fois qu'elle devient périmée.
ja: このレスポンスは、鮮度を失った後は共有キャッシュで提供できません。
zh: 此响应在过时后无法通过共享缓存提供服务。

source: The presence of the `Cache-Control: proxy-revalidate` and/or `s-maxage` directives forbids shared caches (e.g., proxy caches) from using stale responses to satisfy requests. For example, caches often use stale responses when they cannot connect to the origin server; when this directive is present, they will return an error rather than a stale response. These directives do not affect private caches; for example, those in browsers.
es: La presencia de las directivas `Cache-Control: proxy-revalidate` y/o `s-maxage` prohíbe a las cachés compartidas (por ejemplo, cachés de proxy) usar respuestas obsoletas para satisfacer solicitudes. Por ejemplo, las cachés a menudo usan respuestas obsoletas cuando no pueden conectarse al servidor de origen; cuando esta directiva está presente, devolverán un error en lugar de una respuesta obsoleta. Estas directivas no afectan a las cachés privadas; por ejemplo, las de los navegadores.
fr: La présence des directives `Cache-Control: proxy-revalidate` et/ou `s-maxage` interdit aux caches partagés (par exemple, les caches proxy) d'utiliser des réponses obsolètes pour satisfaire les requêtes. Par exemple, les caches utilisent souvent des réponses obsolètes lorsqu'ils ne peuvent pas se connecter au serveur d'origine ; lorsque cette directive est présente, ils renverront une erreur plutôt qu'une réponse obsolète. Ces directives n'affectent pas les caches privés ; par exemple, ceux des navigateurs.
ja: `Cache-Control: proxy-revalidate` または `s-maxage` ディレクティブが存在すると、共有キャッシュ（例：プロキシキャッシュ）が期限切れのレスポンスを使用してリクエストを処理することが禁じられます。 たとえば、キャッシュはオリジンサーバーに接続できない場合に、しばしば期限切れのレスポンスを使用します。このディレクティブが存在すると、期限切れのレスポンスを返すのではなく、エラーが返されます。 これらのディレクティブは、プライベートキャッシュ（例：ブラウザのキャッシュ）には影響しません。
zh: `Cache-Control: proxy-revalidate` 和/或 `s-maxage` 指令的存在禁止共享缓存（例如，代理缓存）使用过时的响应来满足请求。 例如，当缓存无法连接到源服务器时，它们通常会使用过时的响应；当此指令存在时，它们将返回错误而不是过时的响应。 这些指令不会影响私有缓存；例如，浏览器中的缓存。

source: This response cannot be served by a shared cache now that it is stale.
es: Esta respuesta no puede ser servida por una caché compartida ahora que está obsoleta.
fr: Cette réponse ne peut pas être servie par un cache partagé maintenant qu'elle est périmée.
ja: このレスポンスは、共有キャッシュでは提供できません。鮮度が低下しています。
zh: 此响应已过期，现在无法由共享缓存提供服务。

source: Cache-Control: max-age and Expires are both present.
es: Cache-Control: max-age y Expires están presentes.
fr: Cache-Control: max-age et Expires sont tous deux présents.
ja: Cache-Control: max-age と Expires の両方が存在します。
zh: Cache-Control：同时存在 max-age 和 Expires。

source: The `Cache-Control: max-age` directive and the `Expires` header are both present. `max-age` takes precedence over `Expires`, so `Expires` is redundant and can be removed.
es: La directiva `Cache-Control: max-age` y la cabecera `Expires` están ambas presentes. `max-age` tiene prioridad sobre `Expires`, por lo que `Expires` es redundante y se puede eliminar.
fr: La directive `Cache-Control: max-age` et l'en-tête `Expires` sont tous deux présents. `max-age` a la priorité sur `Expires`, `Expires` est donc redondant et peut être supprimé.
ja: `Cache-Control: max-age` ディレクティブと `Expires` ヘッダーが両方存在します。 `max-age` は `Expires` よりも優先されるため、`Expires` は冗長であり削除できます。
zh: `Cache-Control: max-age` 指令和 `Expires` 标头同时存在。 `max-age` 优先于 `Expires`，因此 `Expires` 是多余的，可以移除。

source: This message was compressed, but the GZIP header wasn't valid.
es: Este mensaje fue comprimido, pero la cabecera GZIP no era válida.
fr: Ce message a été compressé, mais l'en-tête GZIP n'était pas valide.
ja: このメッセージは圧縮されましたが、GZIPヘッダーが無効でした。
zh: 此消息已压缩，但 GZIP 标头无效。

source: GZip-compressed responses have a header that contains metadata. Here, that header wasn't valid; the error encountered was "`%(gzip_error)s`".
es: Las respuestas GZip comprimidas tienen una cabecera que contiene metadatos. Aquí, esa cabecera no era válida; el error encontrado fue "`%(gzip_error)s`".
fr: Les réponses compressées GZip ont un en-tête qui contient des métadonnées. Ici, cet en-tête n'était pas valide ; l'erreur rencontrée était « `%(gzip_error)s` ».
ja: GZip圧縮されたレスポンスにはメタデータを含むヘッダーがあります。ここでは、そのヘッダーが無効でした。発生したエラーは「`%(gzip_error)s`」でした。
zh: GZip 压缩的响应包含一个包含元数据的头部。此处，该头部无效；遇到的错误是“%(gzip_error)s””。

source: This message was compressed using GZip, but the data was corrupt.
es: Este mensaje fue comprimido usando GZip, pero los datos estaban corruptos.
fr: Ce message a été compressé par GZip, mais les données étaient corrompues.
ja: このメッセージはGZipで圧縮されましたが、データが破損していました。
zh: 该消息使用 GZip 进行了压缩，但数据已损坏。

source: GZip-compressed responses use zlib compression to reduce the number of bytes transferred on the wire. However, this response could not be decompressed; the error encountered was "`%(zlib_error)s`". %(ok_zlib_len)s bytes were decompressed successfully before this; the erroneous chunk starts with (in hex): %(chunk_sample)s
es: Las respuestas comprimidas con GZip utilizan la compresión zlib para reducir el número de bytes transferidos por la red. Sin embargo, esta respuesta no pudo ser descomprimida; el error encontrado fue "`%(zlib_error)s`". Se descomprimieron %(ok_zlib_len)s bytes correctamente antes de esto; el fragmento erróneo comienza con (en hexadecimal): %(chunk_sample)s
fr: Les réponses compressées GZip utilisent la compression zlib pour réduire le nombre d'octets transférés sur le réseau. Cependant, cette réponse n'a pas pu être décompressée ; l'erreur rencontrée était "`%(zlib_error)s`". %(ok_zlib_len)s octets ont été décompressés avec succès avant cela ; le fragment erroné commence par (en hexadécimal) : %(chunk_sample)s
ja: GZip圧縮されたレスポンスは、転送されるバイト数を削減するためにzlib圧縮を使用しています。しかし、このレスポンスは解凍できませんでした。発生したエラーは「`%(zlib_error)s`」です。 %(ok_zlib_len)s バイトは正常に解凍されました。エラーのあるチャンクは、(16進数で)以下で始まります。 %(chunk_sample)s
zh: GZip 压缩的响应使用 zlib 压缩来减少传输的字节数。但是，此响应未能解压缩；遇到的错误是：“%(zlib_error)s” %(ok_zlib_len)s 字节已成功解压缩；错误块以十六进制开头： %(chunk_sample)s

source: This message was compressed using Brotli, but the data was corrupt.
es: Este mensaje se comprimiron usando Brotli, pero los datos estaban corruptos.
fr: Ce message a été compressé avec Brotli, mais les données sont corrompues.

source: Brotli-compressed responses use brotli compression to reduce the number of bytes transferred on the wire. However, this response could not be decompressed; the error encountered was "`%(brotli_error)s`". %(ok_brotli_len)s bytes were decompressed successfully before this; the erroneous chunk starts with (in hex): %(chunk_sample)s
es: Respuestas Brotli-comprimidas utilizan la compresión Brotli para reducir la cantidad de bytes transferidos por el cable. Sin embargo, esta respuesta no pudo descomprimirse; el error encontrado fue: `%(brotli_error)s`. Se descomprimieron correctamente %(ok_brotli_len)s bytes antes de esto; el fragmento erráneo comienza con (en hexadecimal): `%(chunk_sample)s`
fr: Les réponses compressées Brotli utilisent la compression Brotli pour réduire le nombre de octets transférés sur le circuit. Cependant, cette réponse n'a pas pu être décompressée ; l'erreur rencontrée était "`%(brotli_error)s`". %(ok_brotli_len)s octets ont pu être décompressés avec succès avant cela ; la partie défectueuse commence par (en hex) : %(chunk_sample)s

source: The content doesn't match the declared Content-Type.
es: El contenido no coincide con el Content-Type declarado.
fr: Le contenu ne correspond pas au Content-Type déclaré.
ja: Content-Typeで宣言された値とコンテンツが一致しません。
zh: 内容与声明的 Content-Type 不符。

source: The `Content-Type` header declares the content as `%(declared_type)s`, but it looks like `%(sniffed_type)s`.
es: La cabecera `Content-Type` declara el contenido como `%(declared_type)s`, pero parece ser `%(sniffed_type)s`.
fr: L'en-tête `Content-Type` déclare le contenu comme étant `%(declared_type)s`, mais il semble être `%(sniffed_type)s`.
ja: `Content-Type` ヘッダーはコンテンツを `%(declared_type)s` として宣言していますが、 `%(sniffed_type)s` のようです。
zh: `Content-Type` 标头声明内容为 `%(declared_type)s`，但实际内容看起来是 `%(sniffed_type)s`。

source: The Content-Length header is correct.
es: El encabezado Content-Length es correcto.
fr: L'en-tête Content-Length est correct.
ja: Content-Length ヘッダーは正しいです。
zh: Content-Length 头是正确的。

source: `Content-Length` is used by HTTP to delimit messages; that is, to mark the end of one message and the beginning of the next.
es: `Content-Length` es usado por HTTP para delimitar mensajes; es decir, para marcar el final de un mensaje y el principio del siguiente.
fr: `Content-Length` est utilisé par HTTP pour délimiter les messages ; c'est-à-dire, pour marquer la fin d'un message et le début du suivant.
ja: `Content-Length` は、HTTP がメッセージを区切るために使用されます。つまり、あるメッセージの終わりと次のメッセージの始まりを示します。
zh: `Content-Length` 用于 HTTP 来分隔消息；也就是说，它标志着一条消息的结束和下一条消息的开始。

source: The Content-Length header is incorrect.
es: La cabecera Content-Length es incorrecta.
fr: L'en-tête Content-Length est incorrect.
ja: Content-Length ヘッダーが正しくありません。
zh: Content-Length 标头不正确。
