Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: The `Warning` response header was used to carry additional information about the status or transformation of a message that might not be reflected in it. It has been deprecated.
es: El encabezado de respuesta `Warning` se utilizaba para transmitir información adicional sobre el estado o la transformación de un mensaje que podría no reflejarse en él. Ha sido obsoleto.
ja: `Warning` レスポンスヘッダーは、メッセージに反映されない可能性のあるステータスまたは変換に関する追加情報を伝達するために使用されていました。このヘッダーは非推奨となりました。

source: The `WWW-Authenticate` response header consists of at least one challenge that indicates the authentication scheme(s) and parameters applicable.
es: La cabecera de respuesta `WWW-Authenticate` consiste en al menos un desafío que indica los esquemas de autenticación y los parámetros aplicables.
ja: `WWW-Authenticate` レスポンスヘッダーは、適用可能な認証スキームとパラメータを示す少なくとも1つのチャレンジで構成されます。

source: The `X-Cache` response header is used by some caches to indicate whether or not the response was served from cache; if it contains `HIT`, it was.
es: La cabecera de respuesta `X-Cache` es utilizada por algunas cachés para indicar si la respuesta fue o no servida desde la caché; si contiene `HIT`, lo fue.
ja: `X-Cache` レスポンスヘッダーは、一部のキャッシュでレスポンスがキャッシュから提供されたかどうかを示すために使用されます。`HIT` が含まれている場合、キャッシュから提供されました。

source: The `X-Cache-Lookup` response header is used by some caches to show whether there was a response in cache for this URL; if it contains `HIT`, it was in cache (but not necessarily used).
es: La cabecera de respuesta `X-Cache-Lookup` es utilizada por algunas cachés para mostrar si hubo una respuesta en caché para esta URL; si contiene `HIT`, estuvo en caché (pero no necesariamente se usó).
ja: `X-Cache-Lookup` レスポンスヘッダーは、一部のキャッシュがこのURLに対するレスポンスがキャッシュにあったかどうかを示すために使用されます。`HIT` が含まれている場合、キャッシュにありましたが（必ずしも使用されたとは限りません）。

source: Indicates that the client should not 'sniff' the `Content-Type` of the message from its content.
es: Indica que el cliente no debe 'deducir' el `Content-Type` del mensaje a partir de su contenido.
ja: クライアントがメッセージの `Content-Type` をコンテンツから「推測」しないことを示します。

source: This response instructs browsers not to 'sniff' its media type.
es: Esta respuesta instruye a los navegadores a no 'olfatear' su tipo de medio.
fr: Cette réponse indique aux navigateurs de ne pas 'deviner' son type de média.
ja: このレスポンスは、ブラウザにメディアタイプを「スニッフィング」しないように指示します。
zh: 此响应指示浏览器不要“嗅探”其媒体类型。

source: Many Web browsers "sniff" the media type of responses to figure out whether they're HTML, RSS or another format, no matter what the `Content-Type` header says. This header instructs browsers not to do this, but to always respect the Content-Type header. It probably won't have any effect in other clients. See [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options) for more information about this header.
es: Muchos navegadores web "detectan" el tipo de medio de las respuestas para averiguar si son HTML, RSS u otro formato, sin importar lo que diga la cabecera `Content-Type`. Esta cabecera instruye a los navegadores a no hacer esto, sino a respetar siempre la cabecera Content-Type. Probablemente no tendrá ningún efecto en otros clientes. Ver [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options) para más información sobre esta cabecera.
fr: De nombreux navigateurs Web "analysent" le type de média des réponses pour déterminer s'il s'agit de HTML, de RSS ou d'un autre format, quelle que soit la valeur de l'en-tête `Content-Type`. Cet en-tête demande aux navigateurs de ne pas le faire, mais de toujours respecter l'en-tête `Content-Type`. Il n'aura probablement aucun effet sur d'autres clients. Consultez [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options) pour plus d'informations sur cet en-tête.
ja: 多くのWebブラウザは、`Content-Type` ヘッダーが何と指示していても、レスポンスのメディアタイプを「スニッフィング」して、それがHTMLなのかRSSなのか、あるいは他のフォーマットなのかを判断します。 このヘッダーは、ブラウザにこのようなスニッフィングをしないように指示し、常にContent-Typeヘッダーを尊重させるものです。他のクライアントでは効果がない可能性が高いです。 このヘッダーに関する詳細については、[MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options) を参照してください。
zh: 许多 Web 浏览器会“嗅探”响应的媒体类型，以确定它是 HTML、RSS 还是其他格式，而不管 `Content-Type` 标头说了什么。 此标头指示浏览器不要这样做，而是始终遵守 `Content-Type` 标头。它可能不会在其他客户端中产生任何影响。 有关此标头的更多信息，请参阅 [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options)。

source: X-Content-Type-Options contains an unknown value.
es: X-Content-Type-Options contiene un valor desconocido.
fr: X-Content-Type-Options contient une valeur inconnue.
ja: X-Content-Type-Options に未知の値が含まれています。
zh: X-Content-Type-Options 包含一个未知值。

source: Only one value is currently defined for this header, `nosniff`. Using other values here won't necessarily cause problems, but they probably won't have any effect either. See [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options) for more information about this header.
es: Actualmente solo se define un valor para esta cabecera, `nosniff`. Usar otros valores aquí no necesariamente causará problemas, pero es probable que tampoco tengan ningún efecto. Vea [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options) para más información sobre esta cabecera.
fr: Une seule valeur est actuellement définie pour cet en-tête, `nosniff`. L'utilisation d'autres valeurs ici n'entraînera pas nécessairement de problèmes, mais elle n'aura probablement aucun effet non plus. Consultez [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options) pour plus d'informations sur cet en-tête.
ja: このヘッダーには現在 `nosniff` という 1 つの値のみが定義されています。他の値を使用しても、必ずしも問題が発生するわけではありませんが、効果がない可能性が高いです。 このヘッダーの詳細については、[MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options) を参照してください。
zh: 此标头目前仅定义了一个值 `nosniff`。在此处使用其他值不一定会导致问题，但很可能也不会产生任何效果。 有关此标头的更多信息，请参阅 [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options)。

source: This response prevents some browsers from rendering it within a frame.
es: Esta respuesta evita que algunos navegadores la rendericen dentro de un frame.
fr: Cette réponse empêche certains navigateurs de l'afficher dans un cadre.
ja: このレスポンスにより、一部のブラウザでのフレーム内レンダリングが防止されます。
zh: 此响应可阻止部分浏览器将其渲染在框架内。

source: The `X-Frame-Options` response header controls how IE8 handles HTML frames; the `DENY` value prevents this content from being rendered within a frame, which defends against certain types of attacks. See [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) for more information.
es: El encabezado de respuesta `X-Frame-Options` controla cómo IE8 maneja los marcos HTML; el valor `DENY` impide que este contenido se renderice dentro de un marco, lo que defiende contra ciertos tipos de ataques. Ver [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) para más información.
fr: L'en-tête de réponse `X-Frame-Options` contrôle la façon dont IE8 gère les cadres HTML ; la valeur `DENY` empêche que ce contenu ne soit rendu dans un cadre, ce qui protège contre certains types d'attaques. Voir [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) pour plus d'informations.
ja: `X-Frame-Options` レスポンスヘッダーは、IE8 が HTML フレームをどのように処理するかを制御します。`DENY` 値は、このコンテンツがフレーム内でレンダリングされるのを防ぎ、特定の種類の攻撃から保護します。 詳細については、[MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) を参照してください。
zh: `X-Frame-Options` 响应头控制 IE8 如何处理 HTML 框架；`DENY` 值可防止此内容在框架内渲染，从而防御某些类型的攻击。 有关更多信息，请参阅 [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options)。

source: This response prevents some browsers from rendering it within a frame on another site.
es: Esta respuesta impide que algunos navegadores la rendericen dentro de un frame en otro sitio.
fr: Cette réponse empêche certains navigateurs de l'afficher dans un cadre sur un autre site.
ja: このレスポンスは、一部のブラウザが別のサイトでフレーム内にレンダリングすることを防ぎます。
zh: 此响应可阻止某些浏览器在其网站框架中呈现它。

source: The `X-Frame-Options` response header controls how IE8 handles HTML frames; the `DENY` value prevents this content from being rendered within a frame on another site, which defends against certain types of attacks. Currently this is supported by IE8 and Safari 4. See [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) for more information.
es: La cabecera de respuesta `X-Frame-Options` controla cómo IE8 maneja los marcos HTML; el valor `DENY` impide que este contenido se muestre dentro de un marco en otro sitio, lo que se defiende contra ciertos tipos de ataques. Actualmente esto está soportado por IE8 y Safari 4. Consulta [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) para más información.
fr: L'en-tête de réponse `X-Frame-Options` contrôle la façon dont IE8 gère les cadres HTML ; la valeur `DENY` empêche ce contenu d'être rendu dans un cadre sur un autre site, ce qui protège contre certains types d'attaques. Actuellement, cela est pris en charge par IE8 et Safari 4. Voir [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) pour plus d'informations.
ja: `X-Frame-Options` レスポンスヘッダーは、IE8 が HTML フレームをどのように処理するかを制御します。`DENY` 値は、このコンテンツが他のサイトのフレーム内でレンダリングされるのを防ぎ、特定の種類の攻撃から保護します。 現在、これは IE8 と Safari 4 でサポートされています。 詳細については、[MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) を参照してください。
zh: `X-Frame-Options` 响应头控制 IE8 如何处理 HTML 框架；`DENY` 值可以防止此内容在其他网站的框架中呈现，从而防御某些类型的攻击。 目前 IE8 和 Safari 4 支持此功能。 有关更多信息，请参阅 [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options)。

source: The X-Frame-Options header contains an unknown value.
es: La cabecera X-Frame-Options contiene un valor desconocido.
fr: L'en-tête X-Frame-Options contient une valeur inconnue.
ja: X-Frame-Options ヘッダーに不明な値が含まれています。
zh: X-Frame-Options 标头包含一个未知值。

source: Only two values are currently defined for this header, `DENY` and `SAMEORIGIN`. Using other values here won't necessarily cause problems, but they probably won't have any effect either. See [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) for more information.
es: Actualmente solo se definen dos valores para esta cabecera, `DENY` y `SAMEORIGIN`. Usar otros valores aquí no necesariamente causará problemas, pero probablemente tampoco tendrán ningún efecto. Ver [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) para más información.
fr: Seules deux valeurs sont actuellement définies pour cet en-tête : `DENY` et `SAMEORIGIN`. L'utilisation d'autres valeurs ici n'entraînera pas nécessairement de problèmes, mais elles n'auront probablement aucun effet non plus. Voir [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) pour plus d'informations.
ja: このヘッダーには現在、`DENY` と `SAMEORIGIN` の2つの値のみが定義されています。これら以外の値を使用しても、必ずしも問題が発生するわけではありませんが、効果もない可能性が高いです。 詳細については、[MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) を参照してください。
zh: 该标头目前仅定义了两个值：`DENY` 和 `SAMEORIGIN`。在此使用其他值不一定会导致问题，但它们可能也没有任何效果。 有关更多信息，请参阅 [MDN](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options)。

source: General
fr: Général
ja: 一般
zh: 通用

source: Cross-Origin Resource Sharing
fr: Partage des ressources entre origines

source: This is a CORS preflight request.
fr: Ce requête est un pre-vol CORS.

source: This is a Cross-Origin Resource Sharing (CORS) preflight request. A preflight request uses the `OPTIONS` method and includes an `Origin` and `Access-Control-Request-Method` header.
fr: Ce sont des requêtes CORS (Cross-Origin Resource Sharing) prévol. Une requête prévol utilise la méthode `OPTIONS` et inclut les en-têtes `Origin` et `Access-Control-Request-Method`.

source: The %(field_name)s header requires the OPTIONS method.
fr: La %(field_name)s requiert la méthode OPTIONS.

source: This is a CORS preflight response.
fr: Ceci est une réponse de pré-vol CORS.

source: This is a Cross-Origin Resource Sharing (CORS) preflight response. It is a response to an `OPTIONS` request that includes an `Origin` and `Access-Control-Request-Method` header.
fr: Cette réponse est un prévol de partage de ressources inter-origines (CORS). Elle est une réponse à une requête `OPTIONS` qui inclut un en-tête `Origin` et `Access-Control-Request-Method`.

source: CORS headers are only allowed in preflight responses.
fr: Les en-têtes CORS ne sont autorisés que dans les réponses de pré-vol.

source: The following header(s) are only used in the response to a Cross-Origin Resource Sharing (CORS) preflight request: %(headers)s A preflight request is an `OPTIONS` request that includes an `Origin` header and an `Access-Control-Request-Method` header. This response was not to a CORS preflight request, so these headers should not be present.
fr: Les en-têtes suivants ne sont utilisés qu'en réponse à une demande de prévol Cross-Origin Resource Sharing (CORS) : %(headers)s Une demande de prévol est une demande « OPTIONS » qui comprend un en-tête « Origin » et un « Access-Control-Request-Method ». Cette réponse n'était pas une demande de prévol CORS, donc ces en-têtes ne devraient pas être présents.

source: The Access-Control-Allow-Origin header allows the requesting origin.
fr: L'en-tête Access-Control-Allow-Origin autorise l'origine demandant.

source: The `Access-Control-Allow-Origin` header matches the `Origin` header in the request (%(origin)s). This means that the browser will let the requesting site access the response.
fr: La tête `Access-Control-Allow-Origin` correspond à la tête `Origin` dans la requête (%(origin)s). Cela signifie que le navigateur autorisera le site demandant à accéder à la réponse.

source: The Access-Control-Allow-Origin header does not allow the requesting origin.
fr: La directive Access-Control-Allow-Origin dans l'en-tête HTTP ne permet pas à l'origine requérante.

source: The `Access-Control-Allow-Origin` header (%(acao_value)s) does not match the `Origin` header in the request (%(origin)s). This means that the browser will **not** let the requesting site access the response.
fr: La tête `Access-Control-Allow-Origin` (%(acao_value)s) ne correspond pas à la tête `Origin` de la requête (%(origin)s). Cela signifie que le navigateur **ne permettra pas** au site demandant d'accéder à la réponse.

source: The Access-Control-Allow-Origin header does not allow any origin.
fr: Le header Access-Control-Allow-Origin ne permet aucun origin.

source: The `Access-Control-Allow-Origin` header is set to `null`; this means that no origin can access the response.
fr: Le `Access-Control-Allow-Origin` header est défini sur `null`; cela signifie qu'aucune origine ne peut accéder à la réponse.

source: The Access-Control-Allow-Origin header allows any origin.
fr: La tête Access-Control-Allow-Origin permet n'importe quelle origine.

source: The `Access-Control-Allow-Origin` header is set to `*`; this means that any origin can access the response, unless the request includes credentials or requires a preflight check.
fr: La tête Access-Control-Allow-Origin est définie sur « * » ; cela signifie que n'importe quelle origine peut accéder à la réponse, sauf si la demande inclut des informations d'identification ou nécessite un contrôle préalable.

source: The following fields appear in `Accept-CH` but are not listed in the `Vary` header: %(missing_fields)s, even though the response is cacheable. Because these fields can affect the response content, they should be included in `Vary` to ensure that caches store separate responses for different client hints.
fr: Les champs suivants apparaissent dans `Accept-CH` mais ne sont pas répertoriés dans l'en-tête `Vary` : %(missing_fields)s, même si la réponse est cacheable. Comme ces champs peuvent affecter le contenu de la réponse, ils doivent être inclus dans `Vary` pour garantir que les caches stockent des réponses distinctes pour les différents indices client.

source: The value for this field doesn't conform to its specified syntax; it will likely be ignored by browsers. See [its definition](%(ref_uri)s) for more information.
fr: La valeur de ce champ ne respecte pas sa syntaxe spécifiée ; elle risque d'être ignorée par les navigateurs. Consultez [sa définition](%(ref_uri)s) pour plus d'informations.

source: Access-Control-Max-Age must be an integer.
fr: Access-Control-Max-Age doit être un entier.

source: The `Access-Control-Max-Age` header indicates how many seconds a preflight response can be cached for. It must be a non-negative integer.
fr: La directive `Access-Control-Max-Age` indique en secondes combien de temps la réponse d'une requête préflight peut être mise en cache. Elle doit être un entier non négatif.

source: Access-Control-Max-Age must be non-negative.
fr: Access-Control-Max-Age doit être non négatif.

source: The `Access-Control-Max-Age` header indicates how many seconds a preflight response can be cached for. It cannot be less than zero.
fr: La tête `Access-Control-Max-Age` indique le nombre de secondes qu'une réponse de prévol peut être mise en cache. Il ne peut pas être inférieur à zéro.

source: Content-Length should be an integer.
fr: La longueur du contenu doit être un entier.

source: The `Content-Length` header should be an integer, but it was not.
fr: La tête `Content-Length` devrait être un entier, mais ce n'était pas le cas.

source: The reporting endpoint '%(value)s' is not defined.
fr: Le point de terminaison de rapport '%(value)s' n'est pas défini.

source: The Origin header contains multiple values.
fr: Le champ d'en-tête Origin contient plusieurs valeurs.

source: The `Origin` header should only contain a single value. Any values after the first will be ignored.
fr: La `Origin` header ne doit contenir qu'une seule valeur. Les valeurs suivantes seront ignorées.

source: Only one %(field_name)s field is allowed in a response's headers.
ja: レスポンスのヘッダーには、%(field_name)s フィールドを1つだけ含めることができます。
zh: 响应头中只允许一个 %(field_name)s 字段。

source: The %(field_name)s field value isn't valid.
ja: %(field_name)s フィールドの値が無効です。
zh: %(field_name)s 字段的值无效。

source: The %(field_name)s field is defined as a [Structured Field](https://www.rfc-editor.org/rfc/rfc9651.html), but its value can't be parsed as one. As a result, this field is likely to be ignored. The parser reports this error: %(error)s.
ja: %(field_name)s フィールドは[構造化フィールド](https://www.rfc-editor.org/rfc/rfc9651.html)として定義されていますが、その値を構造化フィールドとして解析できませんでした。その結果、このフィールドは無視される可能性が高いです。 パーサーは次のエラーを報告しました: %(error)s.
zh: 字段 %(field_name)s 定义为 [结构化字段](https://www.rfc-editor.org/rfc/rfc9651.html)， 但其值无法解析为结构化字段。因此，该字段很可能 被忽略。 解析器报告此错误： %(error)s。

source: "%(field_name)s" is a request header.
ja: 「%(field_name)s」はリクエストヘッダーです。
zh: "%(field_name)s" 是一个请求头。

source: The %(field_name)s field isn't defined to have any meaning in responses.
ja: %(field_name)s フィールドは、レスポンスにおいて意味を持つように定義されていません。
zh: “%(field_name)s”字段在响应中未定义任何含义。

source: The %(field_name)s field isn't defined to have any meaning in requests.
ja: リクエストにおいて、%(field_name)s フィールドには意味が定義されていません。
zh: “%(field_name)s” 字段在请求中未定义任何含义。

source: This field is no longer recommended for use, because of interoperability problems and/or lack of use. See [the deprecation notice](%(deprecation_ref)s) for more information.
ja: このフィールドは、相互運用の問題および/または使用されていないため、現在非推奨です。 詳細については、[非推奨通知](%(deprecation_ref)s)を参照してください。
zh: 此字段不再推荐使用，因为存在互操作性问题和/或未使用。 有关更多信息，请参阅[弃用通知](%(deprecation_ref)s)。

source: The `Access-Control` header was an experimental header for controlling access to resources. It is obsolete and should not be used.
ja: `Access-Control` ヘッダーは、リソースへのアクセスを制御するための実験的なヘッダーでした。 これは廃止されており、使用しないでください。

source: The `Access-Control-Allow-Credentials` response header tells browsers whether to expose the response to frontend code when the request's credentials mode (`Request.credentials`) is `include`.
ja: `Access-Control-Allow-Credentials` レスポンスヘッダーは、リクエストのクレデンシャルモード (`Request.credentials`) が `include` の場合に、ブラウザがフロントエンドコードにレスポンスを公開するかどうかをブラウザに伝えます。

source: The `Access-Control-Allow-Origin` response header indicates whether the response can be shared with requesting code from the given origin.
ja: `Access-Control-Allow-Origin` レスポンスヘッダーは、指定されたオリジンからのリクエストコードとレスポンスを共有できるかどうかを示します。

source: The `Access-Control-Max-Age` response header indicates how long the results of a CORS preflight request (as scoped by the `Access-Control-Allow-Methods` and `Access-Control-Allow-Headers` request headers) can be cached.
ja: `Access-Control-Max-Age` レスポンスヘッダーは、CORSプリフライトリクエストの結果（`Access-Control-Allow-Methods` および `Access-Control-Allow-Headers` リクエストヘッダーによってスコープされる）をどのくらいの期間キャッシュできるかを示します。

source: The `Access-Control-Request-Method` request header is used by browsers when issuing a CORS preflight request, to let the server know which HTTP method will be used when the actual request is made.
ja: ブラウザはCORSプリフライトリクエストを発行する際に、`Access-Control-Request-Method` リクエストヘッダーを使用して、実際のリクエストでどのHTTPメソッドが使用されるかをサーバーに通知します。

source: The `Age` response header conveys the sender's estimate of the amount of time since the response (or its validation) was generated at the origin server.
ja: `Age` レスポンスヘッダーは、レスポンス（またはその検証）がオリジンサーバーで生成されてからの経過時間を送信者が推定した値を示します。

source: The `Authorization` header field allows a user agent to authenticate itself with an origin server -- usually, but not necessarily, after receiving a 401 (Unauthorized) response.
ja: `Authorization` ヘッダーフィールドは、ユーザーエージェントがオリジンサーバーに対して自身を認証することを許可します。通常、401 (Unauthorized) レスポンスを受信した後ですが、必ずしもそうとは限りません。

source: The %(bad_directive)s cache directive's syntax is incorrect.
ja: %(bad_directive)s キャッシュディレクティブの構文が正しくありません。
zh: %(bad_directive)s 缓存指令的语法不正确。

source: This value must be an integer.
ja: この値は整数である必要があります。
zh: 此值必须是整数。

source: The `Cache-Status` header field indicates how caches have handled the response, to help with debugging caches.
ja: `Cache-Status` ヘッダーフィールドは、キャッシュのデバッグを支援するために、キャッシュがレスポンスをどのように処理したかを示します。

source: The `%(field_name)s` field usually means that a HTTP load balancer, proxy or other intermediary in front of the server has rewritten the `Connection` header, to allow it to insert its own. Usually, this is done so that clients won't see `Connection: close` so that the connection can be reused. It takes this form because the most efficient way of assuring that clients don't see the header is to rearrange or change individual characters in its name.
ja: `%(field_name)s` フィールドは通常、サーバーの前面にある HTTP ロードバランサー、プロキシ、またはその他の仲介者が、独自のヘッダーを挿入できるように `Connection` ヘッダーを書き換えたことを意味します。 通常、これは、クライアントが `Connection: close` を見ないようにするためであり、接続を再利用できるようにするためです。 ヘッダーの名前の個々の文字を並べ替えたり変更したりするのが、クライアントがヘッダーを見ないようにする最も効率的な方法であるため、この形式になります。

source: The `Content-Base` header established the base URI of the message. It has been deprecated, because it was not implemented widely.
ja: `Content-Base` ヘッダーは、メッセージのベース URI を確立します。広く実装されなかったため、非推奨になりました。

source: The `Content-Disposition` header suggests a name to use when saving the file. When the disposition (the first value) is set to `attachment`, it also prompts browsers to download the file, rather than display it.
ja: `Content-Disposition`ヘッダーは、ファイルを保存する際に使用する名前を示唆します。 disposition（最初の値）が `attachment` に設定されている場合、ブラウザはファイルをダウンロードするように促し、表示はしません。

source: This response contained unwanted content-codings.
ja: このレスポンスには、意図しないコンテンツコーディングが含まれていました。
zh: 此响应包含不期望的内容编码。
