Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: The Proxy-Status header has an unknown value for '%(param)s'.
es: La cabecera Proxy-Status tiene un valor desconocido para '%(param)s'.
fr: L'en-tête Proxy-Status a une valeur inconnue pour '%(param)s'.
ja: Proxy-Status ヘッダーの '%(param)s' に未知の値があります。
zh: Proxy-Status 标头对 '%(param)s' 具有未知值。

source: The Range header is invalid.
es: El encabezado Range es inválido.
fr: Le en-tête Range est invalide.

source: The values indicated by the `Range` header are not valid. The first position must be less than or equal to the last position.
es: Los valores indicados en el encabezado `Range` no son válidos. La primera posición debe ser menor o igual que la última posición.
fr: Les valeurs indiquées par l'en-tête « Range » ne sont pas valides. La première position doit être inférieure ou égale à la dernière position.

source: The Range header value isn't valid.
es: El valor del encabezado Range no es válido.
fr: La valeur de l'en-tête «Range» n'est pas valide.

source: The value for this field doesn't conform to its specified syntax; %(problem)s. See [its definition](%(ref_uri)s) for more information.
es: El valor de este campo no cumple con su sintaxis especificada; %(problem)s. Consulte [su definición](%(ref_uri)s) para más información.
fr: La valeur de ce champ ne respecte pas sa syntaxe spécifiée ; %(problem)s. Voir [sa définition](%(ref_uri)s) pour plus d'informations.

source: The Referer header is sent from a secure origin to an insecure target.
es: La cabecera Referer se envía desde un origen seguro a un destino inseguro.
fr: L'en-tête Referer est envoyé d'une origine sécurisée vers une cible non sécurisée.
ja: Referer ヘッダーがセキュアなオリジンからセキュアでないターゲットに送信されました。
zh: Referer 头从安全源发送到不安全目标。

source: HTTP prohibits a user agent from sending a Referer header field in an unsecured HTTP request if the referring resource was accessed with a secure protocol. See [RFC 9110 Section 10.1.3](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.3) for details.
es: HTTP prohíbe que un agente de usuario envíe el campo de encabezado Referer en una solicitud HTTP no segura si el recurso de referencia se accedió con un protocolo seguro. Consulte [RFC 9110 Sección 10.1.3](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.3) para obtener detalles.
fr: HTTP interdit à un agent utilisateur d'envoyer un champ d'en-tête Referer dans une requête HTTP non sécurisée si la ressource référente a été accédée avec un protocole sécurisé. Voir [RFC 9110 Section 10.1.3](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.3) pour les détails.
ja: HTTPでは、参照元のリソースがセキュアなプロトコルでアクセスされた場合、ユーザーエージェントはセキュアでないHTTPリクエストで Referer ヘッダーフィールドを送信することを禁止しています。 詳細は [RFC 9110 Section 10.1.3](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.3) を参照してください。
zh: HTTP 禁止用户代理在不安全 HTTP 请求中发送 Referer 报头字段，如果引用资源是通过安全协议访问的。 详细信息请参阅 [RFC 9110 Section 10.1.3](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.3)。

source: The Referer header is sent from a secure origin to a different origin.
es: La cabecera Referer se envía desde un origen seguro a un origen diferente.
fr: L'en-tête Referer est envoyé d'une origine sécurisée vers une origine différente.
ja: Referer ヘッダーは、セキュアなオリジンから別のオリジンに送信されます。
zh: Referer 头信息从一个安全源发送到另一个不同的源。

source: HTTP prohibits a user agent from sending a Referer header field if the referring resource was accessed with a secure protocol and the request target has an origin differing from that of the referring resource, unless the referring resource explicitly allows Referer to be sent. See [RFC 9110 Section 10.1.3](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.3) for details.
es: HTTP prohíbe que un agente de usuario envíe un campo de encabezado Referer si el recurso de referencia se accedió con un protocolo seguro y el objetivo de la solicitud tiene un origen diferente al del recurso de referencia, a menos que el recurso de referencia permita explícitamente el envío de Referer. Consulte [RFC 9110 Sección 10.1.3](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.3) para obtener más detalles.
fr: Le protocole HTTP interdit à un agent utilisateur d'envoyer un champ d'en-tête Referer si la ressource référente a été accédée via un protocole sécurisé et que la cible de la requête a une origine différente de celle de la ressource référente, à moins que la ressource référente n'autorise explicitement l'envoi du Referer. Voir [RFC 9110 Section 10.1.3](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.3) pour plus de détails.
ja: HTTP では、参照元のリソースがセキュアなプロトコルでアクセスされ、リクエストターゲットが参照元リソースと異なるオリジンを持つ場合、参照元リソースが Referer の送信を明示的に許可しない限り、ユーザーエージェントが Referer ヘッダーフィールドを送信することを禁止しています。 詳細は [RFC 9110 Section 10.1.3](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.3) を参照してください。
zh: HTTP 禁止用户代理在引用资源以安全协议访问且请求目标与引用资源的源不同时发送 Referer 标头字段，除非引用资源明确允许发送 Referer。 详情请参阅 [RFC 9110 Section 10.1.3](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.3)。

source: The `Referrer-Policy` response header controls how much referrer information (sent via the `Referer` header) should be included with requests.
es: La cabecera de respuesta `Referrer-Policy` controla cuánta información del referente (enviada a través de la cabecera `Referer`) se debe incluir en las solicitudes.
ja: `Referrer-Policy` レスポンスヘッダーは、リクエストに含まれるリファラー情報（`Referer` ヘッダー経由で送信される）の量を制御します。

source: This response's Referrer-Policy allows unsafe URLs.
es: La política de Referente de esta respuesta permite URLs inseguras.
fr: La Referrer-Policy de cette réponse autorise les URL non sécurisées.
ja: このレスポンスのReferrer-Policyは、安全でないURLを許可します。
zh: 此响应的 Referrer-Policy 允许不安全的 URL。

source: Using `unsafe-url` in `Referrer-Policy` means that the full URL (including query parameters) will be sent as a referrer to all origins, including those that are not secure (HTTP). This can leak sensitive information.
es: Usar `unsafe-url` en `Referrer-Policy` significa que la URL completa (incluidos los parámetros de consulta) se enviará como referente a todos los orígenes, incluidos aquellos que no son seguros (HTTP). Esto puede filtrar información sensible.
fr: Utiliser `unsafe-url` dans `Referrer-Policy` signifie que l'URL complète (y compris les paramètres de requête) sera envoyée comme référent à toutes les origines, y compris celles qui ne sont pas sécurisées (HTTP). Cela peut divulguer des informations sensibles.
ja: `Referrer-Policy` で `unsafe-url` を使用すると、クエリパラメータを含む完全なURLが、安全でない (HTTP) オリジンを含むすべてのオリジンへのリファラーとして送信されます。これは機密情報を漏洩する可能性があります。
zh: 在 `Referrer-Policy` 中使用 `unsafe-url` 意味着完整的 URL（包括查询参数）将被发送为推荐人，发送给所有来源，包括不安全的来源（HTTP）。这可能会泄露敏感信息。

source: The Referrer-Policy value '%(policy)s' is unknown.
es: El valor de Referrer-Policy '%(policy)s' es desconocido.
fr: La valeur Referrer-Policy '%(policy)s' est inconnue.
ja: Referrer-Policy の値 '%(policy)s' は不明です。
zh: Referrer-Policy 值 '%(policy)s' 未知。

source: The `Referrer-Policy` header contains the value `%(policy)s`, which is not a known referrer policy. It will be ignored by browsers.
es: La cabecera `Referrer-Policy` contiene el valor `%(policy)s`, que no es una política de remitente conocida. Los navegadores lo ignorarán.
fr: L'en-tête `Referrer-Policy` contient la valeur `%(policy)s`, qui n'est pas une politique de référence connue. Elle sera ignorée par les navigateurs.
ja: `Referrer-Policy` ヘッダーの値 `%(policy)s` は、既知のリファラーポリシーではありません。 ブラウザでは無視されます。
zh: `Referrer-Policy` 標頭的值為 `%(policy)s`，這不是已知的 Referrer Policy。 瀏覽器將會忽略它。

source: No valid Referrer-Policy found.
es: No se encontró una Referrer-Policy válida.
fr: Aucune Referrer-Policy valide trouvée.
ja: 有効な Referrer-Policy が見つかりませんでした。
zh: 未找到有效的 Referrer-Policy。

source: The `Referrer-Policy` header does not contain any valid policies. Browsers will use their default policy (usually `strict-origin-when-cross-origin`).
es: La cabecera `Referrer-Policy` no contiene ninguna política válida. Los navegadores usarán su política predeterminada (normalmente `strict-origin-when-cross-origin`).
fr: L'en-tête `Referrer-Policy` ne contient aucune politique valide. Les navigateurs utiliseront leur politique par défaut (généralement `strict-origin-when-cross-origin`).
ja: `Referrer-Policy` ヘッダーに有効なポリシーが含まれていません。ブラウザはデフォルトのポリシー（通常は `strict-origin-when-cross-origin`）を使用します。
zh: `Referrer-Policy` 标头不包含任何有效策略。浏览器将使用其默认策略（通常是 `strict-origin-when-cross-origin`）。

source: Multiple Referrer-Policy values found; only '%(effective)s' is used.
es: Se encontraron múltiples valores de Referrer-Policy; solo se utiliza '%(effective)s'.
fr: Plusieurs valeurs Referrer-Policy trouvées ; seule '%(effective)s' est utilisée.
ja: 複数の Referrer-Policy 値が見つかりました。 '%(effective)s' のみが使用されます。
zh: 找到多个 Referrer-Policy 值；仅使用 '%(effective)s'。

source: The `Referrer-Policy` header contains multiple valid policies. Browsers will only use the last valid policy found, which is `%(effective)s`. Earlier values are ignored.
es: La cabecera `Referrer-Policy` contiene varias políticas válidas. Los navegadores solo usarán la última política válida encontrada, que es `%(effective)s`. Los valores anteriores se ignoran.
fr: L'en-tête `Referrer-Policy` contient plusieurs stratégies valides. Les navigateurs n'utiliseront que la dernière stratégie valide trouvée, qui est `%(effective)s`. Les valeurs précédentes sont ignorées.
ja: `Referrer-Policy` ヘッダーには複数の有効なポリシーが含まれています。ブラウザは、最初に見つかった有効なポリシーのうち最後のもの、つまり `%(effective)s` のみを使用します。それより前の値は無視されます。
zh: `Referrer-Policy` 标头包含多个有效策略。浏览器只会使用找到的最后一个有效策略，即 `%(effective)s`。之前的选项将被忽略。

source: The Report-To header value has an invalid structure.
es: El valor del encabezado Report-To tiene una estructura no válida.
fr: La valeur de l'en-tête Report-To a une structure invalide.

source: The `Report-To` header should be a list of objects.
es: La cabecera 'Report-To' debe ser una lista de objetos.
fr: La `Report-To` header devrait être une liste d'objets.

source: The Report-To header value is missing the '%(key)s' key.
es: La valor de encabezado Report-To falta la clave «%(key)s».
fr: La valeur de l'en-tête Report-To manque la clé '%(key)s'.

source: The `%(key)s` key is required in `Report-To` objects.
es: El `%(key)s` es un campo necesario en objetos `Report-To`.
fr: La clé `%(key)s` est requise dans les objets `Report-To`.

source: The Report-To header has an invalid type for '%(key)s'.
es: La cabecera Report-To tiene un tipo no válido para '%(key)s'.
fr: La tête Report-To a un type invalide pour '%(key)s'.

source: The %(name)s reporting endpoint is not secure.
es: El punto final de informe %(name)s no es seguro.
fr: Le point de terminaison de rapport %(name)s n'est pas sécurisé.

source: The reporting endpoint `%(name)s` uses an insecure URL (`%(url)s`). Browsers may ignore it.
es: El punto final de informes `%(name)s` utiliza una URL no segura (`%(url)s`). Los navegadores pueden ignorarlo.
fr: Le point de terminaison de reporting « %(name)s » utilise une URL non sécurisée (« %(url)s »). Les navigateurs peuvent l'ignorer.

source: The %(name)s reporting endpoint is invalid.
es: El punto final de informe %(name)s es inválido.
fr: Le point de terminaison de rapport %(name)s est invalide.

source: The reporting endpoint `%(name)s` must be a string URL. Found: %(value)s (type `%(found_type)s`).
es: El punto final de informe `'%(name)s'` debe ser una URL de cadena. Encontrado: `'%(value)s'` (tipo `'%(found_type)s'`).
fr: Le point de terminaison de rapport « %(name)s » doit être une URL de chaîne. Trouvé : « %(value)s » (type « %(found_type)s »).

source: The `Server` response header contains information about the software used by the origin server to handle the request.
es: La cabecera de respuesta `Server` contiene información sobre el software utilizado por el servidor de origen para gestionar la solicitud.
ja: `Server` レスポンスヘッダーには、リクエストを処理するためにオリジンサーバーが使用したソフトウェアに関する情報が含まれています。

source: The Server header is long.
es: La cabecera Server es larga.
fr: L'en-tête Server est long.
ja: Server ヘッダーが長すぎます。
zh: Server 标头过长。

source: The `Server` header is %(server_length)s long, which uses unnecessary bandwidth and can expose details of the back-end system to attackers. Consider shortening it.
es: La cabecera `Server` tiene una longitud de %(server_length)s, lo que consume ancho de banda innecesario y puede exponer detalles del sistema de fondo a los atacantes. Considere acortarla.
fr: L'en-tête `Server` a une longueur de %(server_length)s, ce qui utilise une bande passante inutile et peut exposer les détails du système back-end aux attaquants. Envisagez de le raccourcir.
ja: `Server` ヘッダーは %(server_length)s バイトです。これは帯域幅の無駄遣いであり、バックエンドシステムの詳細が攻撃者に露呈する可能性があります。 短縮することを検討してください。
zh: `Server` 标头长度为 %(server_length)s，这会浪费不必要的带宽，并可能向攻击者暴露后端系统的详细信息。 考虑缩短它。

source: The `Server-Timing` header field communicates one or more metrics and descriptions for the given request-response cycle. It is used to surface any backend server timing metrics (e.g. database read/write, CPU time, file system access, etc.) in the developer tools in the browser or any other consumer of Server-Timing.
es: El campo de encabezado `Server-Timing` comunica una o más métricas y descripciones para el ciclo de solicitud-respuesta dado. Se utiliza para mostrar cualquier métrica de tiempo de servidor de back-end (por ejemplo, lecturas/escrituras de base de datos, tiempo de CPU, acceso al sistema de archivos, etc.) en las herramientas de desarrollador del navegador o cualquier otro consumidor de Server-Timing.

source: The '%(param)s' parameter on the '%(metric)s' metric has a non-numeric value.
es: El parámetro '%(param)s' en la métrica '%(metric)s' tiene un valor no numérico.
fr: Le paramètre '%(param)s' sur la métrique '%(metric)s' a une valeur non numérique.

source: The `%(param)s` parameter on the `%(metric)s` metric of the Server-Timing header requires a valid number, but `%(value)s` was found.
es: El parámetro `%(param)s` en el parámetro `%(metric)s` de la cabecera Server-Timing requiere un número válido, pero se encontró `%(value)s`.
fr: Le paramètre `%(param)s` sur la métrique `%(metric)s` de l'en-tête Server-Timing nécessite un nombre valide, mais `%(value)s` a été trouvé.

source: The '%(metric)s' metric is missing the 'dur' parameter.
es: La métrica '%(metric)s' falta el parámetro 'dur'.
fr: La métrique '%(metric)s' manque du paramètre 'dur'.

source: The `%(metric)s` metric in the Server-Timing header is missing the `dur` (duration) parameter. This parameter isn't required, but without it browsers may not be able to usefully display it.
es: El `%(metric)s` en el encabezado Server-Timing falta el parámetro `dur` (duración). Este parámetro no es obligatorio, pero sin él, los navegadores pueden no ser capaces de mostrarlo de manera útil.
fr: La métrique `%(metric)s` dans l'en-tête Server-Timing manque du paramètre `dur` (durée). Ce paramètre n'est pas obligatoire, mais sans lui, les navigateurs peuvent ne pas être en mesure de l'afficher de manière utile.

source: The '%(metric)s' metric is missing the 'desc' parameter.
es: La métrica '%(metric)s' falta el parámetro 'desc'.
fr: La métrique « %(metric)s » manque du paramètre « desc ».

source: The `%(metric)s` metric in the Server-Timing header is missing the `desc` (description) parameter. Descriptions can help contextualise a metric when displayed.
es: La métrica `%(metric)s` en el encabezado Server-Timing falta el parámetro `desc` (descripción). Las descripciones pueden ayudar a contextualizar una métrica cuando se muestra.
fr: La métrique `%(metric)s` dans l'en-tête Server-Timing manque du paramètre `desc` (description). Les descriptions peuvent aider à contextualiser une métrique lorsqu'elle est affichée.

source: This response has a Set-Cookie header without a cookie-name.
es: Esta respuesta tiene una cabecera Set-Cookie sin nombre de cookie.
fr: Cette réponse a un en-tête Set-Cookie sans cookie-name.
ja: このレスポンスには、Cookie名のないSet-Cookieヘッダーが含まれています。
zh: 此响应的 Set-Cookie 标头缺少 cookie 名称。

source: This `Set-Cookie` header has an empty name; there needs to be a name before the `=`. Browsers will ignore this cookie.
es: Esta cabecera `Set-Cookie` tiene un nombre vacío; debe haber un nombre antes del `=`. Los navegadores ignorarán esta cookie.
fr: Cet en-tête `Set-Cookie` a un nom vide ; il doit y avoir un nom avant le `=`. Les navigateurs ignoreront ce cookie.
ja: この `Set-Cookie` ヘッダーには名前がありません。 `=` の前に名前が必要です。 ブラウザはこのクッキーを無視します。
zh: 此 `Set-Cookie` 标头缺少名称；等号 (`=`) 前面需要有名称。 浏览器将忽略此 Cookie。

source: The %(cookie_name)s cookie has an invalid Expires date.
es: La cookie %(cookie_name)s tiene una fecha Expires no válida.
fr: Le cookie %(cookie_name)s a une date Expires non valide.
ja: %(cookie_name)s クッキーのExpiresの日付が無効です。
zh: %(cookie_name)s cookie 的Expires日期无效。

source: The `expires` date on this `Set-Cookie` header isn't valid; see [RFC6265](https://www.rfc-editor.org/rfc/rfc6265) for details of the correct format.
es: La fecha `expires` en esta cabecera `Set-Cookie` no es válida; consulte [RFC6265](https://www.rfc-editor.org/rfc/rfc6265) para más detalles sobre el formato correcto.
fr: La date `expires` dans cet en-tête `Set-Cookie` n'est pas valide ; voir [RFC6265](https://www.rfc-editor.org/rfc/rfc6265) pour les détails du format correct.
ja: この`Set-Cookie`ヘッダーの`expires`日付は無効です。正しい形式については[RFC6265](https://www.rfc-editor.org/rfc/rfc6265)を参照してください。
zh: 此 `Set-Cookie` 标头中的 `expires` 日期无效；请参阅 [RFC6265](https://www.rfc-editor.org/rfc/rfc6265) 了解正确格式的详细信息。

source: The %(cookie_name)s cookie has an empty Max-Age.
es: La cookie %(cookie_name)s tiene un Max-Age vacío.
fr: Le cookie %(cookie_name)s a un Max-Age vide.
ja: %(cookie_name)s クッキーの Max-Age が空です。
zh: Cookie "%(cookie_name)s" 的 Max-Age 为空。

source: The `max-age` parameter on this `Set-Cookie` header doesn't have a value. Browsers will ignore the `max-age` value as a result.
es: El parámetro `max-age` en esta cabecera `Set-Cookie` no tiene un valor. Los navegadores ignorarán el valor de `max-age` como resultado.
fr: Le paramètre `max-age` dans cet en-tête `Set-Cookie` n'a pas de valeur. Les navigateurs ignoreront donc la valeur `max-age`.
ja: この `Set-Cookie` ヘッダーの `max-age` パラメーターには値が指定されていません。 この結果、ブラウザーはこの `max-age` 値を無視します。
zh: 此 `Set-Cookie` 标头上的 `max-age` 参数没有值。 结果，浏览器将忽略 `max-age` 的值。

source: The %(cookie_name)s cookie has a Max-Age with a leading zero.
es: La cookie %(cookie_name)s tiene un Max-Age con un cero inicial.
fr: Le cookie %(cookie_name)s a un Max-Age avec un zéro non significatif.
ja: %(cookie_name)s クッキーの Max-Age に先頭のゼロがあります。
zh: %(cookie_name)s Cookie 有一个 Max-Age，其开头有一个零。

source: The `max-age` parameter on this `Set-Cookie` header has a leading zero. Browsers will ignore the `max-age` value as a result.
es: El parámetro `max-age` en esta cabecera `Set-Cookie` tiene un cero a la izquierda. Los navegadores ignorarán el valor de `max-age` como resultado.
fr: Le paramètre `max-age` de cet en-tête `Set-Cookie` a un zéro initial. Les navigateurs ignoreront la valeur `max-age` en conséquence.
ja: この`Set-Cookie`ヘッダーの`max-age`パラメータには、先頭にゼロが付いています。 その結果、ブラウザはこの`max-age`値を無視します。
zh: 此 `Set-Cookie` 标头中的 `max-age` 参数带有前导零。 浏览器因此将忽略 `max-age` 值。

source: The %(cookie_name)s cookie has a non-numeric Max-Age.
es: La cookie %(cookie_name)s tiene un Max-Age no numérico.
fr: Le cookie %(cookie_name)s a un Max-Age non numérique.
ja: %(cookie_name)s クッキーの Max-Age が数値ではありません。
zh: %(cookie_name)s Cookie 的 Max-Age 不是数字。

source: The `max-age` parameter on this `Set-Cookie` header isn't numeric. Browsers will ignore the `max-age` value as a result.
es: El parámetro `max-age` en esta cabecera `Set-Cookie` no es numérico. Los navegadores ignorarán el valor de `max-age` como resultado.
fr: Le paramètre `max-age` de cet en-tête `Set-Cookie` n'est pas numérique. Les navigateurs ignoreront la valeur `max-age` en conséquence.
ja: `Set-Cookie` ヘッダーの `max-age` パラメーターは数値ではありません。 この結果、ブラウザーは `max-age` の値を無視します。
zh: 此 `Set-Cookie` 标头上的 `max-age` 参数不是数字。 浏览器因此会忽略 `max-age` 值。

source: The %(cookie_name)s cookie has an empty domain.
es: La cookie %(cookie_name)s tiene un dominio vacío.
fr: Le cookie %(cookie_name)s a un domaine vide.
ja: %(cookie_name)s クッキーのドメインが空です。
zh: %(cookie_name)s Cookie 的 domain 为空。

source: The `domain` parameter on this `Set-Cookie` header is empty. Note that handling of empty domains is [not interoperable](https://chromestatus.com/feature/5674723800252416). Browsers will probably ignore it as a result.
es: El parámetro `domain` en este encabezado `Set-Cookie` está vacío. Tenga en cuenta que el manejo de dominios vacíos no es [interoperable](https://chromestatus.com/feature/5674723800252416). Es probable que los navegadores lo ignorarán como resultado.
fr: Le paramètre `domain` dans l'en-tête `Set-Cookie` est vide. Note que la gestion des domaines vides est [non interopérable](https://chromestatus.com/feature/5674723800252416). Les navigateurs l'ignoreront probablement en conséquence.

source: The %(cookie_name)s cookie is missing the Secure attribute.
es: La cookie %(cookie_name)s no tiene el atributo Secure.
fr: L'attribut Secure est manquant pour le cookie %(cookie_name)s.
ja: `%(cookie_name)s` クッキーに Secure 属性がありません。
zh: %(cookie_name)s cookie 缺少 Secure 属性。

source: The `Secure` attribute on this `Set-Cookie` header is missing. Because the `SameSite` attribute is set to `None`, the `Secure` attribute is required. Browsers will ignore this cookie.
es: El atributo 'Secure' en este encabezado 'Set-Cookie' está faltando. Dado que el atributo 'SameSite' está configurado en 'None', el atributo 'Secure' es obligatorio. Los navegadores ignorarán este cookie.
fr: L'attribut `Secure` sur cette en-tête `Set-Cookie` est manquant. Comme l'attribut `SameSite` est défini sur `None`, l'attribut `Secure` est requis. Les navigateurs vont ignorer cette cookie.

source: The %(cookie_name)s cookie has an unknown attribute, '%(attribute)s'.
es: La cookie %(cookie_name)s tiene un atributo desconocido, '%(attribute)s'.
fr: Le cookie %(cookie_name)s a un attribut inconnu, '%(attribute)s'.
ja: 「%(cookie_name)s」Cookie には、未知の属性「%(attribute)s」があります。
zh: “%(cookie_name)s” cookie 具有一个未知属性，“%(attribute)s”。

source: This cookie has an extra parameter, "%(attribute)s". Browsers will ignore it.
es: Esta cookie tiene un parámetro extra, "%(attribute)s". Los navegadores lo ignorarán.
fr: Ce cookie possède un paramètre supplémentaire, "%(attribute)s". Les navigateurs l'ignoreront.
ja: このCookieには、追加のパラメータ「%(attribute)s」が含まれています。 ブラウザはこれを無視します。
zh: 此 Cookie 包含一个额外的参数：“%(attribute)s”。 浏览器将忽略它。

source: The 'Priority' Set-Cookie attribute is deprecated.
es: El atributo 'Priority' Set-Cookie está obsoleto.
fr: Le paramètre 'Priority' Set-Cookie est obsolète.

source: The `Priority` attribute was an experiment, and is no longer supported.
es: El atributo `Priority` fue un experimento, y ya no se admite.
fr: La `Priority` était un essai, et n'est plus prise en charge.

source: The 'Version Set-Cookie attribute is deprecated.
es: La 'atributo Set-Cookie' se ha quedado obsoleto.
fr: La 'Version Set-Cookie' est obsolète.
