Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: %(method)s is not allowed, but the resource lists it in Allow.
es: %(method)s no está permitido, pero el recurso lo enumera en Allow.
fr: %(method)s n'est pas autorisé, mais la ressource le répertorie dans Allow.

source: The `405 (Method Not Allowed)` status code indicates that the HTTP method is known by the origin server but not supported by the target resource. However, the `Allow` header field listed in the response contains the method used, indicating that it is allowed.
es: El código de estado `405 (Método no permitido)` indica que el método HTTP es conocido por el servidor de origen, pero no es compatible con el recurso de destino. Sin embargo, el campo de encabezado "Permitir" incluido en la respuesta contiene el método utilizado, indicando que está permitido.
fr: Le code d'état « 405 (Méthode non autorisée ) » indique que la méthode HTTP est connue par le serveur d'origine mais non prise en charge par la ressource cible. Cependant, le champ d'en-tête « Autoriser » inclus dans la réponse contient la méthode utilisée, indiquant qu'elle est autorisée.

source: The resource could not be found.
es: El recurso no pudo ser encontrado.
fr: La ressource est introuvable.
ja: リソースが見つかりませんでした。
zh: 找不到该资源。

source: The server couldn't find any resource to serve for the given URI.
es: El servidor no pudo encontrar ningún recurso para servir para la URI proporcionada.
fr: Le serveur n'a trouvé aucune ressource à servir pour l'URI donné.
ja: サーバーは、指定されたURIに対応するリソースを見つけられませんでした。
zh: 服务器未能找到任何可用于所提供 URI 的资源。

source: The resource cannot produce a response that is acceptable to the client.
es: El recurso no puede generar una respuesta aceptable para el cliente.
fr: La ressource ne peut pas produire une réponse acceptable au client.

source: The `406 (Not Acceptable)` status code indicates that the resource cannot produce a response matching the list of acceptable values defined in the request's proactive negotiation header fields, such as `Accept`, `Accept-Charset`, `Accept-Encoding`, or `Accept-Language`.
es: El código de estado `406 (No aceptable)` indica que el recurso no puede producir una respuesta que coincida con la lista de valores aceptables definidos en los campos de encabezado de negociación proactiva de la solicitud, como `Accept`, `Accept-Charset`, `Accept-Encoding` o `Accept-Language`.
fr: Le code d'état `406 (Non acceptable)` indique que la ressource ne peut pas produire une réponse correspondant à la liste des valeurs acceptables définies dans les en-têtes de négociation proactive de la demande, tels que `Accept`, `Accept-Charset`, `Accept-Encoding` ou `Accept-Language`.

source: The 406 (Not Acceptable) status code appears to be misused.
es: El código de estado 406 (No Acceptable) parece ser utilizado de manera incorrecta.
fr: Le code d'état 406 (Non acceptable) semble être utilisé à mauvais escient.

source: The `406 (Not Acceptable)` status code indicates that the request cannot produce a response matching the list of acceptable values defined in the request's proactive negotiation header fields. However, this request didn't contain any proactive negotiation headers (such as `Accept`, `Accept-Charset`, `Accept-Encoding`, or `Accept-Language`).
es: El código de estado '406 (No aceptable)' indica que la solicitud no puede producir una respuesta que coincida con la lista de valores aceptables definidos en los campos de encabezado de negociación proactiva de la solicitud. Sin embargo, esta solicitud no contenía ningún encabezado de negociación proactiva (como 'Accept', 'Accept-Charset', 'Accept-Encoding' o 'Accept-Language').
fr: Le code d'état `406 (Non acceptable)` indique que la demande ne peut pas produire une réponse correspondant à la liste des valeurs acceptables définies dans les en-têtes de négociation proactive de la demande. Cependant, cette demande n'a pas contenu d'en-têtes de négociation proactive (tels que `Accept`, `Accept-Charset`, `Accept-Encoding`, ou `Accept-Language`).

source: The request conflicted with the state of the resource.
es: La solicitud entró en conflicto con el estado del recurso.
fr: La requête est entrée en conflit avec l'état de la ressource.
ja: リソースの状態とリクエストが競合しました。
zh: 请求与资源的当前状态冲突。

source: The resource is gone.
es: El recurso se ha ido.
fr: La ressource a disparu.
ja: リソースは削除されました。
zh: 资源已丢失。

source: The server previously had a resource at the given URI, but it is no longer there.
es: El servidor tenía previamente un recurso en la URI dada, pero ya no está allí.
fr: Le serveur possédait auparavant une ressource à l'URI donné, mais elle n'y est plus.
ja: サーバーは以前、指定されたURIにリソースを持っていましたが、現在は存在しません。
zh: 服务器之前在该 URI 下存在一个资源，但现在已不存在。

source: The request content was too large for the server.
es: El contenido de la solicitud era demasiado grande para el servidor.
fr: Le contenu de la requête était trop volumineux pour le serveur.
ja: リクエストコンテンツがサーバーに対して大きすぎました。
zh: 服务器无法处理过大的请求内容。

source: The server rejected the request because the request content sent was too large.
es: El servidor rechazó la solicitud porque el contenido de la solicitud enviado era demasiado grande.
fr: Le serveur a rejeté la requête car le contenu envoyé était trop volumineux.
ja: サーバーは、送信されたリクエストコンテンツが大きすぎたため、リクエストを拒否しました。
zh: 服务器拒绝了请求，因为发送的请求内容过大。

source: The server won't accept a URI this long %(uri_len)s.
es: El servidor no aceptará una URI tan larga %(uri_len)s.
fr: Le serveur n'acceptera pas un URI aussi long %(uri_len)s.
ja: サーバーは、これほど長いURI（%(uri_len)s）を受け付けません。
zh: 服务器不接受这么长的 URI %(uri_len)s。

source: The %(status)s status code means that the server can't or won't accept a request-uri this long.
es: El código de estado %(status)s significa que el servidor no puede o no aceptará una URI de solicitud tan larga.
fr: Le code de statut %(status)s signifie que le serveur ne peut pas ou ne veut pas accepter une URI de requête aussi longue.
ja: %(status)s ステータスコードは、サーバーが長すぎるリクエスト URI を受け入れられない、または受け入れないことを意味します。
zh: %(status)s 状态码表示服务器无法或不愿意接受如此长的请求 URI。

source: The resource doesn't support this media type in requests.
es: El recurso no admite este tipo de medio en las solicitudes.
fr: La ressource ne prend pas en charge ce type de média dans les requêtes.
ja: リソースはリクエストでこのメディアタイプをサポートしていません。
zh: 资源不支持请求中的此媒体类型。

source: The server returned 418 (I'm a Teapot), an easter egg defined in RFC 2324.
es: El servidor devolvió 418 (Soy una tetera), un huevo de pascua definido en RFC 2324.
fr: Le serveur a renvoyé 418 (I'm a Teapot), un easter egg défini dans la RFC 2324.
ja: サーバーは418 (I'm a Teapot) を返しました。これはRFC 2324 で定義されているイースターエッグです。
zh: 服务器返回 418 (I'm a Teapot)，这是 RFC 2324 中定义的彩蛋。

source: RFC 2324 was an April Fools' Day RFC that lampooned the various ways HTTP was abused; one such abuse was the definition of the application-specific `418 (I'm a Teapot)` status code. In the intervening years, this status code has been sometimes implemented as an "easter egg". This status code is not a part of HTTP and hence it might not be supported by some strict standards-compliant clients.
es: RFC 2324 fue un RFC del Día de los Inocentes que se burlaba de las diversas formas en que se abusaba de HTTP; uno de esos abusos fue la definición del código de estado específico de la aplicación `418 (I'm a Teapot)`. En los años transcurridos, este código de estado se ha implementado a veces como un "huevo de Pascua". Este código de estado no forma parte de HTTP y, por lo tanto, es posible que no sea compatible con algunos clientes estrictos que cumplen las normas.
fr: La RFC 2324 était un « Poisson d'avril » (April Fools' Day) qui se moquait des diverses façons dont le protocole HTTP était mal utilisé ; une telle utilisation abusive était la définition du code de statut `418 (I'm a Teapot)` spécifique à l'application. Au cours des années suivantes, ce code de statut a parfois été implémenté comme un "easter egg". Ce code de statut ne fait pas partie du protocole HTTP et, par conséquent, il pourrait ne pas être pris en charge par certains clients strictement conformes aux normes.
ja: RFC 2324 は、HTTP がどのように悪用されていたかを風刺したエイプリルフールの RFC でした。そのような悪用の一つに、アプリケーション固有の `418 (I'm a Teapot)` ステータスコードの定義がありました。それ以来、このステータスコードは「イースターエッグ」として実装されることもありました。 このステータスコードは HTTP の一部ではないため、厳密な標準準拠クライアントではサポートされていない可能性があります。
zh: RFC 2324 是一个愚人节 RFC，它讽刺了 HTTP 的各种滥用方式；其中一种滥用就是定义了应用程序特定的 `418 (I'm a Teapot)` 状态码。在随后的几年里，这个状态码有时被用作“复活节彩蛋”。 此状态码不是 HTTP 的一部分，因此一些严格遵循标准的客户端可能不支持。

source: There was a general server error.
es: Hubo un error general del servidor.
fr: Il y a eu une erreur générale du serveur.
ja: 一般的なサーバーエラーが発生しました。
zh: 发生了一般性服务器错误。

source: The server doesn't implement the request method.
es: El servidor no implementa el método de la solicitud.
fr: Le serveur n'implémente pas la méthode de requête.
ja: サーバーはリクエストメソッドを実装していません。
zh: 服务器未实现请求方法。

source: An intermediary encountered an error.
es: Un intermediario encontró un error.
fr: Un intermédiaire a rencontré une erreur.
ja: 中間サーバーでエラーが発生しました。
zh: 中间人遇到错误。

source: The server is temporarily unavailable.
es: El servidor no está disponible temporalmente.
fr: Le serveur est temporairement indisponible.
ja: サーバーは現在一時的に利用できません。
zh: 服务器暂时不可用。

source: An intermediary timed out.
es: Un intermediario agotó el tiempo de espera.
fr: Un intermédiaire a expiré.
ja: 中間サーバーがタイムアウトしました。
zh: 中间人超时。

source: The request HTTP version isn't supported.
es: La versión HTTP de la solicitud no es compatible.
fr: La version HTTP de la requête n'est pas prise en charge.
ja: リクエストのHTTPバージョンはサポートされていません。
zh: 请求的 HTTP 版本不受支持。

source: The request precondition failed.
es: El prefijo de la solicitud no tuvo éxito.
fr: La précondition de la requête a échoué.

source: The `412 (Precondition Failed)` status code indicates that one or more conditions given in the request header fields (typically, those starting with `If-`)evaluated to false when tested on the server.
es: El código de estado `412 (Precondición fallida)` indica que uno o más de las condiciones indicadas en los campos de encabezado de la solicitud (generalmente, aquellos que comienzan con "Si-") se evaluaron como falsas cuando se probaron en el servidor.
fr: Le code d'état « 412 (Precondition Failed ) » indique qu'une ou plusieurs conditions mentionnées dans les champs d'en-tête de la requête (généralement ceux qui commencent par « If- ») ont évalué à « false » lors de leur test sur le serveur.

source: The request expectation failed.
es: La expectativa de la solicitud falló.
fr: La demande n'a pas abouti.

source: The `417 (Expectation Failed)` status code indicates that the expectation given in the request's `Expect` header field could not be met by at least one of the inbound servers.
es: El código de estado "417 (Expectativa no cumplida)" indica que la expectativa dada en el campo de encabezado "Expect" de la solicitud no pudo ser cumplida por al menos uno de los servidores entrantes.
fr: Le code d'état `417 (Expectation non remplie)` indique que l'attente donnée dans le champ d'en-tête `Expect` de la requête n'a pas pu être satisfaite par au moins un des serveurs entrants.

source: The request didn't have any preconditions.
es: La solicitud no tenía ninguna precondición.
fr: La requête n'avait aucune condition préalable.
ja: リクエストに事前条件がありませんでした。
zh: 请求没有任何前提条件。

source: The `412 (Precondition Failed)` status code indicates that one or more conditions given in the request header fields evaluated to false when tested on the server. However, this request didn't contain any conditional headers (such as `If-Match`, `If-None-Match`, `If-Modified-Since`, `If-Unmodified-Since`, or `If-Range`).
es: El código de estado `412 (Precondition Failed)` indica que una o más condiciones dadas en los campos de encabezado de la solicitud se evaluaron como falsas en el servidor. Sin embargo, esta solicitud no contenía ningún encabezado condicional (como `If-Match`, `If-None-Match`, `If-Modified-Since`, `If-Unmodified-Since` o `If-Range`).
fr: Le code d'état `412 (Precondition Failed)` indique qu'une ou plusieurs conditions spécifiées dans les champs d'en-tête de la requête ont été évaluées à faux par le serveur. Cependant, cette requête ne contenait aucun en-tête conditionnel (tel que `If-Match`, `If-None-Match`, `If-Modified-Since`, `If-Unmodified-Since`, ou `If-Range`).
ja: `412 (Precondition Failed)` ステータスコードは、リクエストヘッダーフィールドで指定された条件の1つ以上が、サーバーでテストされたときに偽と評価されたことを示します。 しかし、このリクエストには条件付きヘッダー（`If-Match`、`If-None-Match`、`If-Modified-Since`、`If-Unmodified-Since`、`If-Range` など）は含まれていませんでした。
zh: `412 (Precondition Failed)` 状态码表示在请求头字段中提供的一个或多个条件在服务器上测试时评估为 false。 但是，此请求不包含任何条件头（例如 `If-Match`、`If-None-Match`、`If-Modified-Since`、`If-Unmodified-Since` 或 `If-Range`）。

source: The request didn't have a Range header.
es: La solicitud no tenía una cabecera Range.
fr: La requête n'avait pas d'en-tête Range.
ja: リクエストにRangeヘッダーがありませんでした。
zh: 请求没有 Range 头部。

source: The `416 (Range Not Satisfiable)` status code indicates that the set of ranges in the request's `Range` header field overlap the current extent of the selected resource. However, this request didn't contain a `Range` header.
es: El código de estado `416 (Range Not Satisfiable)` indica que el conjunto de rangos en el campo de encabezado `Range` de la solicitud se superpone con la extensión actual del recurso seleccionado. Sin embargo, esta solicitud no contenía un encabezado `Range`.
fr: Le code d'état `416 (Range Not Satisfiable)` indique que l'ensemble des plages dans l'en-tête `Range` de la requête chevauche l'étendue actuelle de la ressource sélectionnée. Cependant, cette requête ne contenait pas d'en-tête `Range`.
ja: `416 (Range Not Satisfiable)` ステータスコードは、リクエストの `Range` ヘッダーフィールドの範囲セットが、選択されたリソースの現在の範囲と重複していることを示します。 しかし、このリクエストには `Range` ヘッダーが含まれていませんでした。
zh: `416 (Range Not Satisfiable)` 状态码表示请求的 `Range` 头部字段中的范围集与所选资源的当前范围重叠。 然而，此请求不包含 `Range` 头部。

source: The request didn't have an Expect header.
es: La solicitud no tenía una cabecera Expect.
fr: La requête n'avait pas d'en-tête Expect.
ja: リクエストに `Expect` ヘッダーがありませんでした。
zh: 请求没有 `Expect` 头部。

source: The `417 (Expectation Failed)` status code indicates that the expectation given in the request's `Expect` header field could not be met by at least one of the inbound servers. However, this request didn't contain an `Expect` header.
es: El código de estado `417 (Expectation Failed)` indica que la expectativa dada en el encabezado `Expect` de la solicitud no pudo ser cumplida por al menos uno de los servidores entrantes. Sin embargo, esta solicitud no contenía un encabezado `Expect`.
fr: Le code d'état `417 (Expectation Failed)` indique que l'attente spécifiée dans l'en-tête `Expect` de la requête n'a pas pu être satisfaite par au moins un des serveurs entrants. Cependant, cette requête ne contenait pas d'en-tête `Expect`.
ja: `417 (Expectation Failed)` ステータスコードは、リクエストの `Expect` ヘッダーフィールドで指定された期待値が、少なくとも1つのインバウンドサーバーで満たされなかったことを示します。 ただし、このリクエストには `Expect` ヘッダーが含まれていませんでした。
zh: `417 (Expectation Failed)` 状态码表示请求中的 `Expect` 头部字段所期望的内容，至少有一台入站服务器无法满足。 然而，此请求并未包含 `Expect` 头部。

source: The server couldn't meet the 100-continue expectation.
es: El servidor no pudo cumplir la expectativa de 100-continue.
fr: Le serveur n'a pas pu répondre à l'attente 100-continue.
ja: サーバーは100-continueの期待に応えられませんでした。
zh: 服务器未能满足 100-continue 预期。

source: The `417 (Expectation Failed)` status code indicates that the expectation given in the request's `Expect` header field could not be met by at least one of the inbound servers. In this case, the client requested `100-continue`, but the server (or an intermediary) couldn't satisfy it.
es: El código de estado `417 (Expectation Failed)` indica que la expectativa dada en el campo de cabecera `Expect` de la solicitud no pudo ser satisfecha por al menos uno de los servidores entrantes. En este caso, el cliente solicitó `100-continue`, pero el servidor (o un intermediario) no pudo satisfacerla.
fr: Le code d'état `417 (Expectation Failed)` indique que l'attente spécifiée dans l'en-tête `Expect` de la requête n'a pas pu être satisfaite par au moins un des serveurs entrants. Dans ce cas, le client a demandé `100-continue`, mais le serveur (ou un intermédiaire) n'a pas pu le satisfaire.
ja: `417 (Expectation Failed)` ステータスコードは、リクエストの `Expect` ヘッダーフィールドで指定された期待値が、少なくとも1つのインバウンドサーバーで満たされなかったことを示します。 この場合、クライアントは `100-continue` を要求しましたが、サーバー（または中間サーバー）はそれを満たすことができませんでした。
zh: `417 (Expectation Failed)` 状态码表示请求的 `Expect` 标头字段中给出的期望未能被至少一个入站服务器满足。 在这种情况下，客户端请求了 `100-continue`，但服务器（或中间服务器）无法满足该请求。

source: The server sent early hints.
es: El servidor envió sugerencias tempranas.
fr: Le serveur a envoyé des indices précoces (early hints).
ja: サーバーが早期ヒントを送信しました。
zh: 服务器发送了早期提示。

source: The `103 (Early Hints)` status code allows the server to send some headers before the final response, typically to help the client start fetching resources earlier.
es: El código de estado `103 (Early Hints)` permite al servidor enviar algunas cabeceras antes de la respuesta final, típicamente para ayudar al cliente a empezar a obtener recursos antes.
fr: Le code d'état `103 (Early Hints)` permet au serveur d'envoyer certains en-têtes avant la réponse finale, typiquement pour aider le client à commencer à récupérer les ressources plus tôt.
ja: `103 (Early Hints)` ステータスコードにより、サーバーは最終的なレスポンスの前に一部のヘッダーを送信でき、 通常はクライアントがリソースの取得をより早く開始するのに役立ちます。
zh: `103 (Early Hints)` 状态码允许服务器在最终响应之前发送一些标头， 通常是为了帮助客户端更早地开始获取资源。

source: The server supports upload resumption.
es: El servidor admite la reanudación de cargas.
fr: Le serveur prend en charge la reprise du téléchargement.
ja: サーバーはアップロード再開をサポートしています。
zh: 服务器支持上传续传。

source: The `104 (Upload Resumption Supported)` status code indicates that the server supports resumable uploads.
es: El código de estado `104 (Upload Resumption Supported)` indica que el servidor admite cargas resumibles.
fr: Le code d'état `104 (Upload Resumption Supported)` indique que le serveur prend en charge les téléchargements réutilisables.
ja: `104 (Upload Resumption Supported)` ステータスコードは、サーバーが再開可能なアップロードをサポートしていることを示します。
zh: `104 (Upload Resumption Supported)` 状态码表示服务器支持可恢复的上传。

source: The members of a DAV binding have already been enumerated.
es: Los miembros de un enlace DAV ya han sido enumerados.
fr: Les membres d'une liaison DAV ont déjà été énumérés.
ja: DAV バインディングのメンバーは既に列挙されています。
zh: DAV 绑定成员已枚举。

source: The `208 (Already Reported)` status code can be used inside a DAV: propstat response element to avoid enumerating the internal members of multiple bindings to the same collection repeatedly.
es: El código de estado `208 (Already Reported)` puede usarse dentro de un elemento de respuesta DAV: propstat para evitar enumerar repetidamente los miembros internos de múltiples vinculaciones a la misma colección.
fr: Le code d'état `208 (Already Reported)` peut être utilisé dans un élément de réponse DAV: propstat pour éviter de répertorier à plusieurs reprises les membres internes de plusieurs liaisons à la même collection.
ja: `208 (Already Reported)` ステータスコードは、同じコレクションへの複数のバインディングの内部メンバーを繰り返し列挙することを避けるために、DAV: propstat レスポンス要素内で使用できます。
zh: `208 (Already Reported)` 状态码可以在 DAV: propstat 响应元素中使用，以避免重复枚举绑定到同一集合的内部成员。

source: The request was directed at a server that is not able to produce a response.
es: La solicitud se dirigió a un servidor que no pudo producir una respuesta.
fr: La requête a été dirigée vers un serveur qui n'est pas en mesure de fournir une réponse.
ja: サーバーは応答を生成できませんでした。
zh: 请求被导向了一个无法响应的服务器。

source: The `421 (Misdirected Request)` status code indicates that the request was directed at a server that is not able to produce a response. This can happen when a connection is reused.
es: El código de estado `421 (Misdirected Request)` indica que la solicitud se dirigió a un servidor que no puede producir una respuesta. Esto puede ocurrir cuando se reutiliza una conexión.
fr: Le code d'état `421 (Misdirected Request)` indique que la requête a été dirigée vers un serveur qui n'est pas en mesure de fournir une réponse. Cela peut se produire lorsqu'une connexion est réutilisée.
ja: `421 (Misdirected Request)` ステータスコードは、応答を生成できないサーバーにリクエストが送信されたことを示します。これは、接続が再利用された場合に発生する可能性があります。
zh: `421 (Misdirected Request)` 状态码表示请求被定向到一个无法生成响应的服务器。当连接被重用时，可能会发生这种情况。

source: The server is unwilling to risk processing a request that might be replayed.
es: El servidor no está dispuesto a arriesgarse a procesar una solicitud que podría ser reproducida.
fr: Le serveur refuse de traiter une demande susceptible d'être rejouée.
ja: サーバーは、再送される可能性のあるリクエストの処理をリスクとして回避したいと考えています。
zh: 服务器不愿冒处理可能被重放的请求的风险。

source: The `425 (Too Early)` status code indicates that the server is unwilling to risk processing a request that might be replayed.
es: El código de estado `425 (Too Early)` indica que el servidor no está dispuesto a arriesgarse a procesar una solicitud que podría ser reproducida.
fr: Le code d'état `425 (Trop tôt)` indique que le serveur ne souhaite pas prendre le risque de traiter une requête qui pourrait être rejouée.
ja: `425 (Too Early)` ステータスコードは、サーバーが再利用される可能性のあるリクエストの処理をリスクとすることを望まないことを示します。
zh: `425 (Too Early)` 状态码表示服务器不愿冒险处理可能被重放的请求。

source: The origin server requires the request to be conditional.
es: El servidor de origen requiere que la solicitud sea condicional.
fr: Le serveur d'origine exige que la requête soit conditionnelle.
ja: オリジンサーバーは、リクエストが条件付きであることを要求しています。
zh: 源服务器要求请求是有条件的。

source: The `428 (Precondition Required)` status code indicates that the origin server requires the request to be conditional.
es: El código de estado `428 (Precondition Required)` indica que el servidor de origen requiere que la solicitud sea condicional.
fr: Le code d'état `428 (Precondition Required)` indique que le serveur d'origine exige que la requête soit conditionnelle.
ja: `428 (Precondition Required)` ステータスコードは、オリジンサーバーがリクエストに条件を要求することを示します。
zh: `428 (Precondition Required)` 状态码表示源服务器要求请求必须是有条件的。

source: The client has sent too many requests in a given amount of time.
es: El cliente ha enviado demasiadas solicitudes en un período de tiempo determinado.
fr: Le client a envoyé trop de requêtes dans un laps de temps donné.
ja: クライアントが一定時間内に多すぎるリクエストを送信しました。
zh: 客户端在给定时间内发送的请求过多。

source: The `429 (Too Many Requests)` status code indicates that the client has sent too many requests in a given amount of time ("rate limiting").
es: El código de estado `429 (Too Many Requests)` indica que el cliente ha enviado demasiadas solicitudes en un período de tiempo determinado ("limitación de velocidad").
fr: Le code d'état `429 (Too Many Requests)` indique que le client a envoyé trop de requêtes dans un délai donné (« limitation du débit »).
ja: `429 (Too Many Requests)` ステータスコードは、クライアントが指定された時間内に多すぎるリクエストを送信したこと（「レート制限」）を示します。
zh: `429 (Too Many Requests)` 状态码表示客户端在给定时间内发送了过多的请求（“速率限制”）。

source: The server is unwilling to process the request because its headers are too large.
es: El servidor no está dispuesto a procesar la solicitud porque sus encabezados son demasiado grandes.
fr: Le serveur refuse de traiter la requête car ses en-têtes sont trop volumineux.
ja: サーバーは、ヘッダーが大きすぎるため、リクエストの処理を拒否しました。
zh: 服务器不愿处理请求，因为其头部过大。

source: The `431 (Request Header Fields Too Large)` status code indicates that the server is unwilling to process the request because its header fields are too large.
es: El código de estado `431 (Campos de encabezado de solicitud demasiado grandes)` indica que el servidor no está dispuesto a procesar la solicitud porque sus campos de encabezado son demasiado grandes.
fr: Le code d'état `431 (Request Header Fields Too Large)` indique que le serveur refuse de traiter la requête car ses champs d'en-tête sont trop volumineux.
ja: `431 (Request Header Fields Too Large)` ステータスコードは、サーバーがリクエストのヘッダーフィールドが大きすぎるために処理を拒否したことを示します。
zh: `431 (Request Header Fields Too Large)` 状态码表示服务器不愿意处理该请求，因为其请求头字段过大。
