Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: `Content-Length` is used by HTTP to delimit messages; that is, to mark the end of one message and the beginning of the next. An incorrect `Content-Length` can cause security and interoperability issues. The actual content size was %(content_length)s bytes.
es: `Content-Length` es usado por HTTP para delimitar mensajes; es decir, para marcar el final de un mensaje y el principio del siguiente. Un `Content-Length` incorrecto puede causar problemas de seguridad e interoperabilidad. El tamaño real del contenido fue de %(content_length)s bytes.
fr: `Content-Length` est utilisé par HTTP pour délimiter les messages ; c'est-à-dire pour marquer la fin d'un message et le début du suivant. Un `Content-Length` incorrect peut causer des problèmes de sécurité et d'interopérabilité. La taille réelle du contenu était de %(content_length)s octets.
ja: `Content-Length` は HTTP でメッセージを区切るために使用されます。つまり、あるメッセージの終端と次のメッセージの開始を示します。不正確な `Content-Length` は、セキュリティおよび相互運用性の問題を引き起こす可能性があります。 実際のコンテンツサイズは %(content_length)s バイトでした。
zh: `Content-Length` 用于 HTTP 分隔消息；也就是说，标记一个消息的结束和下一个消息的开始。不正确的 `Content-Length` 可能导致安全和互操作性问题。 实际内容大小为 %(content_length)s 字节。

source: %(message)s can not have content.
es: No puede tener contenido %(message)s.
fr: %(message)s ne peut pas avoir de contenu.
ja: %(message)s にはコンテンツを含めることができません。

source: The %(method)s doesn't define any meaning for content.
es: El %(method)s no define ningún significado para el contenido.
fr: Le %(method)s n' définit aucune signification pour le contenu.
ja: The %(method)s にはコンテンツの意味を定義する内容が含まれていません。

source: There are no defined semantics for content in %(method)s requests. While HTTP's framing layer allows content to appear, that does not mean it is valid for every request method, and including content in a %(method)s request can cause interoperability and security issues.
es: No hay semántica definida para el contenido en %(method)s solicitudes. Aunque la capa de framing de HTTP permite que el contenido aparezca, eso no significa que sea válido para todos los métodos de solicitud, e incluir contenido en una %(method)s solicitud puede causar problemas de interoperabilidad y seguridad.
fr: Il n’y a pas de sémantique définie pour le contenu dans les %(method)s requêtes. Bien que la couche de framing HTTP permette l’apparition de contenu, cela ne signifie pas qu’il est valide pour chaque méthode de requête, et l’inclusion de contenu dans une %(method)s requête peut causer des problèmes d’interopérabilité et de sécurité.
ja: コンテンツのセマンティクスは %(method)s リクエストで定義されていません。HTTP のフレーム層はコンテンツを許可しますが、すべてのリクエスト メソッドで有効であるとは限りません。リクエストにコンテンツを含めると、互換性とセキュリティの問題が発生する可能性があります。

source: The URI is very long (%(uri_len)s characters).
es: La URI es muy larga (%(uri_len)s caracteres).
fr: L'URI est très long (%(uri_len)s caractères).
ja: URIが長すぎます（%(uri_len)s文字）。
zh: URI 非常长（%(uri_len)s 个字符）。

source: Long URIs aren't supported by some implementations, including proxies. A reasonable upper size limit is 8192 characters.
es: Las URIs largas no están soportadas por algunas implementaciones, incluyendo proxies. Un límite de tamaño razonable es 8192 caracteres.
fr: Certaines implémentations, y compris les proxys, ne prennent pas en charge les URI longs. Une limite supérieure raisonnable est de 8192 caractères.
ja: 一部の実装（プロキシなど）では、長いURIはサポートされていません。合理的な上限サイズは8192文字です。
zh: 长 URI 不被某些实现（包括代理）支持。一个合理的上限是 8192 个字符。

source: The URI's syntax isn't valid.
es: La sintaxis de la URI no es válida.
fr: La syntaxe de l'URI n'est pas valide.
ja: URI の構文が無効です。
zh: URI 的语法无效。

source: This isn't a valid URI. See [RFC3986](http://www.ietf.org/rfc/rfc3986.txt) for more information.
es: Esta no es una URI válida. Consulte [RFC3986](http://www.ietf.org/rfc/rfc3986.txt) para más información.
fr: Ce n'est pas une URI valide. Voir [RFC3986](http://www.ietf.org/rfc/rfc3986.txt) pour plus d'informations.
ja: これは有効なURIではありません。[RFC3986](http://www.ietf.org/rfc/rfc3986.txt) を参照してください。
zh: 这不是一个有效的 URI。更多信息请参阅 [RFC3986](http://www.ietf.org/rfc/rfc3986.txt)。

source: The status code is not an integer.
es: El código de estado no es un entero.
fr: Le code d'état n'est pas un entier.
ja: ステータスコードは整数ではありません。
zh: 状态码不是整数。

source: This isn't a valid status code; it needs to be an ASCII integer.
es: Este no es un código de estado válido; debe ser un entero ASCII.
fr: Ce n'est pas un code d'état valide ; il doit s'agir d'un entier ASCII.
ja: これは有効なステータスコードではありません。ASCII整数である必要があります。
zh: 这并非一个有效的状态码；它需要是一个 ASCII 整数。

source: The status phrase contains non-ASCII characters.
es: La frase de estado contiene caracteres no ASCII.
fr: La phrase d'état contient des caractères non ASCII.
ja: ステータスフレーズにASCII以外の文字が含まれています。
zh: 状态短语包含非 ASCII 字符。

source: The status phrase can only contain ASCII characters.
es: La frase de estado solo puede contener caracteres ASCII.
fr: La phrase d'état ne peut contenir que des caractères ASCII.
ja: ステータスフレーズにはASCII文字のみを含めることができます。
zh: 状态短语只能包含 ASCII 字符。

source: The User-Agent header is missing.
es: Falta la cabecera User-Agent.
fr: L'en-tête User-Agent est manquant.
ja: User-Agent ヘッダーが見つかりません。
zh: 缺少 User-Agent 标头。

source: Clients SHOULD send a `User-Agent` header field. See [RFC 9110 Section 10.1.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.5) for details.
es: Los clientes DEBERÍAN enviar un campo de encabezado `User-Agent`. Consulte [RFC 9110 Sección 10.1.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.5) para ver los detalles.
fr: Les clients DOIVENT envoyer un champ d'en-tête `User-Agent`. Voir [RFC 9110 Section 10.1.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.5) pour plus de détails.
ja: クライアントは `User-Agent` ヘッダーフィールドを送信する必要があります。 詳細は [RFC 9110 Section 10.1.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.5) を参照してください。
zh: 客户端应发送 `User-Agent` 标头字段。 有关详情，请参阅 [RFC 9110 Section 10.1.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.5)。

source: message
es: mensaje
ja: メッセージ
zh: 消息

source: trailer
es: traila
fr: trajet
ja: トレーラー

source: header
es: Encabezado
fr: en-tête
ja: ヘッダー

source: request
es: solicitud
fr: requête
ja: リクエスト
zh: 请求

source: response
es: respuesta
fr: réponse
ja: レスポンス
zh: 响应

source: Browser Security
es: Seguridad del navegador
fr: Sécurité du navigateur
ja: ブラウザセキュリティ
zh: 浏览器安全

source: Content Negotiation
es: Negociación de contenido
fr: Négociation de contenu
ja: コンテンツネゴシエーション
zh: 内容协商

source: Caching
es: Almacenamiento en caché
fr: Mise en cache
ja: キャッシング
zh: 缓存

source: Validation
es: Validación
ja: 検証
zh: 验证

source: Connection
es: Conexión
fr: Connexion
ja: 接続
zh: 连接

source: Partial Content
es: Contenido Parcial
fr: Contenu partiel
ja: 部分コンテンツ
zh: 部分内容

source: 304 (Not Modified) responses need to have a Date header.
es: Las respuestas 304 (No modificado) necesitan tener una cabecera Date.
fr: Les réponses 304 (Not Modified) doivent avoir un en-tête Date.
ja: 304 (Not Modified) レスポンスには Date ヘッダーが必要です。
zh: 304 (未修改) 响应需要包含 Date 报头。

source: HTTP requires `304 (Not Modified)` responses to have a `Date` header in all but the most unusual circumstances.
es: HTTP requiere que las respuestas `304 (No Modificado)` tengan una cabecera `Date` en casi todas las circunstancias.
fr: HTTP exige que les réponses `304 (Not Modified)` incluent un en-tête `Date` dans presque toutes les circonstances.
ja: HTTPは、ごくまれな例外を除き、`304 (Not Modified)` レスポンスに `Date` ヘッダーを含めることを要求します。
zh: HTTP 要求 `304 (Not Modified)` 响应在大多数非极端情况下都必须包含 `Date` 报头。

source: This 304 (Not Modified) response contains headers that should not be sent.
es: Esta respuesta 304 (No modificado) contiene cabeceras que no deberían enviarse.
fr: Cette 304 (Not Modified) réponse contient des en-têtes qui ne devraient pas être envoyés.
ja: この304 (Not Modified) レスポンスには、送信されるべきではないヘッダーが含まれています。
zh: 此 304 (未修改) 响应包含不应发送的标头。

source: These headers are representation metadata that should not be sent in a 304 response unless they are being used to guide cache updates: %(headers)s See [RFC 9110 Section 15.4.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-15.4.5) for more information.
es: Estas cabeceras son metadatos de representación que no deben enviarse en una respuesta 304 a menos que se utilicen para guiar las actualizaciones de caché: %(headers)s Consulte [RFC 9110 Sección 15.4.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-15.4.5) para más información.
fr: Ces en-têtes sont des métadonnées de représentation qui ne doivent pas être envoyées dans une réponse 304, sauf si elles sont utilisées pour guider les mises à jour du cache : %(headers)s Voir [RFC 9110 Section 15.4.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-15.4.5) pour plus d’informations.
ja: これらのヘッダーは、キャッシュ更新のガイダンスに使用されている場合を除き、304 レスポンスでは送信されるべきではない表現メタデータです。 %(headers)s 詳細については、[RFC 9110 セクション 15.4.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-15.4.5) を参照してください。
zh: 这些标头是表示元数据，除非用于指导缓存更新，否则不应在 304 响应中发送： %(headers)s 有关更多信息，请参阅 [RFC 9110 Section 15.4.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-15.4.5)。

source: A 100 (Continue) response was sent when it wasn't asked for.
es: Se envió una respuesta 100 (Continue) cuando no se solicitó.
fr: Une réponse 100 (Continue) a été envoyée alors qu'elle n'était pas demandée.
ja: 100 (Continue) レスポンスは、要求されていないのに送信されました。
zh: 发送了不必要的 100 (Continue) 响应。

source: HTTP allows clients to ask a server if a request containing content (e.g., uploading a large file) will succeed before sending it, using a mechanism called "Expect/continue". When used, the client sends an `Expect: 100-continue`, in the request headers, and if the server is willing to process it, it will send a `100 (Continue)` status code to indicate that the request should continue. This response has a `100 (Continue)` status code, but the request did not ask for it using the `Expect` request header. Sending this status code without it being requested can cause interoperability problems.
es: HTTP permite a los clientes preguntar a un servidor si una solicitud que contiene contenido (por ejemplo, la carga de un archivo grande) tendrá éxito antes de enviarla, utilizando un mecanismo llamado "Expect/continue". Cuando se utiliza, el cliente envía un `Expect: 100-continue` en las cabeceras de la solicitud, y si el servidor está dispuesto a procesarla, enviará un código de estado `100 (Continue)` para indicar que la solicitud debe continuar. Esta respuesta tiene un código de estado `100 (Continue)`, pero la solicitud no lo pidió utilizando la cabecera de solicitud `Expect`. Enviar este código de estado sin que se solicite puede causar problemas de interoperabilidad.
fr: HTTP permet aux clients de demander à un serveur si une requête contenant du contenu (par exemple, l'envoi d'un fichier volumineux) peut aboutir avant de l'envoyer, grâce à un mécanisme appelé "Expect/continue". Lorsqu'il est utilisé, le client envoie un `Expect: 100-continue`, dans les en-têtes de la requête, et si le serveur est disposé à la traiter, il renverra un code d'état `100 (Continue)` pour indiquer que la requête doit se poursuivre. Cette réponse a un code d'état `100 (Continue)`, mais la requête ne l'a pas demandé en utilisant l'en-tête de requête `Expect`. L'envoi de ce code d'état sans qu'il soit demandé peut entraîner des problèmes d'interopérabilité.
ja: HTTP は、クライアントが「Expect/continue」と呼ばれるメカニズムを使用して、サーバーにコンテンツ（例: 大規模なファイルのアップロード）を含むリクエストが送信前に成功するかどうかをサーバーに尋ねることを可能にします。 使用される場合、クライアントはリクエストヘッダーに `Expect: 100-continue` を送信し、サーバーがそれを処理する意思がある場合、リクエストを続行するように示すために `100 (Continue)` ステータスコードを送信します。 このレスポンスは `100 (Continue)` ステータスコードを持っていますが、リクエストは `Expect` リクエストヘッダーを使用してそれを要求しませんでした。要求されていないステータスコードを送信すると、相互運用性の問題を引き起こす可能性があります。
zh: HTTP 允许客户端在发送包含内容的请求（例如上传大文件）之前，先询问服务器该请求是否会成功，这通过一种称为“Expect/continue”的机制来实现。 使用时，客户端会在请求头中发送 `Expect: 100-continue`，如果服务器愿意处理该请求，它会发送一个 `100 (Continue)` 状态码，表示请求应继续。 此响应具有 `100 (Continue)` 状态码，但请求未使用 `Expect` 请求头进行此要求。在未被要求的情况下发送此状态码可能会导致互操作性问题。

source: The protocol was upgraded without being requested.
es: El protocolo se actualizó sin ser solicitado.
fr: Le protocole a été mis à niveau sans avoir été demandé.
ja: プロトコルは要求されずにアップグレードされました。
zh: 协议在未被请求的情况下被升级。

source: HTTP defines the `Upgrade` header as a means of negotiating a change of protocol; i.e., it allows you to switch the protocol on a given connection from HTTP to something else. This response was upgraded, but the request did not contain an `Upgrade` header field.
es: HTTP define la cabecera `Upgrade` como un medio para negociar un cambio de protocolo; es decir, permite cambiar el protocolo en una conexión dada de HTTP a otra cosa. Esta respuesta se actualizó, pero la solicitud no contenía un campo de cabecera `Upgrade`.
fr: HTTP définit l'en-tête `Upgrade` comme un moyen de négocier un changement de protocole ; c'est-à-dire qu'il vous permet de passer le protocole sur une connexion donnée de HTTP à autre chose. Cette réponse a été mise à niveau, mais la requête ne contenait pas de champ d'en-tête `Upgrade`.
ja: HTTP は、プロトコルの変更をネゴシエートする手段として `Upgrade` ヘッダーを定義しています。つまり、指定された接続のプロトコルを HTTP から別のものに切り替えることができます。 このレスポンスはアップグレードされましたが、リクエストには `Upgrade` ヘッダーフィールドが含まれていませんでした。
zh: HTTP 将 `Upgrade` 标头定义为协商协议更改的一种方式；即，它允许您将给定连接上的协议从 HTTP 切换到其他协议。 此响应已升级，但请求中不包含 `Upgrade` 标头字段。

source: A new resource was created in response to a safe request.
es: Se creó un nuevo recurso en respuesta a una solicitud segura.
fr: Une nouvelle ressource a été créée en réponse à une requête sûre.
ja: 安全なリクエストへの応答として、新しいリソースが作成されました。
zh: 已根据安全请求创建了新资源。

source: The `201 (Created)` status code indicates that the request created a new resource. However, the request method used (%(method)s) is defined as a "safe" method; that is, it should not have any side effects. Creating resources as a side effect of a safe method can have unintended consequences; for example, search engine spiders and similar automated agents often follow links, and intermediaries sometimes re-try safe methods when they fail.
es: El código de estado `201 (Created)` indica que la solicitud creó un nuevo recurso. Sin embargo, el método de solicitud utilizado (%(method)s) se define como un método "seguro"; es decir, no debería tener ningún efecto secundario. Crear recursos como efecto secundario de un método seguro puede tener consecuencias no deseadas; por ejemplo, los rastreadores de motores de búsqueda y agentes automatizados similares a menudo siguen enlaces, y los intermediarios a veces reintentan métodos seguros cuando fallan.
fr: Le code d'état `201 (Created)` indique que la requête a créé une nouvelle ressource. Cependant, la méthode de requête utilisée (`%(method)s`) est définie comme une méthode « sûre » ; c'est-à-dire qu'elle ne devrait avoir aucun effet secondaire. La création de ressources comme effet secondaire d'une méthode sûre peut avoir des conséquences imprévues ; par exemple, les robots d'exploration des moteurs de recherche et les agents automatisés similaires suivent souvent les liens, et les intermédiaires réessayent parfois les méthodes sûres en cas d'échec.
ja: `201 (Created)` ステータスコードは、リクエストによって新しいリソースが作成されたことを示します。 ただし、使用されたリクエストメソッド（%(method)s）は、「セーフ」メソッドとして定義されています。つまり、副作用があってはなりません。 セーフメソッドの副作用としてリソースを作成すると、意図しない結果を招く可能性があります。たとえば、検索エンジンスパイダーや同様の自動エージェントはリンクをたどることが多く、中間サーバーは失敗した場合にセーフメソッドを再試行することがあります。
zh: `201 (Created)` 状态码表示请求创建了一个新资源。 然而，使用的请求方法 `%(method)s` 被定义为“安全”方法；也就是说，它不应该产生任何副作用。 创建资源作为安全方法的副作用可能会产生意想不到的后果；例如，搜索引擎爬虫和类似的自动化代理经常会跟踪链接，而中间件有时会在安全方法失败时重试。

source: A new resource was created without its location being sent.
es: Se creó un nuevo recurso sin que se enviara su ubicación.
fr: Une nouvelle ressource a été créée sans que son emplacement ne soit envoyé.
ja: 新しいリソースが、その場所（Locationヘッダー）なしで作成されました。
zh: 新资源创建时未发送其位置。

source: The `201 (Created)` status code indicates that the request created a new resource. HTTP specifies that the URL of the new resource is to be indicated in the `Location` header, but it isn't present in this response.
es: El código de estado `201 (Created)` indica que la solicitud creó un nuevo recurso. HTTP especifica que la URL del nuevo recurso debe indicarse en la cabecera `Location`, pero no está presente en esta respuesta.
fr: Le code d'état `201 (Created)` indique que la requête a créé une nouvelle ressource. HTTP spécifie que l'URL de la nouvelle ressource doit être indiquée dans l'en-tête `Location`, mais il n'est pas présent dans cette réponse.
ja: `201 (Created)` ステータスコードは、リクエストが新しいリソースを作成したことを示します。 HTTPでは、新しいリソースのURLを`Location`ヘッダーで示すことになっていますが、このレスポンスには存在しません。
zh: `201 (Created)` 状态码表示请求创建了一个新资源。 HTTP 规定新资源的 URL 应在 `Location` 头部中指明，但在此响应中并未找到。

source: This response is partial, but doesn't have a Content-Range header.
es: Esta respuesta es parcial, pero no tiene una cabecera Content-Range.
fr: Cette réponse est partielle, mais n'a pas d'en-tête Content-Range.
ja: このレスポンスは部分的ですが、Content-Range ヘッダーがありません。
zh: 此响应是部分的，但没有 Content-Range 标头。

source: The `206 (Partial Response)` status code indicates that the response content is only partial. However, for a response to be partial, it needs to have a `Content-Range` header to indicate what part of the full response it carries. This response does not have one.
es: El código de estado `206 (Respuesta Parcial)` indica que el contenido de la respuesta es solo parcial. Sin embargo, para que una respuesta sea parcial, necesita tener una cabecera `Content-Range` para indicar qué parte de la respuesta completa transporta. Esta respuesta no la tiene.
fr: Le code d'état `206 (Réponse partielle)` indique que la réponse ne contient qu'une partie de la ressource demandée. Cependant, pour qu'une réponse soit partielle, elle doit avoir un en-tête `Content-Range` pour indiquer quelle partie de la réponse complète elle transporte. Cette réponse n'en a pas.
ja: `206 (Partial Response)` ステータスコードは、レスポンスコンテンツが一部であることを示します。 しかし、レスポンスが一部であるためには、完全なレスポンスのどの部分を運んでいるかを示す `Content-Range` ヘッダーが必要です。このレスポンスにはそれがないようです。
zh: `206 (Partial Response)` 状态码表示响应内容仅为部分内容。 但是，要使响应成为部分响应，它需要包含 `Content-Range` 报头来指示其携带的是完整响应的哪一部分。此响应缺少该报头。

source: A partial response was sent when it wasn't requested.
es: Se envió una respuesta parcial cuando no se solicitó.
fr: Une réponse partielle a été envoyée alors qu'elle n'était pas demandée.
ja: 一部のレスポンスが、要求されていないのに送信されました。
zh: 发送了部分响应，但并未请求。

source: The `206 (Partial Response)` status code indicates that the response content is only partial. However, the client needs to ask for it with the `Range` header, and the request did not include one.
es: El código de estado `206 (Respuesta parcial)` indica que el contenido de la respuesta es solo parcial. Sin embargo, el cliente necesita solicitarlo con la cabecera `Range`, y la solicitud no incluía una.
fr: Le code d'état `206 (Partial Response)` indique que la réponse ne contient qu'une partie de la ressource demandée. Cependant, le client doit le demander avec l'en-tête `Range`, et la requête n'en incluait pas.
ja: `206 (Partial Response)` ステータスコードは、レスポンスコンテンツが一部であることを示します。 しかし、クライアントは `Range` ヘッダーでそれを要求する必要がありましたが、リクエストには含まれていませんでした。
zh: `206 (Partial Response)` 状态码表示响应内容仅为部分内容。 然而，客户端需要使用 `Range` 标头来请求它，而请求中未包含该标头。

source: Redirects need to have a Location header.
es: Las redirecciones necesitan una cabecera Location.
fr: Les redirections doivent avoir un en-tête Location.
ja: リダイレクトには Location ヘッダーが必要です。
zh: 重定向需要有 Location 头。

source: The %(status)s status code redirects users to another URI. The `Location` header is used to convey this URI, but a valid one isn't present in this response.
es: El código de estado %(status)s redirige a los usuarios a otra URI. La cabecera `Location` se utiliza para transmitir esta URI, pero no hay una válida presente en esta respuesta.
fr: Le code d'état %(status)s redirige les utilisateurs vers un autre URI. L'en-tête `Location` est utilisé pour transmettre cet URI, mais un URI valide n'est pas présent dans cette réponse.
ja: %(status)s ステータスコードは、ユーザーを別の URI にリダイレクトします。`Location` ヘッダーはこの URI を伝えるために使用されますが、このレスポンスには有効なものが含まれていません。
zh: %(status)s 状态码会将用户重定向到另一个 URI。`Location` 标头用于 传达此 URI，但此响应中没有有效的 URI。

source: The %(status)s status code is deprecated.
es: El código de estado %(status)s está obsoleto.
fr: Le code d'état %(status)s est obsolète.
ja: %(status)s ステータスコードは非推奨です。
zh: %(status)s 状态码已被弃用。

source: When a status code is deprecated, it should not be used, because its meaning is not well-defined enough to ensure interoperability.
es: Cuando un código de estado está obsoleto, no debe usarse, porque su significado no está bien definido para garantizar la interoperabilidad.
fr: Lorsqu'un code d'état est obsolète, il ne doit pas être utilisé, car sa signification n'est pas assez bien définie pour garantir l'interopérabilité.
ja: ステータスコードが非推奨の場合は、相互運用性を確保するのに十分なほど意味が定義されていないため、使用しないでください。
zh: 当状态码被弃用时，不应使用，因为其含义没有得到充分定义，无法确保互操作性。

source: The %(status)s status code is reserved.
es: El código de estado %(status)s está reservado.
fr: Le code d'état %(status)s est réservé.
ja: %(status)s ステータスコードは予約されています。
zh: %(status)s 状态码是保留的。

source: Reserved status codes can only be used by future, standard protocol extensions; they are not for private use.
es: Los códigos de estado reservados solo pueden ser utilizados por futuras extensiones del protocolo estándar; no son para uso privado.
fr: Les codes d'état réservés ne peuvent être utilisés que par de futures extensions de protocole standard ; ils ne sont pas destinés à un usage privé.
ja: 予約済みステータスコードは、将来の標準プロトコル拡張でのみ使用でき、プライベートな用途には使用できません。
zh: 保留状态码只能由未来的标准协议扩展使用，不能用于私人用途。

source: %(status)s is not a standard HTTP status code.
es: %(status)s no es un código de estado HTTP estándar.
fr: %(status)s n'est pas un code d'état HTTP standard.
ja: %(status)s は標準的な HTTP ステータスコードではありません。
zh: %(status)s 不是标准的 HTTP 状态码。

source: Non-standard status codes are not well-defined and interoperable. Instead of defining your own status code, you should reuse one of the more generic ones; for example, `400` for a client-side problem, or `500` for a server-side problem.
es: Los códigos de estado no estándar no están bien definidos e interoperables. En lugar de definir su propio código de estado, debería reutilizar uno de los más genéricos; por ejemplo, `400` para un problema del lado del cliente, o `500` para un problema del lado del servidor.
fr: Les codes d'état non standard ne sont ni bien définis ni interopérables. Au lieu de définir votre propre code d'état, vous devriez réutiliser l'un des codes plus génériques ; par exemple, `400` pour un problème côté client, ou `500` pour un problème côté serveur.
ja: 標準的でないステータスコードは、定義が不明確で相互運用性が低いです。独自のステータスコードを定義する代わりに、より汎用的なもの（例：クライアント側の問題の場合は`400`、サーバー側の問題の場合は`500`）を再利用してください。
zh: 非标准状态码定义不清且互操作性差。你不应定义自己的状态码，而应重用更通用的状态码；例如，客户端问题使用 `400`，服务器端问题使用 `500`。

source: The server didn't understand the request.
es: El servidor no entendió la solicitud.
fr: Le serveur n'a pas compris la requête.
ja: サーバーがリクエストを理解できませんでした。
zh: 服务器不理解请求。

source: The server has forbidden this request.
es: El servidor ha prohibido esta solicitud.
fr: Le serveur a interdit cette requête.
ja: サーバーはこのリクエストを禁止しました。
zh: 服务器已禁止此请求。

source: The resource does not allow the %(method)s method.
es: El recurso no permite el método %(method)s.
fr: La ressource ne permet pas la méthode %(method)s.

source: The `405 (Method Not Allowed)` status code indicates that the HTTP method is known by the origin server but not supported by the target resource.
es: El código de estado `405 (Método no permitido)` indica que el método HTTP es conocido por el servidor de origen, pero no es compatible con el recurso de destino.
fr: Le code d'état `405 (Méthode non autorisée)` indique que la méthode HTTP est connue par le serveur d'origine mais n'est pas prise en charge par la ressource cible.
