Repository: mnot/httplint
Catalog: httplint/translations/*/LC_MESSAGES/messages.po
Languages: es, fr, ja, zh

source: The `Version` attribute is no longer part of the `Set-Cookie` specification, and is ignored by browsers. Because some software still interprets cookies differently when it is present, [it can cause security issues](https://portswigger.net/research/bypassing-wafs-with-the-phantom-version-cookie).
es: El atributo 'Version' ya no forma parte de la especificación de 'Set-Cookie' e es ignorado por los navegadores. Debido a que algunos softwares interpretan las cookies de forma diferente cuando este atributo está presente, [puede causar problemas de seguridad](https://portswigger.net/research/bypassing-wafs-with-the-phantom-version-cookie).
fr: L'attribut `Version` n'est plus pris en compte dans la spécification de l'en-tête `Set-Cookie`, et est ignoré par les navigateurs. Puisque certains logiciels interprètent toujours les cookies différemment lorsqu'il est présent, [cela peut causer des problèmes de sécurité](https://portswigger.net/research/bypassing-wafs-with-the-phantom-version-cookie).

source: The %(cookie_name)s cookie has an unknown '%(attribute_name)s' attribute value.
es: La cookie "%(cookie_name)s" tiene un valor de atributo "%(attribute_name)s" desconocido.
fr: Le cookie %(cookie_name)s a une valeur d'attribut '%(attribute_name)s' inconnue.
ja: %(cookie_name)s クッキーに、不明な '%(attribute_name)s' 属性値があります。
zh: Cookie %(cookie_name)s 包含一个未知的“%(attribute_name)s”属性值。

source: This `Set-Cookie` header has an unknown "%(attribute_name)s" attribute value, "%(attribute_value)s". Browsers will probably ignore it as a result.
es: Esta cabecera `Set-Cookie` tiene un valor de atributo "%(attribute_name)s" desconocido, "%(attribute_value)s". Es probable que los navegadores lo ignoren como resultado.
fr: Cet en-tête `Set-Cookie` contient une valeur d'attribut "%(attribute_name)s" inconnue, "%(attribute_value)s". Les navigateurs l'ignoreront probablement en conséquence.
ja: この `Set-Cookie` ヘッダーには、不明な "%(attribute_name)s" 属性値 "%(attribute_value)s" が含まれています。 このため、ブラウザはこれを無視する可能性が高いです。
zh: 此 `Set-Cookie` 标头包含一个未知的 "%(attribute_name)s" 属性值 "%(attribute_value)s"。 浏览器很可能会忽略它。

source: The %(cookie_name)s cookie has the Partitioned attribute but is missing the Secure attribute.
es: La cookie %(cookie_name)s tiene el atributo Partitioned pero le falta el atributo Secure.
fr: Le cookie %(cookie_name)s a l'attribut Partitioned mais il lui manque l'attribut Secure.
ja: %(cookie_name)s クッキーには Partitioned 属性がありますが、Secure 属性がありません。
zh: %(cookie_name)s cookie 具有 Partitioned 属性，但缺少 Secure 属性。

source: The `Partitioned` attribute on this `Set-Cookie` header is present, but the `Secure` attribute is missing. Browsers will ignore the `Partitioned` attribute as a result.
es: El atributo `Partitioned` en esta cabecera `Set-Cookie` está presente, pero falta el atributo `Secure`. Como resultado, los navegadores ignorarán el atributo `Partitioned`.
fr: L'attribut `Partitioned` sur cet en-tête `Set-Cookie` est présent, mais l'attribut `Secure` est manquant. Les navigateurs ignoreront l'attribut `Partitioned` en conséquence.
ja: この `Set-Cookie` ヘッダーの `Partitioned` 属性は存在しますが、`Secure` 属性がありません。 その結果、ブラウザはこの `Partitioned` 属性を無視します。
zh: 此 `Set-Cookie` 标头上的 `Partitioned` 属性已存在，但缺少 `Secure` 属性。 结果，浏览器将忽略 `Partitioned` 属性。

source: The %(cookie_name)s Set-Cookie header is too large.
es: La cabecera Set-Cookie %(cookie_name)s es demasiado grande.
fr: L'en-tête Set-Cookie %(cookie_name)s est trop volumineux.
ja: %(cookie_name)s Set-Cookie ヘッダーが大きすぎます。
zh: %(cookie_name)s Set-Cookie 标头过大。

source: The `Set-Cookie` header is larger than 4096 bytes. Browsers will ignore this cookie.
es: La cabecera `Set-Cookie` es mayor que 4096 bytes. Los navegadores ignorarán esta cookie.
fr: L'en-tête `Set-Cookie` est plus grand que 4096 octets. Les navigateurs ignoreront ce cookie.
ja: `Set-Cookie` ヘッダーが 4096 バイトを超えています。 ブラウザーはこの Cookie を無視します。
zh: `Set-Cookie` 标头大于 4096 字节。 浏览器将忽略此 Cookie。

source: The %(cookie_name)s Set-Cookie value is large.
es: El valor de Set-Cookie de %(cookie_name)s es grande.
fr: La valeur Set-Cookie %(cookie_name)s est grande.
ja: %(cookie_name)s の Set-Cookie 値は大きすぎます。
zh: %(cookie_name)s Set-Cookie 值过大。

source: This `Set-Cookie` value is %(set_cookie_value_length)s long.
es: Este valor `Set-Cookie` es de %(set_cookie_value_length)s longitud.
fr: Cette valeur `Set-Cookie` est de %(set_cookie_value_length)s longueur.

source: The %(cookie_name)s Set-Cookie header has a lifetime that is too long.
es: La cabecera Set-Cookie de %(cookie_name)s tiene una vida útil demasiado larga.
fr: L'en-tête Set-Cookie %(cookie_name)s a une durée de vie trop longue.
ja: %(cookie_name)s Set-Cookie ヘッダーの有効期間が長すぎます。
zh: %(cookie_name)s Set-Cookie 标头中的有效期过长。

source: The `Set-Cookie` header has a lifetime (Max-Age or Expires) of %(duration)s, which is greater than 400 days. Browsers will cap the lifetime to 400 days.
es: La cabecera 'Set-Cookie' tiene una vida útil (Max-Age o Expires) de %(duration)s, lo que es mayor a 400 días. Los navegadores limitarán la vida útil a 400 días.
fr: La tête `Set-Cookie` a une durée de vie (`Max-Age` ou `Expires`) de %(duration)s, ce qui est supérieur à 400 jours. Les navigateurs limiteront la durée de vie à 400 jours.

source: The %(cookie_name)s Set-Cookie header requires the Secure attribute.
es: La cabecera Set-Cookie de %(cookie_name)s requiere el atributo Secure.
fr: L'en-tête Set-Cookie %(cookie_name)s nécessite l'attribut Secure.
ja: %(cookie_name)s Set-Cookie ヘッダーには Secure 属性が必要です。
zh: %(cookie_name)s Set-Cookie 标头需要 Secure 属性。

source: The `Set-Cookie` header has a prefix (e.g., `__Secure-` or `__Host-`) that requires the `Secure` attribute. Browsers will reject this cookie.
es: La cabecera `Set-Cookie` tiene un prefijo (por ejemplo, `__Secure-` o `__Host-`) que requiere el atributo `Secure`. Los navegadores rechazarán esta cookie.
fr: L'en-tête `Set-Cookie` possède un préfixe (par exemple, `__Secure-` ou `__Host-`) qui nécessite l'attribut `Secure`. Les navigateurs rejetteront ce cookie.
ja: `Set-Cookie` ヘッダーにプレフィックス (例: `__Secure-` または `__Host-`) があり、`Secure` 属性が必要です。 ブラウザはこのクッキーを拒否します。
zh: `Set-Cookie` 标头具有需要 `Secure` 属性的前缀（例如 `__Secure-` 或 `__Host-`）。 浏览器将拒绝此 cookie。

source: The %(cookie_name)s Set-Cookie header has a __Host- prefix but sets a Domain.
es: La cabecera Set-Cookie de %(cookie_name)s tiene el prefijo __Host- pero establece un Dominio.
fr: L'en-tête Set-Cookie de %(cookie_name)s possède un préfixe __Host- mais définit un Domain.
ja: `%(cookie_name)s` Set-Cookie ヘッダーに `__Host-` プレフィックスがありますが、Domain が設定されています。
zh: %(cookie_name)s Set-Cookie 标头具有 __Host- 前缀但设置了 Domain。

source: The `Set-Cookie` header has a `__Host-` prefix, but it sets a `Domain` attribute. Browsers will reject this cookie.
es: El encabezado `Set-Cookie` tiene el prefijo `__Host-`, pero establece un atributo `Domain`. Los navegadores rechazarán esta cookie.
fr: L'en-tête `Set-Cookie` a un préfixe `__Host-`, mais il définit un attribut `Domain`. Les navigateurs rejetteront ce cookie.
ja: `Set-Cookie` ヘッダーに `__Host-` プレフィックスがありますが、`Domain` 属性が設定されています。 ブラウザはこの Cookie を拒否します。
zh: `Set-Cookie` 标头具有 `__Host-` 前缀，但它设置了 `Domain` 属性。 浏览器将拒绝此 Cookie。

source: The %(cookie_name)s Set-Cookie header has a __Host- prefix but does not set Path=/.
es: La cabecera Set-Cookie de %(cookie_name)s tiene el prefijo __Host- pero no establece Path=/.
fr: L'en-tête Set-Cookie %(cookie_name)s possède un préfixe __Host- mais ne définit pas Path=/.
ja: `%(cookie_name)s` Set-Cookieヘッダーには`__Host-`プレフィックスが付いていますが、Path=/が設定されていません。
zh: %(cookie_name)s Set-Cookie 标头包含 __Host- 前缀，但未设置 Path=/.

source: The `Set-Cookie` header has a `__Host-` prefix, but it does not set `Path=/`. Browsers will reject this cookie.
es: El encabezado `Set-Cookie` tiene un prefijo `__Host-`, pero no establece `Path=/`. Los navegadores rechazarán esta cookie.
fr: L'en-tête `Set-Cookie` a un préfixe `__Host-`, mais il ne définit pas `Path=/`. Les navigateurs rejetteront ce cookie.
ja: `Set-Cookie` ヘッダーに `__Host-` プレフィックスがありますが、`Path=/` が設定されていません。 ブラウザはこのクッキーを拒否します。
zh: `Set-Cookie` 標頭具有 `__Host-` 前綴，但未設定 `Path=/`。 瀏覽器將拒絕此 cookie。

source: The %(cookie_name)s Set-Cookie header has duplicate '%(attribute)s' attributes.
es: La cabecera Set-Cookie de %(cookie_name)s tiene atributos '%(attribute)s' duplicados.
fr: L'en-tête Set-Cookie de %(cookie_name)s possède des attributs '%(attribute)s' en double.
ja: %(cookie_name)s Set-Cookie ヘッダーに重複した '%(attribute)s' 属性があります。
zh: Set-Cookie 标头中的 %(cookie_name)s 包含重复的 “%(attribute)s” 属性。

source: The `%(attribute)s` attribute appears more than once in this `Set-Cookie` header. Browsers will only use the last occurrence.
es: El atributo `%(attribute)s` aparece más de una vez en esta cabecera `Set-Cookie`. Los navegadores solo utilizarán la última aparición.
fr: L'attribut `%(attribute)s` apparaît plus d'une fois dans cet en-tête `Set-Cookie`. Les navigateurs n'utiliseront que la dernière occurrence.
ja: `%(attribute)s` 属性がこの `Set-Cookie` ヘッダーに複数回出現しています。 ブラウザは最後の出現のみを使用します。
zh: `%(attribute)s` 属性在此 `Set-Cookie` 标头中出现多次。 浏览器只会使用最后一次出现的值。

source: This response sets duplicate cookies.
es: Esta respuesta establece cookies duplicadas.
fr: Cette réponse définit des cookies dupliqués.
ja: このレスポンスは重複したCookieを設定しています。
zh: 此响应设置了重复的 Cookie。

source: The following cookies are set more than once in this response: %(cookie_names)s. Browsers will likely accept all of them, but the order of application may vary or be confusing.
es: Las siguientes cookies se establecen más de una vez en esta respuesta: %(cookie_names)s. Es probable que los navegadores acepten todas, pero el orden de aplicación puede variar o ser confuso.
fr: Les cookies suivants sont définis plus d'une fois dans cette réponse : %(cookie_names)s. Les navigateurs accepteront probablement tous ces cookies, mais leur ordre d'application pourrait varier ou prêter à confusion.
ja: このレスポンスでは、以下のクッキーが複数回設定されています: %(cookie_names)s。 ブラウザはすべてを受け入れる可能性が高いですが、適用順序が異なる場合や混乱を招く可能性があります。
zh: 以下 Cookie 在此响应中设置了多次：%(cookie_names)s。 浏览器很可能接受所有这些 Cookie，但应用顺序可能会有所不同或令人困惑。

source: The `Set-Cookie2` header has been deprecated; use `Set-Cookie` instead.
es: La cabecera `Set-Cookie2` ha sido deprecada; usa `Set-Cookie` en su lugar.
ja: `Set-Cookie2` ヘッダーは非推奨になりました。代わりに `Set-Cookie` を使用してください。

source: The speculation rule URL is not secure.
es: La URL de la regla de especulación no es segura.
fr: La règle URL de spéculation n'est pas sécurisée.

source: The speculation rule `%(url)s` uses an insecure URL. Browsers may ignore it.
es: La regla de especulación `%(url)s` utiliza una URL insegura. Los navegadores pueden ignorarla.
fr: La règle de spéculation `%(url)s` utilise une URL non sécurisée. Les navigateurs peuvent l'ignorer.

source: The speculation rule value is invalid.
es: El valor de la especulación de la regla es inválido.
fr: La valeur de la règle de spéculation est invalide.

source: The speculation rule must be a string URL. Found: %(value)s (type `%(found_type)s`).
es: La regla de especulación debe ser una URL de cadena. Encontrado: %(value)s (tipo `%(found_type)s`).
fr: La règle de spéculation doit être une URL de chaîne. Trouvé : %(value)s (type `%(found_type)s`).

source: Strict Transport Security (HSTS) is enabled.
es: Seguridad de Transporte Estricta (HSTS) está habilitada.
fr: Strict Transport Security (HSTS) est activé.
ja: Strict Transport Security (HSTS) が有効です。
zh: 严格传输安全 (HSTS) 已启用。

source: This site has enabled HTTP Strict Transport Security (HSTS), which tells the browser to only communicate with it over a secure connection.
es: Este sitio ha habilitado HTTP Strict Transport Security (HSTS), que indica al navegador que solo se comunique con él a través de una conexión segura.
fr: Ce site a activé le HTTP Strict Transport Security (HSTS), qui indique au navigateur de ne communiquer avec lui que via une connexion sécurisée.
ja: このサイトではHTTP Strict Transport Security (HSTS) が有効になっており、ブラウザは安全な接続でのみ通信するように指示されます。
zh: 此网站已启用 HTTP 严格传输安全 (HSTS)，它会指示浏览器仅通过安全连接与其通信。

source: This response's Strict Transport Security (HSTS) header is invalid.
es: La cabecera Strict Transport Security (HSTS) de esta respuesta no es válida.
fr: L'en-tête Strict Transport Security (HSTS) de cette réponse est invalide.
ja: このレスポンスの Strict Transport Security (HSTS) ヘッダーは無効です。
zh: 此响应的 Strict Transport Security (HSTS) 标头无效。

source: This site has attempted to enable HTTP Strict Transport Security (HSTS), which tells the browser to only communicate with it over a secure connection. However, one or more issues prevent it from being valid. See the child notes for details.
es: Este sitio ha intentado habilitar HTTP Strict Transport Security (HSTS), que le indica al navegador que solo se comunique con él a través de una conexión segura. Sin embargo, uno o varios problemas impiden que sea válido. Consulte las notas secundarias para obtener más detalles.
fr: Ce site a tenté d'activer le HTTP Strict Transport Security (HSTS), qui indique au navigateur de ne communiquer avec lui que via une connexion sécurisée. Cependant, un ou plusieurs problèmes l'empêchent d'être valide. Voir les notes enfants pour plus de détails.
ja: このサイトはHTTP Strict Transport Security (HSTS) を有効にしようとしましたが、ブラウザは安全な接続でのみ通信するように指示されています。 しかし、1つ以上の問題により、有効になりませんでした。詳細は子ノートを参照してください。
zh: 此网站试图启用 HTTP Strict Transport Security (HSTS)，它会告知浏览器仅通过安全连接与其通信。 然而，一个或多个问题阻止其生效。请参阅子节点了解详情。

source: There is no max-age directive.
es: No hay directiva max-age.
fr: Il n'y a pas de directive max-age.
ja: max-age ディレクティブがありません。
zh: 没有 max-age 指令。

source: The `Strict-Transport-Security` header requires a `max-age` directive to be valid.
es: La cabecera `Strict-Transport-Security` requiere una directiva `max-age` para ser válida.
fr: L'en-tête `Strict-Transport-Security` nécessite une directive `max-age` pour être valide.
ja: `Strict-Transport-Security` ヘッダーには、有効であるために `max-age` ディレクティブが必要です。
zh: `Strict-Transport-Security` 标头需要 `max-age` 指令才有效。

source: The max-age is 0.
es: El max-age es 0.
fr: Le max-age est 0.
ja: max-age は 0 です。
zh: max-age 为 0。

source: A `max-age` of 0 tells the browser to expire the `Strict-Transport-Security` policy immediately, effectively disabling it.
es: Un `max-age` de 0 le dice al navegador que expire la política `Strict-Transport-Security` inmediatamente, deshabilitándola efectivamente.
fr: Un `max-age` de 0 indique au navigateur d'expirer immédiatement la politique `Strict-Transport-Security`, la désactivant de fait.
ja: `max-age` を 0 にすると、ブラウザは `Strict-Transport-Security` ポリシーを直ちに無効にし、事実上無効化します。
zh: `max-age` 为 0 会告诉浏览器立即使 `Strict-Transport-Security` 策略失效， 从而有效地禁用它。

source: The max-age is less than one year.
es: La antigüedad máxima es inferior a un año.
fr: Le max-age est inférieur à un an.
ja: max-age は1年未満です。
zh: max-age 小于一年。

source: Most sites should set a `max-age` of at least one year on `Strict-Transport-Security`.
es: La mayoría de los sitios deberían establecer un `max-age` de al menos un año en `Strict-Transport-Security`.
fr: La plupart des sites devraient définir un `max-age` d'au moins un an sur `Strict-Transport-Security`.
ja: ほとんどのサイトでは、`Strict-Transport-Security` に少なくとも1年間の `max-age` を設定すべきです。
zh: 大多数网站都应该在 `Strict-Transport-Security` 中设置至少一年的 `max-age`。

source: HSTS applies to subdomains.
es: HSTS se aplica a subdominios.
fr: HSTS s'applique aux sous-domaines.
ja: HSTSはサブドメインにも適用されます。
zh: HSTS 适用于子域名。

source: The `includeSubDomains` directive indicates that this HSTS policy applies to this domain as well as all of its subdomains.
es: La directiva `includeSubDomains` indica que esta política HSTS se aplica a este dominio y a todos sus subdominios.
fr: La directive `includeSubDomains` indique que cette politique HSTS s'applique à ce domaine ainsi qu'à tous ses sous-domaines.
ja: `includeSubDomains` ディレクティブは、この HSTS ポリシーがこのドメインおよびそのすべてのサブドメインに適用されることを示します。
zh: `includeSubDomains` 指令表明此 HSTS 策略也适用于此域及其所有子域。

source: HSTS doesn't apply to subdomains.
es: HSTS no se aplica a subdominios.
fr: HSTS ne s'applique pas aux sous-domaines.
ja: HSTS はサブドメインには適用されません。
zh: HSTS 不适用于子域。

source: The `includeSubDomains` directive indicates that this HSTS policy applies to this domain as well as all of its subdomains. Because cookies can be set across HTTP and HTTPS sites as well as across subdomains, this means that an attacker might be able to take advantage of a subdomain that doesn't have HSTS enabled.
es: La directiva `includeSubDomains` indica que esta política HSTS se aplica a este dominio así como a todos sus subdominios. Dado que las cookies se pueden establecer en sitios HTTP y HTTPS, así como entre subdominios, esto significa que un atacante podría aprovecharse de un subdominio que no tenga HSTS habilitado.
fr: La directive `includeSubDomains` indique que cette politique HSTS s'applique à ce domaine ainsi qu'à tous ses sous-domaines. Étant donné que les cookies peuvent être définis sur des sites HTTP et HTTPS ainsi que sur différents sous-domaines, cela signifie qu'un attaquant pourrait potentiellement exploiter un sous-domaine pour lequel HSTS n'est pas activé.
ja: `includeSubDomains` ディレクティブは、このHSTSポリシーがこのドメインおよびそのすべてのサブドメインに適用されることを示します。 CookieはHTTPサイトとHTTPSサイトの両方、およびサブドメイン全体で設定できるため、攻撃者がHSTSが有効になっていないサブドメインを利用する可能性があることを意味します。
zh: `includeSubDomains` 指令表示此 HSTS 策略也适用于本域及其所有子域。 由于 cookie 可以在 HTTP 和 HTTPS 网站之间设置，也可以在子域之间设置，因此这意味着攻击者可能能够利用未启用 HSTS 的子域。

source: Browser preloading is allowed.
es: Se permite la precarga del navegador.
fr: Le préchargement du navigateur est autorisé.
ja: ブラウザプリロードが許可されています。
zh: 浏览器预加载是允许的。

source: The `preload` directive on `Strict-Transport-Security` allows browsers to preload the site in its HSTS lists, avoiding the potential for making unencrypted requests when first accessing the site. See the [HSTS Preload List](https://hstspreload.org/) for more information.
es: La directiva `preload` en `Strict-Transport-Security` permite a los navegadores precargar el sitio en su lista HSTS, evitando la posibilidad de realizar solicitudes sin cifrar al acceder por primera vez al sitio. Consulte la [Lista de precarga HSTS](https://hstspreload.org/) para obtener más información.
fr: La directive `preload` sur `Strict-Transport-Security` permet aux navigateurs de précharger le site dans sa liste HSTS, évitant ainsi la possibilité de faire des requêtes non chiffrées lors du premier accès au site. Voir la [liste de préchargement HSTS](https://hstspreload.org/) pour plus d'informations.
ja: `Strict-Transport-Security` ヘッダーの `preload` ディレクティブは、ブラウザがサイトをHSTSリストにプリロードできるようにします。これにより、サイトに最初にアクセスしたときに暗号化されていないリクエストが行われる可能性を回避できます。 詳細については、[HSTS Preload List](https://hstspreload.org/) を参照してください。
zh: `Strict-Transport-Security` 上的 `preload` 指令允许浏览器在 其 HSTS 列表中预加载网站，从而避免在首次访问网站时发出未加密请求的可能性。 有关更多信息，请参阅 [HSTS 预加载列表](https://hstspreload.org/)。

source: Browser preloading is allowed, but this policy isn't suitable for it.
es: La precarga del navegador está permitida, pero esta política no es adecuada para ello.
fr: Le préchargement du navigateur est autorisé, mais cette politique ne lui convient pas.
ja: ブラウザプリロードは許可されていますが、このポリシーはそれに適していません。
zh: 浏览器预加载是允许的，但此策略不适合它。

source: Preloading a site in a browser's HSTS list requires a `max-age` of at least one year and the `includeSubDomains` directive. See the [HSTS Preload List](https://hstspreload.org/) for more information.
es: Precargar un sitio en la lista HSTS de un navegador requiere un `max-age` de al menos un año y la directiva `includeSubDomains`. Consulte la [Lista de Precarga HSTS](https://hstspreload.org/) para más información.
fr: Le préchargement d'un site dans la liste HSTS d'un navigateur nécessite une valeur `max-age` d'au moins un an et la directive `includeSubDomains`. Voir la [Liste de préchargement HSTS](https://hstspreload.org/) pour plus d'informations.
ja: ブラウザのHSTSリストにサイトをプリロードするには、`max-age`が少なくとも1年で、`includeSubDomains`ディレクティブが必要です。 詳細については、[HSTSプリロードリスト](https://hstspreload.org/)を参照してください。
zh: 在浏览器 HSTS 列表中预加载网站需要 `max-age` 至少为一年，并包含 `includeSubDomains` 指令。 有关更多信息，请参阅 [HSTS 预加载列表](https://hstspreload.org/)。

source: Browser preloading isn't allowed.
es: La precarga del navegador no está permitida.
fr: Le préchargement du navigateur n'est pas autorisé.
ja: ブラウザプリロードは許可されていません。
zh: 浏览器预加载不允许。

source: Without a `preload` directive, browsers may make an unencrypted request when first accessing the site, potentially exposing sensitive information. See the [HSTS Preload List](https://hstspreload.org/) for more information.
es: Sin una directiva `preload`, los navegadores pueden realizar una solicitud no cifrada al acceder por primera vez al sitio, lo que podría exponer información confidencial. Consulte la [Lista de Precarga HSTS](https://hstspreload.org/) para obtener más información.
fr: Sans directive `preload`, les navigateurs peuvent effectuer une requête non chiffrée lors du premier accès au site, exposant potentiellement des informations sensibles. Consultez la [liste de préchargement HSTS](https://hstspreload.org/) pour plus d'informations.
ja: `preload` ディレクティブがない場合、ブラウザは最初にサイトにアクセスする際に暗号化されていないリクエストを行う可能性があり、機密情報が公開される恐れがあります。 詳細については、[HSTS Preload List](https://hstspreload.org/) を参照してください。
zh: 如果没有 `preload` 指令，浏览器在首次访问网站时可能会发出未加密的请求，从而可能暴露敏感信息。 有关更多信息，请参阅 [HSTS Preload List](https://hstspreload.org/)。

source: The HSTS header contains a duplicate directive.
es: La cabecera HSTS contiene una directiva duplicada.
fr: L'en-tête HSTS contient une directive en double.
ja: HSTS ヘッダーに重複したディレクティブが含まれています。
zh: HSTS 头部包含重复指令。

source: The `%(directive)s` directive appears more than once in the `Strict-Transport-Security` header. Directives must only appear once.
es: La directiva `%(directive)s` aparece más de una vez en el encabezado `Strict-Transport-Security`. Las directivas solo deben aparecer una vez.
fr: La directive `%(directive)s` apparaît plus d'une fois dans l'en-tête `Strict-Transport-Security`. Les directives ne doivent apparaître qu'une seule fois.
ja: `Strict-Transport-Security` ヘッダーに `%(directive)s` ディレクティブが複数回出現しています。 ディレクティブは一度だけ出現する必要があります。
zh: `%(directive)s` 指令在 `Strict-Transport-Security` 标头中出现不止一次。 指令只能出现一次。

source: The Strict-Transport-Security header has a trailing semicolon.
es: El encabezado Strict-Transport-Security tiene un punto y coma al final.
fr: Le header "Strict-Transport-Security" a un point-virgule à la fin.

source: The `Strict-Transport-Security` header contains a trailing semicolon. Technically, this violates the grammar, so strict implementations might find it confusing. However, most implementations should ignore it.
es: El encabezado `Strict-Transport-Security` contiene un punto y coma final. Técnicamente, esto viola la gramática, por lo que las implementaciones estrictas pueden encontrarlo confuso. Sin embargo, la mayoría de las implementaciones deberían ignorarlo.
fr: La directive « Strict-Transport-Security » contient un point-virgule final ; ce qui est techniquement incorrect selon la grammaire, ce qui peut donc dérouter les implémentations strictes. Cependant, la plupart des implémentations devraient l'ignorer.

source: The HSTS header is sent over HTTP.
es: La cabecera HSTS se envía a través de HTTP.
fr: L'en-tête HSTS est envoyé sur HTTP.
ja: HSTS ヘッダーは HTTP で送信されます。
zh: HSTS 头部通过 HTTP 发送。

source: The `Strict-Transport-Security` header is ignored when sent over HTTP, unless it's a 301 Redirect. It should only be sent over HTTPS.
es: La cabecera `Strict-Transport-Security` se ignora cuando se envía sobre HTTP, a menos que sea una Redirección 301. Solo debe enviarse sobre HTTPS.
fr: L'en-tête `Strict-Transport-Security` est ignoré lorsqu'il est envoyé sur HTTP, sauf s'il s'agit d'une redirection 301. Il ne doit être envoyé que sur HTTPS.
ja: HTTPでは、`Strict-Transport-Security`ヘッダーは、301リダイレクトでない限り無視されます。HTTPSでのみ送信してください。
zh: `Strict-Transport-Security` 头部在通过 HTTP 发送时会被忽略，除非它是 301 重定向。 它应该仅通过 HTTPS 发送。
