{
  "fr": {
    "\"%(field_name)s\" is a request header.": "\"%(field_name)s\" est un en-tête de requête.",
    "\"%(field_name)s\" is not a valid field name.": "\"%(field_name)s\" n'est pas un nom de champ valide.",
    "%(message)s advertises support for non-standard range-units.": "%(message)s annonce la prise en charge d'unités de plage non standard.",
    "%(message)s allows all caches to store it.": "%(message)s autorise tous les caches à le stocker.",
    "%(message)s allows caches to assign their own freshness lifetimes to it.": "%(message)s permet aux caches d'attribuer leurs propres durées de fraîcheur.",
    "%(message)s allows loading cross-origin resources without restriction%(report_only)s.": "%(message)s permet le chargement sans restriction de ressources inter-origines%(report_only)s.",
    "%(message)s allows only private caches to store it.": "%(message)s autorise uniquement les caches privés à le stocker.",
    "%(message)s allows only shared caches to store it.": "%(message)s autorise uniquement les caches partagés à le stocker.",
    "%(message)s can be served stale from a cache while it is being revalidated.": "%(message)s peut être servi obsolète depuis un cache pendant sa révalidation.",
    "%(message)s can be stored by all caches, even though the request was authenticated.": "%(message)s peut être mis en cache par tous les caches, même si la requête a été authentifiée.",
    "%(message)s can only be stored by private caches, because the request was authenticated.": "%(message)s ne peut être stocké que par des caches privés, car la requête a été authentifiée.",
    "%(message)s can't be stored by caches.": "%(message)s ne peut pas être mis en cache.",
    "%(message)s cannot be considered fresh by caches.": "%(message)s ne peut pas être considéré comme frais par les caches.",
    "%(message)s cannot be served by a cache now that it is stale.": "%(message)s ne peut pas être servi par un cache maintenant qu'il est périmé.",
    "%(message)s cannot be served by a cache once it becomes stale.": "%(message)s ne peut pas être servi par un cache une fois qu'il est périmé.",
    "%(message)s cannot be served by a shared cache now that it is stale.": "%(message)s ne peut pas être servi par un cache partagé maintenant qu'il est périmé.",
    "%(message)s cannot be served by a shared cache once it becomes stale.": "%(message)s ne peut pas être servi par un cache partagé une fois qu'il est périmé.",
    "%(message)s cannot be served from cache without validation, and doesn't have a validator.": "%(message)s ne peut pas être servi depuis le cache sans validation, et n'a pas de validateur.",
    "%(message)s cannot be served from cache without validation.": "%(message)s ne peut pas être servi depuis le cache sans validation.",
    "%(message)s cannot be stored by caches.": "%(message)s ne peut pas être stocké par les caches.",
    "%(message)s contained unwanted content-codings.": "%(message)s contenait des codages de contenu indésirables.",
    "%(message)s contains an X-Frame-Options header with an unknown value.": "%(message)s contient un en-tête X-Frame-Options avec une valeur inconnue.",
    "%(message)s contains both the `public` and `private` Cache-Control directives.": "%(message)s contient à la fois les directives Cache-Control `public` et `private`.",
    "%(message)s contains headers that should not be sent in 304 (Not Modified).": "%(message)s contient des en-têtes qui ne devraient pas être envoyés dans une réponse 304 (Non modifié).",
    "%(message)s doesn't define any meaning for the Location header.": "%(message)s ne définit aucune signification pour l'en-tête Location.",
    "%(message)s doesn't have a Content-Range header.": "%(message)s n'a pas d'en-tête Content-Range.",
    "%(message)s doesn't have a Date header.": "%(message)s n'a pas d'en-tête Date.",
    "%(message)s doesn't have explicit freshness information (like a ` Cache-Control: max-age`\ndirective, or `Expires` header), and this status code doesn't allow caches to calculate their own.\n\nAdditionally, its status code doesn't allow caches to assign their own freshness lifetimes to it.\n\nTherefore, while caches might be allowed to store it, they generally can't use it, unless it can be\nserved stale.\n\nAs a result, many caches will not store the response at all, because it is not generally useful to do\nso.": "%(message)s n'a pas d'informations explicites sur la fraîcheur (comme une directive `Cache-Control: max-age` ou un en-tête `Expires`), et ce code d'état ne permet pas aux caches de calculer les leurs.\n\nDe plus, son code d'état n'autorise pas les caches à lui attribuer leurs propres durées de vie de fraîcheur.\n\nPar conséquent, bien que les caches soient autorisés à le stocker, ils ne peuvent généralement pas l'utiliser, à moins qu'il ne puisse être servi comme obsolète.\n\nEn conséquence, de nombreux caches ne stockeront pas du tout la réponse, car il n'est généralement pas utile de le faire.",
    "%(message)s had parameters on its transfer-codings.": "%(message)s avait des paramètres sur ses codages de transfert.",
    "%(message)s has a Cache-Status header with an unknown parameter '%(param)s'.": "%(message)s a un en-tête Cache-Status avec un paramètre inconnu '%(param)s'.",
    "%(message)s has a Cache-Status header with an unknown value for '%(param)s'.": "%(message)s a un en-tête Cache-Status avec une valeur inconnue pour '%(param)s'.",
    "%(message)s has a Proxy-Status header with an invalid structure.": "%(message)s a un en-tête Proxy-Status avec une structure non valide.",
    "%(message)s has a Set-Cookie header without a cookie-name.": "%(message)s a un en-tête Set-Cookie sans nom de cookie.",
    "%(message)s has already been cached for %(age)s.": "%(message)s a déjà été mis en cache pendant %(age)s.",
    "%(message)s has an Expires or Last-Modified header, but no Date.": "%(message)s a un en-tête Expires ou Last-Modified, mais pas de Date.",
    "%(message)s has both enforcing and report-only COEP headers.": "%(message)s a à la fois des en-têtes COEP d'application et de rapport uniquement.",
    "%(message)s has both enforcing and report-only COOP headers.": "%(message)s a à la fois des en-têtes COOP d'application et de rapport uniquement.",
    "%(message)s has different freshness lifetimes for private (e.g., browser) and shared (e.g., proxy)\ncaches.\n\nPrivate caches can consider it fresh for %(fresh_lifetime)s (until %(fresh_left)s from\nnow).\n\nShared caches can consider it fresh for %(share_lifetime)s (until %(share_left)s from now).": "%(message)s a des durées de vie différentes pour les caches privés (par exemple, navigateur) et partagés (par exemple, proxy).\n\nLes caches privés peuvent le considérer comme récent pendant %(fresh_lifetime)s (jusqu'à %(fresh_left)s à partir de maintenant).\n\nLes caches partagés peuvent le considérer comme récent pendant %(share_lifetime)s (jusqu'à %(share_left)s à partir de maintenant).",
    "%(message)s has multiple HSTS headers.": "%(message)s a plusieurs en-têtes HSTS.",
    "%(message)s has unsupported transfer-coding.": "%(message)s a un codage de transfert non pris en charge.",
    "%(message)s instructs browsers not to 'sniff' its media type.": "%(message)s demande aux navigateurs de ne pas 'renifler' son type de média.",
    "%(message)s is %(private_status)s for %(fresh_left)s (%(shared_status)s for %(share_left)s in shared caches).": "%(message)s est %(private_status)s pour %(fresh_left)s (%(shared_status)s pour %(share_left)s dans les caches partagées).",
    "%(message)s is available for reading to requests from all origins.": "%(message)s est disponible en lecture pour les requêtes de toutes les origines.",
    "%(message)s is available for reading to requests from the same site.": "%(message)s est disponible en lecture pour les requêtes du même site.",
    "%(message)s is fresh for %(freshness_left)s.": "%(message)s est frais pour %(freshness_left)s.",
    "%(message)s is stale.": "%(message)s est périmé.",
    "%(message)s isolates the browsing context to the same origin%(report_only)s.": "%(message)s isole le contexte de navigation à la même origine%(report_only)s.",
    "%(message)s loads cross-origin resources without credentials%(report_only)s.": "%(message)s charge des ressources inter-origines sans informations d'identification%(report_only)s.",
    "%(message)s may be refreshed in the background by Internet Explorer.": "%(message)s peut être actualisé en arrière-plan par Internet Explorer.",
    "%(message)s prevents some browsers from rendering it within a frame.": "%(message)s empêche certains navigateurs de l'afficher dans un cadre.",
    "%(message)s requires resources to have a CORP header%(report_only)s.": "%(message)s nécessite que les ressources aient un en-tête CORP%(report_only)s.",
    "%(message)s sets a Content Security Policy%(report_only)s.": "%(message)s définit une politique de sécurité du contenu%(report_only)s.",
    "%(message)s sets a Permissions Policy.": "%(message)s définit une politique d'autorisations.",
    "%(message)s sets duplicate cookies.": "%(message)s définit des cookies en double.",
    "%(message)s shouldn't have a Content-Range header.": "%(message)s ne devrait pas avoir d'en-tête Content-Range.",
    "%(message)s was compressed using GZip, but the data was corrupt.": "%(message)s a été compressé avec GZip, mais les données étaient corrompues.",
    "%(message)s was compressed using GZip, but the header wasn't valid.": "%(message)s a été compressé avec GZip, mais l'en-tête n'était pas valide.",
    "%(message)s's %(field_name)s has an invalid value.": "Le %(field_name)s de %(message)s a une valeur non valide.",
    "%(message)s's Content-Length header is incorrect.": "L'en-tête Content-Length de %(message)s est incorrect.",
    "%(message)s's HSTS header contains a duplicate directive.": "L'en-tête HSTS de %(message)s contient une directive en double.",
    "%(message)s's HSTS header is sent over HTTP.": "L'en-tête HSTS de %(message)s est envoyé via HTTP.",
    "%(message)s's Referrer-Policy allows unsafe URLs.": "La Referrer-Policy de %(message)s autorise les URL non sécurisées.",
    "%(message)s's Strict Transport Security (HSTS) header is invalid.": "L'en-tête Strict Transport Security (HSTS) de %(message)s n'est pas valide.",
    "%(message)s's `Content-Encoding` header indicates it has content-codings applied\n(`%(unwanted_codings)s`) that the request didn't ask for.\n\nNormally, clients ask for the encodings they want in the `Accept-Encoding` request header. Using\nencodings that the client doesn't explicitly request can lead to interoperability problems.": "L'en-tête `Content-Encoding` de %(message)s indique qu'il a appliqué des codages de contenu (`%(unwanted_codings)s`) que la requête n'a pas demandés.\n\nNormalement, les clients demandent les codages qu'ils souhaitent dans l'en-tête de requête `Accept-Encoding`. L'utilisation de codages que le client ne demande pas explicitement peut entraîner des problèmes d'interopérabilité.",
    "%(status)s is not a standard HTTP status code.": "%(status)s n'est pas un code d'état HTTP standard.",
    "'%(token)s' is not valid in an allowlist.": "'%(token)s' n'est pas valide dans une liste d'autorisation.",
    "304 (Not Modified) responses need to have a Date header.": "Les réponses 304 (Not Modified) doivent avoir un en-tête Date.",
    "A 100 (Continue) response was sent when it wasn't asked for.": "Une réponse 100 (Continue) a été envoyée alors qu'elle n'était pas demandée.",
    "A HTTP response is stale when its age (here, %(current_age)s) is equal to or exceeds\nits freshness lifetime (in this case, %(freshness_lifetime)s).\n\nThere are a few reasons why a cache might serve a stale response:\n\n* HTTP allows stale responses to be used to satisfy requests in exceptional circumstances;\ne.g., when they lose contact with the origin server. This is subject to a number of requirements.\n* Response directives like `stale-if-error` and `stale-while-revalidate` explicitly allow stale\n  responses to be used in particular circumstances.\n* Some caches are configured to ignore the response's freshness directives.": "Une réponse HTTP est périmée lorsque son âge (ici, %(current_age)s) est égal ou supérieur à sa durée de fraîcheur (dans ce cas, %(freshness_lifetime)s).\n\nPlusieurs raisons peuvent expliquer pourquoi un cache sert une réponse périmée :\n\n* HTTP autorise l'utilisation de réponses périmées pour satisfaire des requêtes dans des circonstances exceptionnelles ; par exemple, lorsqu'elles perdent le contact avec le serveur d'origine. Ceci est soumis à un certain nombre d'exigences.\n* Les directives de réponse comme `stale-if-error` et `stale-while-revalidate` autorisent explicitement l'utilisation de réponses périmées dans des circonstances particulières.\n* Certains caches sont configurés pour ignorer les directives de fraîcheur de la réponse.",
    "A cache can store this response; it may or may not be able to use it to satisfy a particular\nrequest.": "Un cache peut stocker cette réponse ; il peut ou peut ne pas être en mesure de l'utiliser pour satisfaire une requête particulière.",
    "A new resource was created in response to a safe request.": "Une nouvelle ressource a été créée en réponse à une requête sûre.",
    "A new resource was created without its location being sent.": "Une nouvelle ressource a été créée sans que son emplacement ne soit envoyé.",
    "A partial response was sent when it wasn't requested.": "Une réponse partielle a été envoyée alors qu'elle n'était pas demandée.",
    "A response can be considered fresh when its age (here, %(current_age)s) is less than its freshness\nlifetime (in this case, %(freshness_lifetime)s).": "Une réponse peut être considérée comme fraîche lorsque son âge (ici, %(current_age)s) est inférieur à sa durée de vie utile (dans ce cas, %(freshness_lifetime)s).",
    "A response should not have both `Cross-Origin-Embedder-Policy` and\n`Cross-Origin-Embedder-Policy-Report-Only` headers. The report-only header will be ignored.": "Une réponse ne doit pas avoir à la fois les en-têtes `Cross-Origin-Embedder-Policy` et `Cross-Origin-Embedder-Policy-Report-Only`. L'en-tête report-only sera ignoré.",
    "A shared cache can store this response; it may or may not be able to use it to satisfy a\nparticular request. \n\nPrivate caches cannot store it, because there is no explicit freshness information\n(such as Cache-Control: max-age), and the status code is not heuristically cacheable.\n\nNote that a cache extension might override this behaviour.": "Un cache partagé peut stocker cette réponse ; il peut ou peut ne pas être en mesure de l'utiliser pour satisfaire une requête particulière.\n\nLes caches privés ne peuvent pas la stocker, car il n'y a pas d'informations explicites sur la fraîcheur (comme Cache-Control: max-age), et le code de statut n'est pas heuristiquement mis en cache.\n\nNotez qu'une extension de cache peut outrepasser ce comportement.",
    "Access-Control-Allow-Credentials must be 'true'.": "Access-Control-Allow-Credentials doit être 'true'.",
    "Access-Control-Allow-Origin should not have multiple values.": "Access-Control-Allow-Origin ne doit pas avoir plusieurs valeurs.",
    "All sources are allowed in one or more directives.": "Toutes les sources sont autorisées dans une ou plusieurs directives.",
    "Allowing `http:` sources in `%(field_name)s` can allow attackers to intercept and modify\ncontent loaded by the page, potentially bypassing security controls.\n\nIt was found in the following directives:\n\n%(directives_list)s": "L'autorisation de sources `http:` dans `%(field_name)s` peut permettre aux attaquants d'intercepter et de modifier\nle contenu chargé par la page, contournant ainsi potentiellement les contrôles de sécurité.\n\nIl a été trouvé dans les directives suivantes :\n\n%(directives_list)s",
    "Although HTTP allows a server not to send a `Date` header in responses if it doesn't have a local\nclock, this can make calculation of a stored response's age inexact.": "Bien que HTTP permette à un serveur de ne pas envoyer un en-tête `Date` dans les réponses s'il ne dispose pas d'une horloge locale, cela peut rendre le calcul de l'âge d'une réponse stockée inexact.",
    "An intermediary encountered an error.": "Un intermédiaire a rencontré une erreur.",
    "An intermediary timed out.": "Un intermédiaire a expiré.",
    "Because both the `Expires` and `Last-Modified` headers are date-based, it's necessary to send when\nthe message was generated in `Date` for them to be useful; otherwise, clock drift, transit times\nbetween nodes as well as caching could skew their application.": "Étant donné que les en-têtes `Expires` et `Last-Modified` sont basés sur des dates, il est nécessaire d'indiquer la date de génération du message dans l'en-tête `Date` pour qu'ils soient utiles ; sinon, la dérive d'horloge, les temps de transit entre les nœuds ainsi que la mise en cache pourraient fausser leur application.",
    "Because the request was authenticated and this response doesn't contain a `Cache-Control: public`\ndirective, this response can only be stored by caches that are specific to a single user; for\nexample, a browser cache. Shared caches, such as those in proxies, cannot store it.": "Parce que la requête a été authentifiée et que cette réponse ne contient pas de directive `Cache-Control: public`, cette réponse ne peut être stockée que par des caches spécifiques à un seul utilisateur ; par exemple, un cache de navigateur. Les caches partagés, comme ceux des proxys, ne peuvent pas la stocker.",
    "Browser preloading is allowed, but this policy isn't suitable for it.": "Le préchargement du navigateur est autorisé, mais cette politique ne lui convient pas.",
    "Browser preloading is allowed.": "Le préchargement du navigateur est autorisé.",
    "Browser preloading isn't allowed.": "Le préchargement du navigateur n'est pas autorisé.",
    "Cache information is available.": "Des informations sur le cache sont disponibles.",
    "Cache-Control: max-age and Expires are both present.": "Cache-Control: max-age et Expires sont tous deux présents.",
    "Cache-Control: public is probably not necessary.": "Cache-Control: public n'est probablement pas nécessaire.",
    "Clients SHOULD send a `User-Agent` header field.\n\nSee [RFC 9110 Section 10.1.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.5)\nfor details.": "Les clients DOIVENT envoyer un champ d'en-tête `User-Agent`.\n\nVoir [RFC 9110 Section 10.1.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-10.1.5) pour plus de détails.",
    "Content-Length and Transfer-Encoding should not be present together.": "Content-Length et Transfer-Encoding ne doivent pas être présents ensemble.",
    "Cross-Origin-Resource-Policy has an invalid value.": "Cross-Origin-Resource-Policy a une valeur non valide.",
    "Directives must only appear once in the `%(field_name)s` header; subsequent occurrences are ignored.\n\nThe following directives were duplicated:\n\n%(directives_list)s": "Les directives ne doivent apparaître qu'une seule fois dans l'en-tête `%(field_name)s` ; les occurrences ultérieures sont ignorées.\n\nLes directives suivantes étaient dupliquées :\n\n%(directives_list)s",
    "Duplicate directives are present.": "Des directives en double sont présentes.",
    "Field names are limited to the `token` production in HTTP; i.e., they can't contain parenthesis,\nangle brackets (<>), ampersands (@), commas, semicolons, colons, backslashes (\\), forward\nslashes (/), quotes, square brackets ([]), question marks, equals signs (=), curly brackets ({})\nspaces or tabs.": "Les noms de champs sont limités à la production `token` HTTP ; c'est-à-dire qu'ils ne peuvent pas contenir de parenthèses, d'accolades (<>), d'esperluettes (@), de virgules, de points-virgules, de deux-points, de barres obliques inverses (\\), de barres obliques (/), de guillemets, de crochets ([]), de points d'interrogation, de signes égaux (=), d'accolades ({}) d'espaces ou de tabulations.",
    "GZip-compressed responses have a header that contains metadata. %(message)s's header wasn't valid;\nthe error encountered was \"`%(gzip_error)s`\".": "Les réponses compressées par GZip ont un en-tête qui contient des métadonnées. L'en-tête de %(message)s n'était pas valide ;\nl'erreur rencontrée était \"`%(gzip_error)s`\".",
    "GZip-compressed responses use zlib compression to reduce the number of bytes transferred on the\nwire. However, this response could not be decompressed; the error encountered was\n\"`%(zlib_error)s`\".\n\n%(ok_zlib_len)s bytes were decompressed successfully before this; the erroneous chunk starts with (in hex):\n\n    %(chunk_sample)s\n": "Les réponses compressées GZip utilisent la compression zlib pour réduire le nombre d'octets transférés sur le réseau. Cependant, cette réponse n'a pas pu être décompressée ; l'erreur rencontrée était \"`%(zlib_error)s`\".\n\n%(ok_zlib_len)s octets ont été décompressés avec succès avant cela ; le fragment erroné commence par (en hexadécimal) :\n\n    %(chunk_sample)s",
    "HSTS applies to subdomains.": "HSTS s'applique aux sous-domaines.",
    "HSTS doesn't apply to subdomains.": "HSTS ne s'applique pas aux sous-domaines.",
    "HTTP allows clients to ask a server if a request containing content (e.g., uploading a large file)\nwill succeed before sending it, using a mechanism called \"Expect/continue\".\n\nWhen used, the client sends an `Expect: 100-continue`, in the request headers, and if the server is\nwilling to process it, it will send a `100 (Continue)` status code to indicate that the request\nshould continue.\n\nThis response has a `100 (Continue)` status code, but the request did not ask for it using the\n`Expect` request header. Sending this status code without it being requested can cause\ninteroperability problems.": "HTTP permet aux clients de demander à un serveur si une requête contenant du contenu (par exemple, l'envoi d'un fichier volumineux) peut aboutir avant de l'envoyer, grâce à un mécanisme appelé \"Expect/continue\".\n\nLorsqu'il est utilisé, le client envoie un `Expect: 100-continue`, dans les en-têtes de la requête, et si le serveur est disposé à la traiter, il renverra un code d'état `100 (Continue)` pour indiquer que la requête doit se poursuivre.\n\nCette réponse a un code d'état `100 (Continue)`, mais la requête ne l'a pas demandé en utilisant l'en-tête de requête `Expect`. L'envoi de ce code d'état sans qu'il soit demandé peut entraîner des problèmes d'interopérabilité.",
    "HTTP allows stale responses to be served in some circumstances; for example, if the origin\nserver can't be contacted, a stale response can be used even if it doesn't have explicit freshness\ninformation available.\n\nThis behaviour can be prevented by using the `Cache-Control: must-revalidate` response directive.": "HTTP autorise la diffusion de réponses obsolètes dans certaines circonstances ; par exemple, si le serveur d'origine ne peut pas être contacté, une réponse obsolète peut être utilisée même si elle ne dispose pas d'informations explicites sur sa fraîcheur.\n\nCe comportement peut être évité en utilisant la directive de réponse `Cache-Control: must-revalidate`.",
    "HTTP dates have specific syntax, and sending an invalid date can cause a number of problems,\nespecially with caching. Common problems include sending \"1 May\" instead of \"01 May\" (the month\nis a fixed-width field), and sending a date in a timezone other than GMT.\n\nSee [the HTTP specification](https://www.rfc-editor.org/rfc/rfc9110.html#name-date-time-formats) for more\ninformation.": "Les dates HTTP ont une syntaxe spécifique, et l'envoi d'une date invalide peut causer un certain nombre de problèmes,\nnotamment avec la mise en cache. Les problèmes courants incluent l'envoi de \"1 May\" au lieu de \"01 May\" (le mois\nest un champ de largeur fixe) et l'envoi d'une date dans un fuseau horaire autre que GMT.\n\nConsultez [la spécification HTTP](https://www.rfc-editor.org/rfc/rfc9110.html#name-date-time-formats) pour plus\nd'informations.",
    "HTTP defines an algorithm that uses the `Age` header, `Date` header, and local time observations to\ndetermine the age of a response. As a result, caches might use a value other than that in the `Age`\nheader to determine how old the response is -- and therefore how much longer it can be used.": "HTTP définit un algorithme qui utilise l'en-tête `Age`, l'en-tête `Date` et des observations de l'heure locale pour\ndéterminer l'âge d'une réponse. Par conséquent, les caches peuvent utiliser une valeur différente de celle de l'en-tête `Age`\npour déterminer l'âge de la réponse -- et donc combien de temps encore elle peut être utilisée.",
    "HTTP defines the `Upgrade` header as a means of negotiating a change of protocol; i.e., it\nallows you to switch the protocol on a given connection from HTTP to something else.\n\nThis response was upgraded, but the request did not contain an `Upgrade` header field.\n": "HTTP définit l'en-tête `Upgrade` comme un moyen de négocier un changement de protocole ; c'est-à-dire qu'il\nvous permet de passer le protocole sur une connexion donnée de HTTP à autre chose.\n\nCette réponse a été mise à niveau, mais la requête ne contenait pas de champ d'en-tête `Upgrade`.",
    "HTTP field names can only contain ASCII characters.": "Les noms de champs HTTP ne peuvent contenir que des caractères ASCII.",
    "HTTP fields notionally use the ISO-8859-1 character set, but in most cases are pure ASCII\n(a subset of this encoding).\n\nThis header has non-ASCII characters, which have been interpreted as being encoded in\nISO-8859-1. If another encoding is used (e.g., UTF-8), the results may be unpredictable.": "Les champs HTTP utilisent notionnellement le jeu de caractères ISO-8859-1, mais dans la plupart des cas, ils sont en pur ASCII\n(un sous-ensemble de cet encodage).\n\nCet en-tête contient des caractères non-ASCII, qui ont été interprétés comme étant encodés en\nISO-8859-1. Si un autre encodage est utilisé (par exemple, UTF-8), les résultats peuvent être imprévisibles.",
    "HTTP has a number of defined date formats for historical reasons. This header is using an old\nformat that are now obsolete. See [the\nspecification](https://www.rfc-editor.org/rfc/rfc9110.html#name-obsolete-date-formats) for more information.\n": "HTTP possède un certain nombre de formats de date définis pour des raisons historiques. Cet en-tête utilise un ancien format qui est maintenant obsolète. Voir [la spécification](https://www.rfc-editor.org/rfc/rfc9110.html#name-obsolete-date-formats) pour plus d'informations.",
    "HTTP only defines meaning for the `Content-Range` header in responses with a `206` (Partial\nContent) or `416` (Requested Range Not Satisfiable) status code.\n\nBecause the status code is neither of those, this `Content-Range` header may confuse caches and\nclients.": "HTTP ne définit la signification de l'en-tête `Content-Range` que pour les réponses avec un code d'état `206` (Contenu partiel) ou `416` (Plage demandée non satisfaite).\n\nÉtant donné que le code d'état n'est ni l'un ni l'autre, cet en-tête `Content-Range` peut prêter à confusion pour les caches et les clients.",
    "HTTP requires `304 (Not Modified)` responses to have a `Date` header in all but the most unusual\ncircumstances.": "HTTP exige que les réponses `304 (Not Modified)` incluent un en-tête `Date` dans presque toutes les circonstances.",
    "If an error occurs, caches can serve this response stale.": "Si une erreur se produit, les caches peuvent servir cette réponse périmée.",
    "In %(field_name)s, the %(context)s key '%(key)s' is duplicated.": "Dans %(field_name)s, la clé %(context)s '%(key)s' est dupliquée.",
    "In exceptional circumstances, caches can serve this response stale.": "Dans des circonstances exceptionnelles, les caches peuvent servir cette réponse périmée.",
    "Information about intermediaries is available.": "Des informations sur les intermédiaires sont disponibles.",
    "Inline scripts are allowed.": "Les scripts en ligne sont autorisés.",
    "It appears that the Date header has been changed by an intermediary.": "Il semble que l'en-tête Date ait été modifié par un intermédiaire.",
    "Loading from insecure HTTP sources is allowed.": "Le chargement à partir de sources HTTP non sécurisées est autorisé.",
    "Long URIs aren't supported by some implementations, including proxies. A reasonable upper size\nlimit is 8192 characters.": "Certaines implémentations, y compris les proxys, ne prennent pas en charge les URI longs. Une limite supérieure raisonnable est de 8192 caractères.",
    "Microsoft Internet Explorer implements two `Cache-Control` extensions, `pre-check` and\n`post-check`, to give more control over how its cache stores responses.\n\n%(message)s assigns a higher value to `post-check` than to `pre-check`; this means that Internet\nExplorer will treat `post-check` as if its value is the same as `pre-check`'s.": "Microsoft Internet Explorer implémente deux extensions `Cache-Control`, `pre-check` et\n`post-check`, pour permettre un meilleur contrôle de la manière dont son cache stocke les réponses.\n\n%(message)s attribue une valeur plus élevée à `post-check` qu'à `pre-check` ; cela signifie qu'Internet\nExplorer traitera `post-check` comme si sa valeur était identique à celle de `pre-check`.",
    "Microsoft Internet Explorer implements two `Cache-Control` extensions, `pre-check` and\n`post-check`, to give more control over how its cache stores responses.\n\n%(message)s assigns a value of \"0\" to `post-check`, which means that Internet Explorer will reload\nthe content as soon as it enters the browser cache, effectively **doubling the load on the\nserver**.": "Microsoft Internet Explorer implémente deux extensions `Cache-Control`, `pre-check` et `post-check`, pour un meilleur contrôle de la façon dont son cache stocke les réponses.\n\n%(message)s attribue la valeur \"0\" à `post-check`, ce qui signifie qu'Internet Explorer rechargera le contenu dès son entrée dans le cache du navigateur, **doublant ainsi la charge sur le serveur**.",
    "Microsoft Internet Explorer implements two `Cache-Control` extensions, `pre-check` and\n`post-check`, to give more control over how its cache stores responses.\n\n%(message)s gives a value of \"0\" for both; as a result, Internet Explorer will ignore the\ndirective, since it requires both to be present.\n\nIn other words, setting these to zero has **no effect** (besides wasting bandwidth),\nand may trigger bugs in some beta versions of IE.": "Microsoft Internet Explorer implémente deux extensions `Cache-Control`, `pre-check` et `post-check`, pour un meilleur contrôle de la façon dont son cache stocke les réponses.\n\n%(message)s donne la valeur \"0\" pour les deux ; en conséquence, Internet Explorer ignorera la directive, puisqu'il requiert que les deux soient présentes.\n\nEn d'autres termes, régler ces valeurs à zéro n'a **aucun effet** (à part gaspiller de la bande passante) et peut déclencher des bugs dans certaines versions bêta d'IE.",
    "Microsoft Internet Explorer implements two `Cache-Control` extensions, `pre-check` and\n`post-check`, to give more control over how its cache stores responses.\n\n%(message)s uses only one of these directives; as a result, Internet Explorer will ignore the\ndirective, since it requires both to be present.\n": "Microsoft Internet Explorer implémente deux extensions `Cache-Control`, `pre-check` et `post-check`, pour offrir un meilleur contrôle sur la façon dont son cache stocke les réponses.\n\n%(message)s n'utilise qu'une seule de ces directives ; par conséquent, Internet Explorer ignorera la directive, car il exige que les deux soient présentes.",
    "Microsoft Internet Explorer implements two `Cache-Control` extensions, `pre-check` and\n`post-check`, to give more control over how its cache stores responses.\n\nOnce it has been cached for more than %(post_check)s seconds, a new request will result in the\ncached response being served while it is refreshed in the background. However, if it has been\ncached for more than %(pre_check)s seconds, the browser will download a fresh response before\nshowing it to the user.\n\nNote that these directives do not have any effect on other clients or caches.": "Microsoft Internet Explorer implémente deux extensions `Cache-Control`, `pre-check` et `post-check`, pour un meilleur contrôle de la mise en cache des réponses.\n\nUne fois mis en cache pendant plus de %(post_check)s secondes, une nouvelle requête entraînera la diffusion de la réponse mise en cache pendant qu'elle est actualisée en arrière-plan. Cependant, si elle a été mise en cache pendant plus de %(pre_check)s secondes, le navigateur téléchargera une nouvelle réponse avant de l'afficher à l'utilisateur.\n\nNotez que ces directives n'ont aucun effet sur les autres clients ou caches.",
    "Multiple Referrer-Policy values found; only '%(effective)s' is used.": "Plusieurs valeurs Referrer-Policy trouvées ; seule '%(effective)s' est utilisée.",
    "No valid Referrer-Policy found.": "Aucune Referrer-Policy valide trouvée.",
    "Non-standard status codes are not well-defined and interoperable. Instead of defining your own\nstatus code, you should reuse one of the more generic ones; for example, `400` for a client-side\nproblem, or `500` for a server-side problem.": "Les codes d'état non standard ne sont ni bien définis ni interopérables. Au lieu de définir votre propre code d'état, vous devriez réutiliser l'un des codes plus génériques ; par exemple, `400` pour un problème côté client, ou `500` pour un problème côté serveur.",
    "One or more intermediaries are present.": "Un ou plusieurs intermédiaires sont présents.",
    "Only one %(field_name)s field is allowed in a response's headers.": "Un seul champ %(field_name)s est autorisé dans les en-têtes d'une réponse.",
    "Only one of the pre-check and post-check cache directives is present.": "Une seule des directives de cache pre-check et post-check est présente.",
    "Parameter values that end in '*' are reserved for non-ascii text, as explained in\n[RFC5987](https://www.rfc-editor.org/rfc/rfc5987).\n\nThe `%(param)s` parameter on the `%(field_name)s` field does not allow this; you should use\n%(param)s without the \"*\" on the end (and without the associated encoding).": "Les valeurs de paramètres se terminant par '*' sont réservées aux textes non ASCII, comme expliqué dans\n[RFC5987](https://www.rfc-editor.org/rfc/rfc5987).\n\nLe paramètre `%(param)s` sur le champ `%(field_name)s` ne le permet pas ; vous devriez utiliser\n%(param)s sans le \"*\" à la fin (et sans l'encodage associé).",
    "Parameter values that end in '*' have a specific format, defined in\n[RFC5987](https://www.rfc-editor.org/rfc/rfc5987), to allow non-ASCII text.\n\nThe `%(param)s` parameter on the `%(field_name)s` field has double-quotes around it, which is not\nvalid.": "Les valeurs de paramètre qui se terminent par '*' ont un format spécifique, défini dans\n[RFC5987](https://www.rfc-editor.org/rfc/rfc5987), pour permettre du texte non ASCII.\n\nLe paramètre `%(param)s` sur le champ `%(field_name)s` est entouré de guillemets doubles, ce qui n'est pas\nvalide.",
    "Parameter values that end in '*' have a specific format, defined in\n[RFC5987](https://www.rfc-editor.org/rfc/rfc5987), to allow non-ASCII text.\n\nThe `%(param)s` parameter on the `%(field_name)s` field is not valid; it needs to have three\nparts, separated by single quotes (').": "Les valeurs de paramètres qui se terminent par '*' ont un format spécifique, défini dans\n[RFC5987](https://www.rfc-editor.org/rfc/rfc5987), pour permettre le texte non-ASCII.\n\nLe paramètre `%(param)s` sur le champ `%(field_name)s` n'est pas valide ; il doit avoir trois\nparties, séparées par des apostrophes (').",
    "Parameter values that end in '*' have a specific format, defined in\n[RFC5987](https://www.rfc-editor.org/rfc/rfc5987), to allow non-ASCII text.\n\nThe `%(param)s` parameter on the `%(field_name)s` header doesn't declare its character encoding,\nwhich means that recipients can't understand it. It should be `UTF-8`.": "Les valeurs de paramètre qui se terminent par '*' ont un format spécifique, défini dans\n[RFC5987](https://www.rfc-editor.org/rfc/rfc5987), pour permettre le texte non-ASCII.\n\nLe paramètre `%(param)s` sur l'en-tête `%(field_name)s` ne déclare pas son encodage de caractères,\nce qui signifie que les destinataires ne peuvent pas le comprendre. Il devrait être `UTF-8`.",
    "Parameter values that end in '*' have a specific format, defined in\n[RFC5987](https://www.rfc-editor.org/rfc/rfc5987), to allow non-ASCII text.\n\nThe `%(param)s` parameter on the `%(field_name)s` header uses the `'%(enc)s` encoding, which has\ninteroperability issues with some browsers. It should be `UTF-8`.": "Les valeurs de paramètre qui se terminent par '*' ont un format spécifique, défini dans\n[RFC5987](https://www.rfc-editor.org/rfc/rfc5987), pour autoriser du texte non ASCII.\n\nLe paramètre `%(param)s` sur l'en-tête `%(field_name)s` utilise l'encodage `'%(enc)s`, qui présente des\nproblèmes d'interopérabilité avec certains navigateurs. Il devrait être `UTF-8`.",
    "Parameters on the %(field_name)s field should not repeat; implementations may handle them\ndifferently.": "Les paramètres du champ %(field_name)s ne doivent pas se répéter ; les implémentations peuvent les traiter différemment.",
    "Pragma: no-cache is a request directive, not a response directive.": "Pragma: no-cache est une directive de requête, pas une directive de réponse.",
    "RFC 2324 was an April Fools' Day RFC that lampooned the various ways HTTP was abused; one such abuse\nwas the definition of the application-specific `418 (I'm a Teapot)` status code. In the\nintervening years, this status code has been sometimes implemented as an \"easter egg\".\n\nThis status code is not a part of HTTP and hence it might not be supported by some strict\nstandards-compliant clients.\n": "La RFC 2324 était une RFC du 1er avril qui se moquait des diverses façons dont le protocole HTTP était mal utilisé ; une telle utilisation abusive était la définition du code de statut `418 (I'm a Teapot)` spécifique à l'application. Au cours des années suivantes, ce code de statut a parfois été implémenté comme un \"easter egg\".\n\nCe code de statut ne fait pas partie du protocole HTTP et, par conséquent, il pourrait ne pas être pris en charge par certains clients strictement conformes aux normes.",
    "RFC 9110 Section 8.6:\n> A sender MUST NOT send a Content-Length header field in any message that contains a Transfer-Encoding header field.\n\nThis is because `Transfer-Encoding` overrides `Content-Length`.": "RFC 9110 Section 8.6 :\n> Un expéditeur NE DOIT PAS envoyer un champ d'en-tête Content-Length dans un message qui contient un champ d'en-tête Transfer-Encoding.\n\nCeci est parce que `Transfer-Encoding` remplace `Content-Length`.",
    "Redirects need to have a Location header.": "Les redirections doivent avoir un en-tête Location.",
    "Reserved status codes can only be used by future, standard protocol extensions; they are not for\nprivate use.": "Les codes d'état réservés ne peuvent être utilisés que par de futures extensions de protocole standard ; ils ne sont pas destinés à un usage privé.",
    "Responses to the %(method)s method can't be stored by caches.": "Les réponses à la méthode %(method)s ne peuvent pas être mises en cache.",
    "Some implementations limit the size of any single header line.": "Certaines implémentations limitent la taille de toute ligne d'en-tête unique.",
    "Some implementations limit the total size of the header block. 32KB is a reasonable\nupper limit.": "Certaines implémentations limitent la taille totale du bloc d'en-tête. 32 Ko est une limite supérieure raisonnable.",
    "Strict Transport Security (HSTS) is enabled.": "Strict Transport Security (HSTS) est activé.",
    "The %(bad_directive)s cache directive's syntax is incorrect.": "La syntaxe de la directive de cache %(bad_directive)s est incorrecte.",
    "The %(context)s key '%(key)s' is duplicated. All instances after the first will be ignored.": "La clé '%(key)s' pour le contexte '%(context)s' est dupliquée. Toutes les instances après la première seront ignorées.",
    "The %(cookie_name)s Set-Cookie header has a lifetime that is too long.": "L'en-tête Set-Cookie %(cookie_name)s a une durée de vie trop longue.",
    "The %(cookie_name)s Set-Cookie header is too large.": "L'en-tête Set-Cookie %(cookie_name)s est trop volumineux.",
    "The %(cookie_name)s Set-Cookie header requires the Secure attribute.": "L'en-tête Set-Cookie %(cookie_name)s nécessite l'attribut Secure.",
    "The %(cookie_name)s Set-Cookie value is large.": "La valeur Set-Cookie %(cookie_name)s est grande.",
    "The %(cookie_name)s cookie has a Max-Age with a leading zero.": "Le cookie %(cookie_name)s a un Max-Age avec un zéro non significatif.",
    "The %(cookie_name)s cookie has a non-numeric Max-Age.": "Le cookie %(cookie_name)s a un Max-Age non numérique.",
    "The %(cookie_name)s cookie has an empty Max-Age.": "Le cookie %(cookie_name)s a un Max-Age vide.",
    "The %(cookie_name)s cookie has an empty domain.": "Le cookie %(cookie_name)s a un domaine vide.",
    "The %(cookie_name)s cookie has an invalid Expires date.": "Le cookie %(cookie_name)s a une date Expires non valide.",
    "The %(cookie_name)s cookie has an unknown attribute, '%(attribute)s'.": "Le cookie %(cookie_name)s a un attribut inconnu, '%(attribute)s'.",
    "The %(cookie_name)s cookie is missing the Secure attribute.": "L'attribut Secure est manquant pour le cookie %(cookie_name)s.",
    "The %(directive)s cache directive appears more than once.": "La directive de cache %(directive)s apparaît plus d'une fois.",
    "The %(directive)s cache directive has no meaning in a %(message_type)s.": "La directive de cache %(directive)s n'a aucune signification dans un %(message_type)s.",
    "The %(directive)s cache directive has non-lowercase characters.": "La directive de cache %(directive)s contient des caractères qui ne sont pas en minuscules.",
    "The %(directive)s cache directive is very large.": "La directive de cache %(directive)s est très volumineuse.",
    "The %(directive)s cache directive overrides other directives.": "La directive de cache %(directive)s remplace d'autres directives.",
    "The %(directive)s directive in the HSTS header must not have a value.": "La directive %(directive)s dans l'en-tête HSTS ne doit pas avoir de valeur.",
    "The %(field_name)s field is defined as a\n[Structured Field](https://www.rfc-editor.org/rfc/rfc9651.html),\nbut its value can't be parsed as one. As a result, this field is likely\nto be ignored.\n\nThe parser reports this error:\n    %(error)s.": "Le champ %(field_name)s est défini comme un\n[champ structuré](https://www.rfc-editor.org/rfc/rfc9651.html),\nmais sa valeur ne peut pas être analysée comme tel. Par conséquent, ce champ est susceptible\nd'être ignoré.\n\nLe parseur signale cette erreur :\n    %(error)s.",
    "The %(field_name)s field isn't defined to have any meaning in requests.": "Le champ %(field_name)s n'est pas défini pour avoir une signification dans les requêtes.",
    "The %(field_name)s field isn't defined to have any meaning in responses.": "Le champ %(field_name)s n'est pas défini pour avoir une signification dans les réponses.",
    "The %(field_name)s field value isn't a valid Structured Field.": "La valeur du champ %(field_name)s n'est pas un champ structuré valide.",
    "The %(field_name)s field value isn't valid.": "La valeur du champ %(field_name)s n'est pas valide.",
    "The %(field_name)s header is deprecated.": "L'en-tête %(field_name)s est obsolète.",
    "The %(field_name)s header is only allowed in CORS preflight requests.": "L'en-tête %(field_name)s n'est autorisé que dans les requêtes de pré-vérification CORS.",
    "The %(field_name)s header is only allowed in CORS preflight responses.": "L'en-tête %(field_name)s n'est autorisé que dans les réponses de pré-vérification CORS.",
    "The %(field_name)s header is very large (%(field_size)s bytes).": "L'en-tête %(field_name)s est très volumineux (%(field_size)s octets).",
    "The %(field_name)s header requires the Access-Control-Request-Method header.": "L'en-tête %(field_name)s requiert l'en-tête Access-Control-Request-Method.",
    "The %(field_name)s header requires the Origin header.": "L'en-tête %(field_name)s nécessite l'en-tête Origin.",
    "The %(field_name)s header's name contains non-ASCII characters.": "Le nom de l'en-tête %(field_name)s contient des caractères non ASCII.",
    "The %(field_name)s header's value contains non-ASCII characters.": "La valeur de l'en-tête %(field_name)s contient des caractères non ASCII.",
    "The %(field_name)s header's value isn't a valid date.": "La valeur de l'en-tête %(field_name)s n'est pas une date valide.",
    "The %(field_name)s header's value uses an obsolete format.": "La valeur de l'en-tête %(field_name)s utilise un format obsolète.",
    "The %(header_name)s header can probably be removed.": "L'en-tête %(header_name)s peut probablement être supprimé.",
    "The %(lang)s language tag appears more than once.": "La balise de langue %(lang)s apparaît plus d'une fois.",
    "The %(param)s parameter's value doesn't define an encoding.": "La valeur du paramètre %(param)s ne définit pas d'encodage.",
    "The %(param)s parameter's value is invalid.": "La valeur du paramètre %(param)s n'est pas valide.",
    "The %(param)s parameter's value uses an encoding other than UTF-8.": "La valeur du paramètre %(param)s utilise un encodage autre que UTF-8.",
    "The %(param)s* parameter isn't allowed on the %(field_name)s field.": "Le paramètre %(param)s* n'est pas autorisé sur le champ %(field_name)s.",
    "The %(status)s status code is deprecated.": "Le code d'état %(status)s est obsolète.",
    "The %(status)s status code is reserved.": "Le code d'état %(status)s est réservé.",
    "The %(status)s status code means that the server can't or won't accept a request-uri this long.": "Le code de statut %(status)s signifie que le serveur ne peut pas ou ne veut pas accepter une URI de requête aussi longue.",
    "The %(status)s status code redirects users to another URI. The `Location` header is used to\nconvey this URI, but a valid one isn't present in this response.": "Le code d'état %(status)s redirige les utilisateurs vers un autre URI. L'en-tête `Location` est utilisé pour transmettre cet URI, mais un URI valide n'est pas présent dans cette réponse.",
    "The '%(disposition)s' Content-Disposition isn't known.": "Le Content-Disposition '%(disposition)s' n'est pas connu.",
    "The '%(expectation)s' expectation is not supported.": "L'attente '%(expectation)s' n'est pas prise en charge.",
    "The '%(feature)s' feature is allowed for all origins.": "La fonctionnalité '%(feature)s' est autorisée pour toutes les origines.",
    "The '%(param)s' parameter on the %(field_name)s header is single-quoted.": "Le paramètre '%(param)s' sur l'en-tête %(field_name)s est entre guillemets simples.",
    "The '%(param)s' parameter repeats in the %(field_name)s header.": "Le paramètre '%(param)s' se répète dans l'en-tête %(field_name)s.",
    "The '%(param)s' parameter's value cannot be quoted.": "La valeur du paramètre '%(param)s' ne peut pas être entre guillemets.",
    "The 'anchor' parameter on the %(link)s Link header isn't a URI.": "Le paramètre 'anchor' sur l'en-tête Link %(link)s n'est pas un URI.",
    "The 'filename' parameter on the Content-Disposition header contains a '%%' character.": "Le paramètre 'filename' dans l'en-tête Content-Disposition contient un caractère '%%'.",
    "The 'rev' parameter on the Link header is deprecated.": "Le paramètre 'rev' sur l'en-tête Link est obsolète.",
    "The Age header's value is very large.": "La valeur de l'en-tête Age est très grande.",
    "The Age header's value should be an integer.": "La valeur de l'en-tête Age doit être un entier.",
    "The Age headers' value must be a positive integer.": "La valeur des en-têtes Age doit être un entier positif.",
    "The Cache-Status header has an invalid structure.": "L'en-tête Cache-Status a une structure non valide.",
    "The Clear-Site-Data header contains an unknown value '%(value)s'.": "L'en-tête Clear-Site-Data contient une valeur inconnue '%(value)s'.",
    "The Content-Disposition header doesn't have a 'filename' parameter.": "L'en-tête Content-Disposition n'a pas de paramètre 'filename'.",
    "The Content-Length header is correct.": "L'en-tête Content-Length est correct.",
    "The Content-Length header is very large.": "L'en-tête Content-Length est très volumineux.",
    "The Expect header is not supported in HTTP/1.0.": "L'en-tête Expect n'est pas pris en charge dans HTTP/1.0.",
    "The Last-Modified time is in the future.": "L'heure Last-Modified est dans le futur.",
    "The Location header contains a relative URI.": "L'en-tête Location contient un URI relatif.",
    "The Max-Forwards header is ignored for this method.": "L'en-tête Max-Forwards est ignoré pour cette méthode.",
    "The Pragma header is being used in an undefined way.": "L'en-tête Pragma est utilisé de manière indéfinie.",
    "The Referer header is sent from a secure origin to a different origin.": "L'en-tête Referer est envoyé d'une origine sécurisée vers une origine différente.",
    "The Referer header is sent from a secure origin to an insecure target.": "L'en-tête Referer est envoyé d'une origine sécurisée vers une cible non sécurisée.",
    "The Referrer-Policy value '%(policy)s' is unknown.": "La valeur Referrer-Policy '%(policy)s' est inconnue.",
    "The Server header is long.": "L'en-tête Server est long.",
    "The URI is very long (%(uri_len)s characters).": "L'URI est très long (%(uri_len)s caractères).",
    "The URI's syntax isn't valid.": "La syntaxe de l'URI n'est pas valide.",
    "The User-Agent header is missing.": "L'en-tête User-Agent est manquant.",
    "The `%(directive)s` cache directive is only defined to appear in %(other_message)s\nmessages; is has no defined meaning in a %(message_type)s.": "La directive de cache `%(directive)s` est uniquement définie pour apparaître dans les messages %(other_message)s ; elle n'a pas de signification définie dans un %(message_type)s.",
    "The `%(directive)s` cache directive is only defined to appear once; it is used more than\nonce here, so implementations may use different instances (e.g., the first, or the last),\nmaking their behaviour unpredictable.": "La directive de cache `%(directive)s` n'est définie que pour apparaître une seule fois ; elle est utilisée plus d'une fois ici, donc les implémentations peuvent utiliser différentes instances (par exemple, la première ou la dernière), rendant leur comportement imprévisible.",
    "The `%(directive)s` cache directive overrides or conflicts with %(conflicts)s.\n\nThe conflicting directives will be ignored by caches, and can be safely omitted.\n    ": "La directive de cache `%(directive)s` remplace ou entre en conflit avec %(conflicts)s.\n\nLes directives conflictuelles seront ignorées par les caches et peuvent être omises en toute sécurité.",
    "The `%(directive)s` cache directive's value is greater than 2^31-1. Some implementations may not be\nable to handle values this large.": "La valeur de la directive de cache `%(directive)s` est supérieure à 2^31-1. Certaines implémentations pourraient ne pas être\nen mesure de gérer des valeurs aussi grandes.",
    "The `%(field_name)s` header is only used in a Cross-Origin Resource Sharing (CORS) preflight\nrequest.\n\nA preflight request requires the `Access-Control-Request-Method` header to be present.": "L'en-tête `%(field_name)s` est uniquement utilisé dans une requête preflight de partage des ressources d'origine croisée (CORS).\n\nUne requête preflight nécessite la présence de l'en-tête `Access-Control-Request-Method`.",
    "The `%(field_name)s` header is only used in a Cross-Origin Resource Sharing (CORS) preflight\nrequest.\n\nA preflight request requires the `Origin` header to be present.": "L'en-tête `%(field_name)s` est uniquement utilisé dans une requête d'exploration préalable de partage des ressources d'origine croisée (CORS).\n\nUne requête d'exploration préalable nécessite que l'en-tête `Origin` soit présent.",
    "The `%(field_name)s` header is only used in a Cross-Origin Resource Sharing (CORS) preflight\nrequest.\n\nA preflight request uses the `OPTIONS` method; this request uses `%(method)s`.": "L'en-tête `%(field_name)s` est uniquement utilisé dans une requête pré-vérification de partage de ressources entre origines (CORS).\n\nUne requête pré-vérification utilise la méthode `OPTIONS` ; cette requête utilise `%(method)s`.",
    "The `%(field_name)s` header is only used in the response to a Cross-Origin Resource Sharing (CORS)\npreflight request.\n\nA preflight request is an `OPTIONS` request that includes an `Origin` header and an\n`Access-Control-Request-Method` header.\n\nThis response was not to a CORS preflight request, so this header should not be present.": "L'en-tête `%(field_name)s` n'est utilisé que dans la réponse à une requête préliminaire CORS (Cross-Origin Resource Sharing).\n\nUne requête préliminaire est une requête `OPTIONS` qui inclut un en-tête `Origin` et un en-tête `Access-Control-Request-Method`.\n\nCette réponse n'était pas une requête préliminaire CORS, donc cet en-tête ne devrait pas être présent.",
    "The `%(field_name)s` header must be one of `require-corp`, `credentialless`, or\n`unsafe-none`.\n": "L'en-tête `%(field_name)s` doit être l'une des valeurs suivantes : `require-corp`, `credentialless` ou `unsafe-none`.",
    "The `%(header_name)s` header adds little value, contributes to unnecessary bandwidth,\nand may increase security risk by exposing details of the back-end system.\n\nConsider removing it.": "L'en-tête `%(header_name)s` ajoute peu de valeur, contribue à une bande passante inutile et peut augmenter le risque de sécurité en exposant les détails du système back-end.\n\nEnvisagez de le supprimer.",
    "The `%(lang)s` language tag is used more than once in the `Content-Language` header.\n\nRecipients will likely ignore duplicates.": "Le tag de langue `%(lang)s` est utilisé plus d'une fois dans l'en-tête `Content-Language`.\n\nLes destinataires ignoreront probablement les doublons.",
    "The `%(param)s` parameter is not defined in the Cache-Status specification.\n": "Le paramètre `%(param)s` n'est pas défini dans la spécification Cache-Status.",
    "The `%(param)s`'s value on the %(field_name)s field starts and ends with a single quote (').\nHowever, single quotes don't mean anything there.\n\nThis means that the value will be interpreted as `%(param_val)s`, **not**\n`%(param_val_unquoted)s`. If you intend the latter, remove the single quotes.": "La valeur de `%(param)s` sur le champ %(field_name)s commence et se termine par une apostrophe (').\nCependant, les apostrophes n'ont aucune signification à cet endroit.\n\nCela signifie que la valeur sera interprétée comme `%(param_val)s`, **et non** comme\n`%(param_val_unquoted)s`. Si vous vouliez cette dernière, supprimez les apostrophes.",
    "The `'unsafe-eval'` [Content Security Policy](https://www.w3.org/TR/CSP3/)\ndirective allows the use of string-to-code mechanisms like `eval()`, which can make it easier for\nattackers to execute malicious code.\n\nIt was found in the following directives:\n\n%(directives_list)s": "La directive `'unsafe-eval'` [Content Security Policy](https://www.w3.org/TR/CSP3/)\npermet l'utilisation de mécanismes de conversion de chaînes en code comme `eval()`, ce qui peut faciliter l'exécution de code malveillant par des attaquants.\n\nElle a été trouvée dans les directives suivantes :\n\n%(directives_list)s",
    "The `'unsafe-inline'` [Content Security Policy](https://www.w3.org/TR/CSP3/)\ndirective allows the execution of inline scripts and event handlers, which\nsignificantly reduces the protection provided by CSP against Cross-Site\nScripting (XSS) attacks.\n\nIt was found in the following directives:\n\n%(directives_list)s": "La directive `'unsafe-inline'` [Content Security Policy](https://www.w3.org/TR/CSP3/)\npermet l'exécution de scripts en ligne et de gestionnaires d'événements, ce qui\nréduit considérablement la protection fournie par CSP contre les attaques par\nscript intersite (XSS).\n\nElle a été trouvée dans les directives suivantes :\n\n%(directives_list)s",
    "The `*` [Content Security Policy](https://www.w3.org/TR/CSP3/)\ndirective allows resources to be loaded from any origin, which significantly reduces the protection\nprovided by CSP.%(report_only_text)s\n\nIt was found in the following directives:\n\n%(directives_list)s": "La directive `*` [Content Security Policy](https://www.w3.org/TR/CSP3/)\npermet de charger des ressources depuis n'importe quelle origine, ce qui réduit considérablement la protection\nfournie par CSP.%(report_only_text)s\n\nElle a été trouvée dans les directives suivantes :\n\n%(directives_list)s",
    "The `103 (Early Hints)` status code allows the server to send some headers before the final response,\ntypically to help the client start fetching resources earlier.": "Le code d'état `103 (Early Hints)` permet au serveur d'envoyer certains en-têtes avant la réponse finale,\ntypiquement pour aider le client à commencer à récupérer les ressources plus tôt.",
    "The `104 (Upload Resumption Supported)` status code indicates that the server supports resumable\nuploads.": "Le code d'état `104 (Upload Resumption Supported)` indique que le serveur prend en charge les\ntéléchargements réutilisables.",
    "The `201 (Created)` status code indicates that the request created a new resource.\n\nHTTP specifies that the URL of the new resource is to be indicated in the `Location` header,\nbut it isn't present in this response.": "Le code d'état `201 (Created)` indique que la requête a créé une nouvelle ressource.\n\nHTTP spécifie que l'URL de la nouvelle ressource doit être indiquée dans l'en-tête `Location`,\nmais il n'est pas présent dans cette réponse.",
    "The `201 (Created)` status code indicates that the request created a new resource.\n\nHowever, the request method used (%(method)s) is defined as a \"safe\" method; that is, it\nshould not have any side effects.\n\nCreating resources as a side effect of a safe method can have unintended consequences; for example,\nsearch engine spiders and similar automated agents often follow links, and intermediaries sometimes\nre-try safe methods when they fail.": "Le code d'état `201 (Created)` indique que la requête a créé une nouvelle ressource.\n\nCependant, la méthode de requête utilisée (`%(method)s`) est définie comme une méthode « sûre » ; c'est-à-dire qu'elle ne devrait avoir aucun effet secondaire.\n\nLa création de ressources comme effet secondaire d'une méthode sûre peut avoir des conséquences imprévues ; par exemple, les robots d'exploration des moteurs de recherche et les agents automatisés similaires suivent souvent les liens, et les intermédiaires réessayent parfois les méthodes sûres en cas d'échec.",
    "The `206 (Partial Response)` status code indicates that the response content is only partial.\n\nHowever, for a response to be partial, it needs to have a `Content-Range` header to indicate\nwhat part of the full response it carries. This response does not have one.": "Le code d'état `206 (Réponse partielle)` indique que le contenu de la réponse n'est que partiel.\n\nCependant, pour qu'une réponse soit partielle, elle doit avoir un en-tête `Content-Range` pour indiquer quelle partie de la réponse complète elle transporte. Cette réponse n'en a pas.",
    "The `206 (Partial Response)` status code indicates that the response content is only partial.\n\nHowever, the client needs to ask for it with the `Range` header, and the request did not\ninclude one.": "Le code d'état `206 (Partial Response)` indique que le contenu de la réponse n'est que partiel.\n\nCependant, le client doit le demander avec l'en-tête `Range`, et la requête n'en incluait pas.",
    "The `208 (Already Reported)` status code can be used inside a DAV: propstat response element to\navoid enumerating the internal members of multiple bindings to the same collection repeatedly.": "Le code d'état `208 (Already Reported)` peut être utilisé dans un élément de réponse DAV: propstat pour éviter de répertorier à plusieurs reprises les membres internes de plusieurs liaisons à la même collection.",
    "The `412 (Precondition Failed)` status code indicates that one or more conditions given in the\nrequest header fields evaluated to false when tested on the server.\n\nHowever, this request didn't contain any conditional headers (such as `If-Match`, `If-None-Match`,\n`If-Modified-Since`, `If-Unmodified-Since`, or `If-Range`).": "Le code d'état `412 (Precondition Failed)` indique qu'une ou plusieurs conditions spécifiées dans les champs d'en-tête de la requête ont été évaluées à faux par le serveur.\n\nCependant, cette requête ne contenait aucun en-tête conditionnel (tel que `If-Match`, `If-None-Match`, `If-Modified-Since`, `If-Unmodified-Since`, ou `If-Range`).",
    "The `416 (Range Not Satisfiable)` status code indicates that the set of ranges in the request's\n`Range` header field overlap the current extent of the selected resource.\n\nHowever, this request didn't contain a `Range` header.": "Le code d'état `416 (Range Not Satisfiable)` indique que l'ensemble des plages dans l'en-tête `Range` de la requête chevauche l'étendue actuelle de la ressource sélectionnée.\n\nCependant, cette requête ne contenait pas d'en-tête `Range`.",
    "The `417 (Expectation Failed)` status code indicates that the expectation given in the request's\n`Expect` header field could not be met by at least one of the inbound servers.\n\nHowever, this request didn't contain an `Expect` header.": "Le code d'état `417 (Expectation Failed)` indique que l'attente spécifiée dans l'en-tête `Expect` de la requête n'a pas pu être satisfaite par au moins un des serveurs entrants.\n\nCependant, cette requête ne contenait pas d'en-tête `Expect`.",
    "The `417 (Expectation Failed)` status code indicates that the expectation given in the request's\n`Expect` header field could not be met by at least one of the inbound servers.\n\nIn this case, the client requested `100-continue`, but the server (or an intermediary) couldn't\nsatisfy it.": "Le code d'état `417 (Expectation Failed)` indique que l'attente spécifiée dans l'en-tête `Expect` de la requête n'a pas pu être satisfaite par au moins un des serveurs entrants.\n\nDans ce cas, le client a demandé `100-continue`, mais le serveur (ou un intermédiaire) n'a pas pu le satisfaire.",
    "The `421 (Misdirected Request)` status code indicates that the request was directed at a server\nthat is not able to produce a response. This can happen when a connection is reused.": "Le code d'état `421 (Misdirected Request)` indique que la requête a été dirigée vers un serveur qui n'est pas en mesure de produire une réponse. Cela peut se produire lorsqu'une connexion est réutilisée.",
    "The `425 (Too Early)` status code indicates that the server is unwilling to risk processing a\nrequest that might be replayed.": "Le code d'état `425 (Trop tôt)` indique que le serveur ne souhaite pas prendre le risque de traiter une requête qui pourrait être rejouée.",
    "The `428 (Precondition Required)` status code indicates that the origin server requires the request\nto be conditional.": "Le code d'état `428 (Precondition Required)` indique que le serveur d'origine exige que la requête soit conditionnelle.",
    "The `429 (Too Many Requests)` status code indicates that the client has sent too many requests in a\ngiven amount of time (\"rate limiting\").": "Le code d'état `429 (Too Many Requests)` indique que le client a envoyé trop de requêtes dans un\ndélai donné (« limitation du débit »).",
    "The `431 (Request Header Fields Too Large)` status code indicates that the server is unwilling to\nprocess the request because its header fields are too large.": "Le code d'état `431 (Request Header Fields Too Large)` indique que le serveur refuse de traiter la requête car ses champs d'en-tête sont trop volumineux.",
    "The `451 (Unavailable For Legal Reasons)` status code indicates that the server is denying access to\nthe resource as a consequence of a legal demand.": "Le code d'état `451 (Unavailable For Legal Reasons)` indique que le serveur refuse l'accès à la ressource suite à une demande légale.",
    "The `508 (Loop Detected)` status code indicates that the server terminated an operation because it\nencountered an infinite loop while processing a request with \"Depth: infinity\".": "Le code d'état `508 (Loop Detected)` indique que le serveur a interrompu une opération car il a rencontré une boucle infinie lors du traitement d'une requête avec \"Depth: infinity\".",
    "The `511 (Network Authentication Required)` status code indicates that the client needs to\nauthenticate to gain network access.": "Le code d'état `511 (Network Authentication Required)` indique que le client doit s'authentifier pour obtenir l'accès au réseau.",
    "The `Accept-Ranges` response header tells clients what `range-unit`s a resource is willing to\nprocess in future requests. HTTP only defines two: `bytes` and `none`.\n\nClients who don't know about the non-standard range-unit will not be able to use it.": "L'en-tête de réponse `Accept-Ranges` indique aux clients quels `range-unit`s une ressource accepte de traiter dans les requêtes futures. HTTP n'en définit que deux : `bytes` et `none`.\n\nLes clients qui ignorent le `range-unit` non standard ne pourront pas l'utiliser.",
    "The `Access-Control-Allow-Credentials` header must be set to `true` if present. If you don't want\nto allow credentials, omit the header.": "L'en-tête `Access-Control-Allow-Credentials` doit être défini sur `true` s'il est présent. Si vous ne souhaitez pas autoriser les informations d'identification, omettez l'en-tête.",
    "The `Access-Control-Allow-Origin` header can only contain a single origin, `*`, or `null`. It\ncannot contain a list of origins.": "L'en-tête `Access-Control-Allow-Origin` ne peut contenir qu'une seule origine, `*`, ou `null`. Il ne peut pas contenir une liste d'origines.",
    "The `Age` header indicates the age of the response; i.e., how long it has been cached\nsince it was generated. The value given was negative, so it is not a valid age.": "L'en-tête `Age` indique l'âge de la réponse, c'est-à-dire la durée pendant laquelle elle a été mise en cache\ndepuis sa génération. La valeur fournie était négative, elle ne représente donc pas un âge valide.",
    "The `Age` header indicates the age of the response; i.e., how long it has been cached\nsince it was generated. The value given was not an integer, so it is not a valid age.": "L'en-tête `Age` indique l'âge de la réponse ; c'est-à-dire depuis combien de temps elle a été mise en cache\ndepuis sa génération. La valeur donnée n'était pas un entier, elle n'est donc pas un âge valide.",
    "The `Age` header's value is greater than 2,147,483,648. Some implementations may represent it\nusing that value (which is over 68 years).\n": "La valeur de l'en-tête `Age` est supérieure à 2 147 483 648. Certaines implémentations peuvent la représenter\nen utilisant cette valeur (qui dépasse 68 ans).",
    "The `Cache-Control: max-age` directive and the `Expires` header are both present.\n\n`max-age` takes precedence over `Expires`, so `Expires` is redundant and can be removed.": "La directive `Cache-Control: max-age` et l'en-tête `Expires` sont tous deux présents.\n\n`max-age` a la priorité sur `Expires`, `Expires` est donc redondant et peut être supprimé.",
    "The `Cache-Control: must-revalidate` directive forbids caches from using stale responses to satisfy\nrequests.\n\nFor example, caches often use stale responses when they cannot connect to the origin server; when\nthis directive is present, they will return an error rather than a stale response.": "La directive `Cache-Control: must-revalidate` interdit aux caches d'utiliser des réponses obsolètes pour satisfaire les requêtes.\n\nPar exemple, les caches utilisent souvent des réponses obsolètes lorsqu'ils ne peuvent pas se connecter au serveur d'origine ; lorsque cette directive est présente, ils renvoient une erreur plutôt qu'une réponse obsolète.",
    "The `Cache-Control: no-cache` directive means that while caches can store this\nresponse, they cannot use it to satisfy a request unless it has been validated (either with an\n`If-None-Match` or `If-Modified-Since` conditional) for that request.": "La directive `Cache-Control: no-cache` signifie que bien que les caches puissent stocker cette réponse, ils ne peuvent pas l'utiliser pour satisfaire une requête, sauf si elle a été validée (soit avec une condition `If-None-Match` ou `If-Modified-Since`) pour cette requête.",
    "The `Cache-Control: no-cache` directive means that while caches can store this response, they\ncannot use it to satisfy a request unless it has been validated (either with an `If-None-Match` or\n`If-Modified-Since` conditional) for that request.\n\n%(message)s doesn't have a `Last-Modified` or `ETag` header, so it effectively can't be used by a\ncache. `Cache-Control: no-store` is more appropriate.": "La directive `Cache-Control: no-cache` signifie que bien que les caches puissent stocker cette réponse, ils ne peuvent pas l'utiliser pour satisfaire une requête, à moins qu'elle n'ait été validée (avec une condition `If-None-Match` ou `If-Modified-Since`) pour cette requête.\n\n%(message)s n'a pas d'en-tête `Last-Modified` ou `ETag`, il ne peut donc effectivement pas être utilisé par un cache. `Cache-Control: no-store` est plus approprié.",
    "The `Cache-Control: no-store` directive indicates that this response can't be stored by a cache.": "La directive `Cache-Control: no-store` indique que cette réponse ne peut pas être stockée par un cache.",
    "The `Cache-Control: private` directive indicates that the response can only be stored by caches\nthat are specific to a single user; for example, a browser cache. Shared caches, such as those in\nproxies, cannot store it.": "La directive `Cache-Control: private` indique que la réponse ne peut être stockée que par des caches spécifiques à un seul utilisateur ; par exemple, un cache de navigateur. Les caches partagés, tels que ceux des proxys, ne peuvent pas le stocker.",
    "The `Cache-Control: public` directive allows caches to store and use responses\nin some circumstances when they would otherwise not be able to.\n\nFor example, it allows responses to authenticated requests to be stored by shared caches.\n\nOther responses **do not need to contain `public`**; it does not make the\nresponse \"more cacheable\", and only makes the response headers larger.": "La directive `Cache-Control: public` permet aux caches de stocker et d'utiliser les réponses\ndans certaines circonstances où ils ne seraient pas en mesure de le faire autrement.\n\nPar exemple, elle permet aux caches partagés de stocker les réponses aux requêtes authentifiées.\n\nLes autres réponses **n'ont pas besoin de contenir `public`** ; cela ne rend pas la\nréponse \"plus cacheable\", et augmente uniquement la taille des en-têtes de réponse.",
    "The `Cache-Status` header field indicates how caches have handled the response.\n\n%(status)s\n": "Le champ d'en-tête `Cache-Status` indique comment les caches ont géré la réponse.\n\n%(status)s",
    "The `Cache-Status` header must be a list of members, where each member is a \nToken or String (identifying the cache) with optional parameters.\n": "L'en-tête `Cache-Status` doit être une liste de membres, où chaque membre est un\nToken ou une chaîne de caractères (identifiant le cache) avec des paramètres optionnels.",
    "The `Clear-Site-Data` header contains a value that is not recognized.\nValid values are: `\"cache\"`, `\"cookies\"`, `\"storage\"`, `\"executionContexts\"`, `\"*\"`.": "L'en-tête `Clear-Site-Data` contient une valeur qui n'est pas reconnue.\nLes valeurs valides sont : `\"cache\"`, `\"cookies\"`, `\"storage\"`, `\"executionContexts\"`, `\"*`\".",
    "The `Content-Disposition` header has two widely-known values; `inline` and `attachment`.\n`%(disposition)s` isn't recognised, and most implementations will default to handling it like\n`attachment`.": "L'en-tête `Content-Disposition` a deux valeurs bien connues : `inline` et `attachment`.\n`%(disposition)s` n'est pas reconnu, et la plupart des implémentations le traiteront par défaut comme `attachment`.",
    "The `Content-Disposition` header suggests a filename for clients to use when saving the file\nlocally, using the `filename` and `filename*` parameters.\n\nOne of these parameters contains a path character (\"\\\" or \"/\"), used to navigate between\ndirectories on common operating systems.\n\nBecause this can be used to attach the browser's host operating system (e.g., by saving a file to a\nsystem directory), browsers will usually ignore these parameters, or remove path information.\n\nYou should remove these characters.": "L'en-tête `Content-Disposition` suggère un nom de fichier que les clients doivent utiliser lors de l'enregistrement du fichier localement, en utilisant les paramètres `filename` et `filename*`.\n\nL'un de ces paramètres contient un caractère de chemin (\"\\\" ou \"/\"), utilisé pour naviguer entre les répertoires sur les systèmes d'exploitation courants.\n\nÉtant donné que cela peut être utilisé pour accéder au système d'exploitation hôte du navigateur (par exemple, en enregistrant un fichier dans un répertoire système), les navigateurs ignoreront généralement ces paramètres ou supprimeront les informations de chemin.\n\nVous devez supprimer ces caractères.",
    "The `Content-Disposition` header suggests a filename for clients to use when saving the file\nlocally, using the `filename` parameter.\n\n[RFC6266](https://www.rfc-editor.org/rfc/rfc6266) specifies how to carry non-ASCII characters in this\nparameter. However, historically some (but not all) browsers have also decoded %%-encoded\ncharacters in the `filename` parameter, which means that they'll be treated differently depending\non the browser you're using.\n\nAs a result, it's not interoperable to use percent characters in the `filename` parameter. Use the\ncorrect encoding in the `filename*` parameter instead.": "L'en-tête `Content-Disposition` suggère un nom de fichier que les clients doivent utiliser lors de l'enregistrement du fichier\nlocalement, en utilisant le paramètre `filename`.\n\nLe [RFC6266](https://www.rfc-editor.org/rfc/rfc6266) spécifie comment transporter des caractères non-ASCII dans ce\nparamètre. Cependant, historiquement, certains navigateurs (mais pas tous) ont également décodé les caractères %% encodés\ndans le paramètre `filename`, ce qui signifie qu'ils seront traités différemment selon\nle navigateur que vous utilisez.\n\nPar conséquent, il n'est pas interopérable d'utiliser des caractères pourcentage dans le paramètre `filename`. Utilisez le\nbon encodage dans le paramètre `filename*` à la place.",
    "The `Content-Disposition` header with a disposition of `attachment` suggests a filename for clients\nto use when saving the file locally.\n\nIt should always contain a `filename` parameter, even when the `filename*` parameter is used to\ncarry an internationalised filename, so that browsers can fall back to an ASCII-only filename.": "L'en-tête `Content-Disposition` avec une disposition de `attachment` suggère un nom de fichier que les clients doivent utiliser lors de l'enregistrement du fichier localement.\n\nIl doit toujours contenir un paramètre `filename`, même lorsque le paramètre `filename*` est utilisé pour véhiculer un nom de fichier internationalisé, afin que les navigateurs puissent se rabattre sur un nom de fichier ASCII uniquement.",
    "The `Content-Length` header's value is greater than 2^63-1. Some implementations may not be able to\nhandle values this large.": "La valeur de l'en-tête `Content-Length` est supérieure à 2^63-1. Certaines implémentations pourraient ne pas être en mesure de gérer des valeurs aussi importantes.",
    "The `Content-Type` header declares the content as `%(declared_type)s`, but it looks like\n`%(sniffed_type)s`.": "L'en-tête `Content-Type` déclare le contenu comme étant `%(declared_type)s`, mais il semble être `%(sniffed_type)s`.",
    "The `Expect` header was added in HTTP/1.1; it has no meaning in HTTP/1.0.": "L'en-tête `Expect` a été ajouté dans HTTP/1.1 ; il n'a aucune signification dans HTTP/1.0.",
    "The `credentialless`\n[Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header)\nallows loading cross-origin resources without explicit permission in supporting browsers, but\nrequests for them will not include credentials (cookies, client certificates,\netc.).%(report_only_text)s": "La politique `credentialless`\n[Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header)\npermet de charger des ressources inter-origines sans permission explicite dans les navigateurs compatibles, mais\nles requêtes pour celles-ci n'incluront pas les identifiants (cookies, certificats client,\netc.).%(report_only_text)s",
    "The `report-uri` [Content Security Policy](https://www.w3.org/TR/CSP3/)\ndirective is deprecated in favor of `report-to`. It is recommended to use `report-to`\nfor reporting violations, although `report-uri` may still be supported for backward\ncompatibility.": "La directive `report-uri` [Content Security Policy](https://www.w3.org/TR/CSP3/) est dépréciée au profit de `report-to`. Il est recommandé d'utiliser `report-to` pour signaler les violations, bien que `report-uri` puisse encore être pris en charge pour des raisons de compatibilité ascendante.",
    "The `require-corp`\n[Cross Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header)\nrequires that all cross-origin resources must explicitly grant permission to be loaded via a\n`Cross-Origin-Resource-Policy` header, in supporting browsers.%(report_only_text)s": "La politique `require-corp` de\n[Cross Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header)\nexige que toutes les ressources inter-origines accordent explicitement l'autorisation d'être chargées via un en-tête\n`Cross-Origin-Resource-Policy`, dans les navigateurs compatibles.%(report_only_text)s",
    "The `stale-if-error` cache directive allows a cache to return a stale response when an error\n(e.g., a 500 Internal Server Error, or a network timeout) is encountered while attempting to\nrevalidate it.\n\nSee [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) for more information.": "La directive de cache `stale-if-error` permet à un cache de renvoyer une réponse obsolète lorsqu'une erreur\n(par exemple, une erreur interne du serveur 500 ou un délai d'attente réseau) est rencontrée lors de sa révalidation.\n\nVoir la [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) pour plus d'informations.",
    "The `stale-while-revalidate` cache directive allows a cache to serve a stale response while a\nrevalidation request is happening in the background.\n\nSee [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) for more information.": "La directive de cache `stale-while-revalidate` permet à un cache de servir une réponse obsolète pendant qu'une requête de revalidation est en cours en arrière-plan.\n\nVoir [RFC 5861](https://www.rfc-editor.org/rfc/rfc5861) pour plus d'informations.",
    "The `unsafe-none`\n[Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header)\nis the default behavior, allowing cross-origin resources to be loaded\nwithout explicit permission in supporting browsers.\n\nThis does not provide cross-origin isolation.%(report_only_text)s": "Le `unsafe-none`\n[Cross-Origin Embedder Policy](https://fetch.spec.whatwg.org/#cross-origin-embedder-policy-header)\nest le comportement par défaut, autorisant le chargement de ressources inter-origines\nsans permission explicite dans les navigateurs compatibles.\n\nCela ne fournit pas d'isolation inter-origines.%(report_only_text)s",
    "The client has sent too many requests in a given amount of time.": "Le client a envoyé trop de requêtes dans un laps de temps donné.",
    "The client needs to authenticate to gain network access.": "Le client doit s'authentifier pour obtenir un accès réseau.",
    "The content doesn't match the declared Content-Type.": "Le contenu ne correspond pas au Content-Type déclaré.",
    "The deprecated report-uri directive is used.": "La directive obsolète report-uri est utilisée.",
    "The filename in the Content-Disposition header contains a path character.": "Le nom de fichier dans l'en-tête Content-Disposition contient un caractère de chemin.",
    "The identity transfer-coding isn't necessary.": "Le codage de transfert d'identité n'est pas nécessaire.",
    "The item '%(item)s' is not a valid type for an allowlist.": "L'élément '%(item)s' n'est pas un type valide pour une liste d'autorisation.",
    "The max-age directive in the HSTS header is invalid.": "La directive max-age dans l'en-tête HSTS n'est pas valide.",
    "The max-age is 0.": "Le max-age est 0.",
    "The max-age is less than one year.": "Le max-age est inférieur à un an.",
    "The members of a DAV binding have already been enumerated.": "Les membres d'une liaison DAV ont déjà été énumérés.",
    "The origin server requires the request to be conditional.": "Le serveur d'origine exige que la requête soit conditionnelle.",
    "The post-check cache directive's value is '0'.": "La valeur de la directive de cache post-check est '0'.",
    "The post-check cache directive's value is larger than pre-check's.": "La valeur de la directive de cache post-check est supérieure à celle de pre-check.",
    "The pre-check and post-check cache directives are both '0'.": "Les directives de cache pre-check et post-check sont toutes deux à '0'.",
    "The presence of the `Cache-Control: proxy-revalidate` and/or `s-maxage` directives forbids shared\ncaches (e.g., proxy caches) from using stale responses to satisfy requests.\n\nFor example, caches often use stale responses when they cannot connect to the origin server; when\nthis directive is present, they will return an error rather than a stale response.\n\nThese directives do not affect private caches; for example, those in browsers.": "La présence des directives `Cache-Control: proxy-revalidate` et/ou `s-maxage` interdit aux caches partagés (par exemple, les caches proxy) d'utiliser des réponses obsolètes pour satisfaire les requêtes.\n\nPar exemple, les caches utilisent souvent des réponses obsolètes lorsqu'ils ne peuvent pas se connecter au serveur d'origine ; lorsque cette directive est présente, ils renverront une erreur plutôt qu'une réponse obsolète.\n\nCes directives n'affectent pas les caches privés ; par exemple, ceux des navigateurs.",
    "The protocol was upgraded without being requested.": "Le protocole a été mis à niveau sans avoir été demandé.",
    "The request HTTP version isn't supported.": "La version HTTP de la requête n'est pas prise en charge.",
    "The request conflicted with the state of the resource.": "La requête est entrée en conflit avec l'état de la ressource.",
    "The request content was too large for the server.": "Le contenu de la requête était trop volumineux pour le serveur.",
    "The request didn't have a Range header.": "La requête n'avait pas d'en-tête Range.",
    "The request didn't have an Expect header.": "La requête n'avait pas d'en-tête Expect.",
    "The request didn't have any preconditions.": "La requête n'avait aucune condition préalable.",
    "The request was directed at a server that is not able to produce a response.": "La requête a été dirigée vers un serveur qui n'est pas en mesure de produire une réponse.",
    "The resource could not be found.": "La ressource est introuvable.",
    "The resource doesn't support this media type in requests.": "La ressource ne prend pas en charge ce type de média dans les requêtes.",
    "The resource is gone.": "La ressource a disparu.",
    "The resource is unavailable for legal reasons.": "La ressource est indisponible pour des raisons juridiques.",
    "The resource last changed %(last_modified_string)s.": "La ressource a changé pour la dernière fois %(last_modified_string)s.",
    "The server couldn't find any resource to serve for the given URI.": "Le serveur n'a trouvé aucune ressource à servir pour l'URI donné.",
    "The server couldn't meet the 100-continue expectation.": "Le serveur n'a pas pu répondre à l'attente 100-continue.",
    "The server didn't understand the request.": "Le serveur n'a pas compris la requête.",
    "The server doesn't implement the request method.": "Le serveur n'implémente pas la méthode de requête.",
    "The server has forbidden this request.": "Le serveur a interdit cette requête.",
    "The server is temporarily unavailable.": "Le serveur est temporairement indisponible.",
    "The server is unwilling to process the request because its headers are too large.": "Le serveur refuse de traiter la requête car ses en-têtes sont trop volumineux.",
    "The server is unwilling to risk processing a request that might be replayed.": "Le serveur refuse de traiter une demande susceptible d'être rejouée.",
    "The server previously had a resource at the given URI, but it is no longer there.": "Le serveur possédait auparavant une ressource à l'URI donné, mais elle n'y est plus.",
    "The server rejected the request because the request content sent was too large.": "Le serveur a rejeté la requête car le contenu envoyé était trop volumineux.",
    "The server returned 418 (I'm a Teapot), an easter egg defined in RFC 2324.": "Le serveur a renvoyé 418 (I'm a Teapot), un easter egg défini dans la RFC 2324.",
    "The server sent early hints.": "Le serveur a envoyé des indices précoces (early hints).",
    "The server supports upload resumption.": "Le serveur prend en charge la reprise du téléchargement.",
    "The server terminated an operation because it encountered an infinite loop.": "Le serveur a terminé une opération car il a rencontré une boucle infinie.",
    "The server won't accept a URI this long %(uri_len)s.": "Le serveur n'acceptera pas un URI aussi long %(uri_len)s.",
    "The server's clock is %(clock_skew_string)s.": "L'horloge du serveur est %(clock_skew_string)s.",
    "The server's clock is correct.": "L'horloge du serveur est correcte.",
    "The status code is not an integer.": "Le code d'état n'est pas un entier.",
    "The status phrase can only contain ASCII characters.": "La phrase d'état ne peut contenir que des caractères ASCII.",
    "The status phrase contains non-ASCII characters.": "La phrase d'état contient des caractères non ASCII.",
    "The total size of the headers is very large (%(header_size)s bytes).": "La taille totale des en-têtes est très importante (%(header_size)s octets).",
    "The value '%(value)s' looks like a keyword but is a string.": "La valeur '%(value)s' ressemble à un mot-clé mais est une chaîne.",
    "The value `%(value)s` is not defined for the `%(param)s` parameter.\n": "La valeur `%(value)s` n'est pas définie pour le paramètre `%(param)s`.\n",
    "The value for '%(feature)s' should be an Inner List or the token '*'.": "La valeur pour '%(feature)s' doit être une liste interne ou le jeton '*'.",
    "The value for this field doesn't conform to its specified syntax; see [its\ndefinition](%(ref_uri)s) for more information.": "La valeur de ce champ n'est pas conforme à sa syntaxe spécifiée ; voir [sa\ndéfinition](%(ref_uri)s) pour plus d'informations.",
    "There is no max-age directive.": "Il n'y a pas de directive max-age.",
    "There was a general server error.": "Il y a eu une erreur générale du serveur.",
    "These headers are representation metadata that should not be sent in a 304 response unless\nthey are being used to guide cache updates:\n\n%(headers)s\n\nSee [RFC 9110 Section 15.4.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-15.4.5) for\nmore information.": "Ces en-têtes sont des métadonnées de représentation qui ne doivent pas être envoyées dans une réponse 304, sauf si elles sont utilisées pour guider les mises à jour du cache :\n\n%(headers)s\n\nVoir [RFC 9110 Section 15.4.5](https://www.rfc-editor.org/rfc/rfc9110.html#section-15.4.5) pour\nplus d’informations.",
    "This field is designed to only occur once in a message. When it occurs more than once, a receiver\nneeds to choose the one to use, which can lead to interoperability problems, since different\nimplementations may make different choices.": "Ce champ est conçu pour n'apparaître qu'une seule fois dans un message. Lorsqu'il apparaît plus d'une fois, un récepteur doit choisir celui à utiliser, ce qui peut entraîner des problèmes d'interopérabilité, car différentes implémentations peuvent faire des choix différents.",
    "This field is no longer recommended for use, because of interoperability problems and/or\nlack of use.\n\nSee [the deprecation notice](%(deprecation_ref)s) for more information.": "Ce champ n'est plus recommandé pour une utilisation, en raison de problèmes d'interopérabilité et/ou d'un manque d'utilisation.\n\nVoir [l'avis de dépréciation](%(deprecation_ref)s) pour plus d'informations.",
    "This isn't a valid URI. See\n[RFC3986](http://www.ietf.org/rfc/rfc3986.txt) for more information.": "Ce n'est pas une URI valide. Voir\n[RFC3986](http://www.ietf.org/rfc/rfc3986.txt) pour plus d'informations.",
    "This isn't a valid status code; it needs to be an ASCII integer.": "Ce n'est pas un code d'état valide ; il doit s'agir d'un entier ASCII.",
    "This resource varies in %(vary_count)s ways.": "Cette ressource varie de %(vary_count)s manières.",
    "This value must be an integer.": "Cette valeur doit être un entier.",
    "Transparent Content Negotiation is not widely supported.": "La négociation de contenu transparente n'est pas largement prise en charge.",
    "Unsafe script evaluation is allowed.": "L'évaluation de script non sécurisée est autorisée.",
    "Usually, responses to authenticated requests can't be stored by shared caches. However, because\nThis response contains a `Cache-Control: %(directive)s` directive, it can be stored by all caches,\nincluding shared caches (like those in proxies).": "Habituellement, les réponses aux requêtes authentifiées ne peuvent pas être stockées par les caches partagés. Cependant, parce que cette réponse contient une directive `Cache-Control: %(directive)s`, elle peut être stockée par tous les caches, y compris les caches partagés (tels que ceux des proxies).",
    "Vary: * effectively makes this response uncacheable.": "Vary: * rend effectivement cette réponse impossible à mettre en cache.",
    "Vary: Host is not necessary.": "Vary: Host n'est pas nécessaire.",
    "Vary: User-Agent can cause cache inefficiency.": "Vary: User-Agent peut entraîner une inefficacité du cache.",
    "When a response doesn't have explicit freshness information (like a `Cache-Control: max-age` \ndirective, or `Expires` header), caches are allowed to estimate how fresh it is using a heuristic\n(provided that the status code allows it).\n\nCaches often do this using the `Last-Modified` header. For example, if a response was last modified a\nweek ago, a cache might consider it fresh for a day.\n\nConsider adding a `Cache-Control: max-age` header; otherwise, it may be cached for longer or shorter\nthan you'd like.": "Lorsqu'une réponse n'a pas d'informations explicites sur sa fraîcheur (comme une directive `Cache-Control: max-age` ou un en-tête `Expires`), les caches sont autorisés à estimer sa fraîcheur à l'aide d'une heuristique (à condition que le code de statut le permette).\n\nLes caches le font souvent en utilisant l'en-tête `Last-Modified`. Par exemple, si une réponse a été modifiée pour la dernière fois il y a une semaine, un cache pourrait la considérer comme fraîche pendant une journée.\n\nEnvisagez d'ajouter un en-tête `Cache-Control: max-age` ; sinon, elle pourrait être mise en cache plus longtemps ou moins longtemps que vous ne le souhaiteriez.",
    "When a status code is deprecated, it should not be used, because its meaning is not well-defined\nenough to ensure interoperability.": "Lorsqu'un code d'état est obsolète, il ne doit pas être utilisé, car sa signification n'est pas assez bien définie pour garantir l'interopérabilité.",
    "While caches can store many kinds of response as being heuristically cacheable -- that is, \nthey can store them without explicit caching directives like Cache-Control:max-age, this\nreponse's status code is not defined as being heuristically cacheable, and other directives\nthat would allow it to be stored (such as Cache-Control: public) are not present.\n\nNote that a cache extension might override this behaviour.": "Bien que les caches puissent stocker de nombreux types de réponses comme étant heuristiquement cachables — c'est-à-dire qu'ils peuvent les stocker sans directives de mise en cache explicites comme Cache-Control:max-age, le code d'état de cette réponse n'est pas défini comme étant heuristiquement cachable, et d'autres directives qui permettraient son stockage (comme Cache-Control: public) ne sont pas présentes.\n\nNotez qu'une extension de cache peut outrepasser ce comportement.",
    "[Content Security Policy](https://www.w3.org/TR/CSP3/) allows the server to declare\nthe sources of content that browsers are allowed to use on a page.%(report_only_text)s": "[Content Security Policy](https://www.w3.org/TR/CSP3/) permet au serveur de déclarer\nles sources de contenu que les navigateurs sont autorisés à utiliser sur une page.%(report_only_text)s",
    "`Cache-Control: public` and `Cache-Control: private` conflict; they should not occur on the same message.\n\nConservative caches will ignore `public` and honor `private`, but this cannot be relied upon.": "`Cache-Control: public` et `Cache-Control: private` sont en conflit ; ils ne devraient pas apparaître sur le même message.\n\nLes caches conservateurs ignoreront `public` et respecteront `private`, mais on ne peut pas s'y fier.",
    "`Content-Length` is used by HTTP to delimit messages; that is, to mark the end of one message and\nthe beginning of the next.": "`Content-Length` est utilisé par HTTP pour délimiter les messages ; c'est-à-dire, pour marquer la fin d'un message et le début du suivant.",
    "`Content-Length` is used by HTTP to delimit messages; that is, to mark the end of one message and\nthe beginning of the next. An incorrect `Content-Length` can cause security and interoperability\nissues.\n\nThe actual content size was %(content_length)s bytes.": "`Content-Length` est utilisé par HTTP pour délimiter les messages ; c'est-à-dire pour marquer la fin d'un message et le début du suivant. Un `Content-Length` incorrect peut causer des problèmes de sécurité et d'interopérabilité.\n\nLa taille réelle du contenu était de %(content_length)s octets.",
    "cache directive names are case-insensitive, but some implementations don't\nrecognize directives that aren't all-lowercase.\n\nTherefore, it's safest to use `%(directive_lower)s` instead of `%(directive)s`.": "les noms de directives de cache ne tiennent pas compte de la casse, mais certaines implémentations ne\nreconnaissent pas les directives qui ne sont pas toutes en minuscules.\n\nPar conséquent, il est plus sûr d'utiliser `%(directive_lower)s` au lieu de `%(directive)s`."
  }
}